Repository: uccser/cs-unplugged
Catalog: csunplugged/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, it, mi

source: Computational Thinking could be described as 'thinking like a Computer Scientist', but it is now an important skill for everyone to learn, whether they want to be a Computer Scientist or not! It’s interesting, and important, to note that Computational Thinking, and Computer Science, aren’t entirely about computers, they are more about <strong>people</strong>. You might think that we write programs for computers, but really we write programs for people - to help them communicate, find information, and solve problems.
de: Informatisches Denken könnte auch als „wie ein Informatiker denken“ umschrieben werden. Es ist jedoch inzwischen eine wichtige Fähigkeit, die jeder lernen sollte, ob man nun Informatiker werden möchte oder nicht! Als interessanter und wichtiger Hinweis sollte festgehalten werden, dass es bei informatischem Denken und Informatik nicht gänzlich um Computer geht, sondern eher um <strong>Menschen</strong>. Man könnte denken, dass wir Programme für Computer schreiben, in Wirklichkeit schreiben wir Programme jedoch für Menschen – damit sie kommunizieren, Informationen finden und Probleme lösen können.
es: El pensamiento computacional se puede describir como "pensar como un informático", pero hoy en día es una habilidad importante que todo el mundo debería aprender, ¡aunque no quieran ser informáticos! Es interesante, e importante, señalar que el pensamiento computacional y la Informática no tratan solo de ordenadores, tienen más que ver con las <strong>personas</strong>. Podrías pensar que escribimos programas para ordenadores, pero realmente los escribimos para las personas - para ayudarlas a comunicarse, a encontrar información y a resolver problemas.
fr: La Pensée Informatique pourrait être décrite comme « penser comme un chercheur en informatique », mais c’est maintenant une compétence importante à apprendre pour tous, que vous vouliez devenir informaticien ou non ! Il est intéressant, et important, de noter que la Pensée Informatique, et la science informatique, ne se limitent pas aux ordinateurs, elles concernent les <strong>gens</strong>. Vous pourriez penser que nous écrivons des programmes pour les ordinateurs, mais en fait nous écrivons des programmes pour les gens - pour les aider à communiquer, trouver des informations et résoudre des problèmes.
it: Il pensiero computazionale potrebbe essere descritto come 'pensare come un informatico', ma ora è un'abilità importante per tutti da apprendere, sia che vogliano diventare informatici sia che non lo vogliano! È interessante e importante notare che il pensiero computazionale e l'Informatica non riguardano solo i computer, ma riguardano molto di più le <strong>persone</strong>. Potresti pensare che scriviamo programmi per i computer, ma in realtà scriviamo programmi per le persone - per aiutarle a comunicare, trovare informazioni e risolvere problemi.
mi: Tērā pea ka kīia ko te Whakaaro Rorohiko te 'whakaaro pērā ki te Kaipūtaiao Rorohiko', engari i ēnei rā, he pūkenga nui ēnei momo mōhiotanga kia ako te tangata, ahakoa ka pīrangi kia mahi hei kaipūtaiao rorohiko, kāore rānei! Ko te mea rerekē nei, ehara i te mea mō te rorohiko anake ēnei mea te whakaaro rorohiko me te pūtaiao rorohiko, engari mā te <strong>tangata</strong> rawa ēnei. Tērā e pōhēhētia ka tuhiwaehere tātou mō te rorohiko, engari, ka tuhi waehere tātou mā te tangata - ki te hāpai i te whakawhitiwhiti me te rapu mōhiohio me te whakaoti i ngā rapanga.

source: For example, you might use an app on a smartphone to get directions to a friend's house; the app is an example of a computer program, and the smartphone is the "information processing agent" that runs the program for us. Whoever designed the algorithm for working out the best route, and all the details like the interface and how to store the map, applied computational thinking to design the system. But they didn't design it for the sake of the smartphone; they designed it to help the person using the smartphone.
de: Nehmen wir als Beispiel eine App auf einem Smartphone, über die man eine Wegbeschreibung zum Haus eines Freundes abrufen kann: Die App ist das Computerprogramm und das Smartphone ist der „informationsverarbeitende Vermittler“, der das Programm für uns ausführt. Wer auch immer den Algorithmus zur Ermittlung der besten Strecke konzipiert hat, und all die Details wie die Benutzeroberfläche oder wie die Karte gespeichert wird, hat informatisches Denken angewendet, um das System zu konzipieren. Der- oder diejenige hat dies jedoch nicht dem Smartphone zuliebe entwickelt. Es wurde entwickelt, um der Person zu helfen, die das Smartphone benutzt.
es: Por ejemplo, puedes usar una aplicación en un smartphone para ver cómo llegar a la casa de un amigo; la aplicación es un ejemplo de un programa de ordenador y el smartphone es el "agente de procesamiento de información" que ejecuta el programa para nosotros. Quienes diseñaron el algoritmo para encontrar la mejor ruta y todos los detalles como la interfaz y cómo almacenar el mapa, aplicaron el pensamiento computacional para diseñar el sistema. Pero no lo diseñaron por el bien del smartphone; lo diseñaron para ayudar a la persona que lo usa.
fr: Par exemple, vous pourriez utiliser une application sur un smartphone pour obtenir l'itinéraire qui mène à la maison d'un ami ; l'application est un exemple de programme d'ordinateur, et le smartphone est l'"agent de traitement de l'information" qui exécute le programme pour nous. Celui qui a conçu l'algorithme pour trouver le meilleur chemin, et tous les détails comme l'interface ou la façon de stocker la carte en mémoire, applique la Pensée Informatique pour concevoir le système. Mais ils ne l'ont pas conçu pour le bien du smartphone ; ils l'ont conçu pour aider la personne qui utilise le smartphone.
it: Ad esempio, potresti utilizzare un'app su uno smartphone per ottenere indicazioni stradali per la casa di un amico; l'app è un esempio di programma per computer e lo smartphone è "l'agente di elaborazione delle informazioni" che esegue il programma per noi. Chiunque abbia progettato l'algoritmo per trovare il percorso migliore e tutti i dettagli come l'interfaccia, o come memorizzare la mappa, ha applicato il pensiero computazionale per progettare il sistema. Ma gli sviluppatori non l'hanno progettato per lo smartphone; l'hanno progettato per aiutare la persona che utilizza lo smartphone.
mi: Hei tauira, ka whakamahi pea koe i te taupānga o tō waea pūkoro ki te rapu i te ara ki te whare o tō hoa; he tauira papatono rorohiko te taupānga, ā, ko te waea pūkoro te "kaikawe tukatuka mōhiohio" e whakahaere ana i te papatono mā tātou. Ahakoa ko wai te tangata nāna nei te hātepe i hoahoa hei kimi i te ara pai rawa atu, me ngā āhuatanga katoa pērā i te atanga, ka pēhea hoki te whakaputu i te mahere, nāna i whakamahi i te whakaaro rorohiko hei hoahoa i te pūnaha. Heoi anō, kāore i hoahoatia e rātou mā te waea pūkoro noa iho; i hoahoatia e rātou hei āwhina i te tangata e whakamahi ana i te waea pūkoro.

source: Computational Thinking in CS Unplugged
de: Informatisches Denken auf CS Unplugged
es: Pensamiento computacional en CS Unplugged
fr: La Pensée Informatique dans CS Unplugged
it: Pensiero computazionale in CS Unplugged
mi: Te Whakaaro Rorohiko kei roto i te CS Unplugged

source: <p> Throughout the lessons and units in CS Unplugged there are many links to Computational Thinking. Teaching Computational Thinking through CS Unplugged activities teaches students how to: </p> <ul> <li>describe a problem,</li> <li>identify the important details needed to solve this problem,</li> <li>break the problem down into small, logical steps,</li> <li>use these steps to create a process (algorithm) that solves the problem,</li> <li>and then evaluate this process.</li> </ul>
de: <p> Aus allen Lektionen und Unterrichtseinheiten auf CS Unplugged ergeben sich zahlreiche Verbindungen zu informatischem Denken. Beim Unterrichten von informatischem Denken mithilfe von CS Unplugged Aktivitäten lernen Schüler: </p> <ul> <li>ein Problem zu beschreiben,</li> <li>die zur Lösung des Problems erforderlichen Details zu identifizieren,</li> <li>das Problem in kleine, logische Schritte zu zerlegen, </li> <li>anhand dieser Schritte einen Prozess (Algorithmus) zur Lösung des Problems zu erstellen</li> <li>und dann diesen Prozess zu beurteilen.</li> </ul>
es: <p> A lo largo de las lecciones y las unidades en CS Unplugged hay muchos enlaces al pensamiento computacional. La enseñanza del pensamiento computacional a través de las actividades de CS Unplugged le enseña a los alumnos cómo: </p> <ul> <li>describir un problema,</li> <li>identificar los detalles importantes necesarios para resolver este problema,</li> <li>descomponer el problema en pequeños y lógicos pasos,</li> <li>utilizar estos pasos para crear un proceso (algoritmo) que resuelva el problema,</li> <li>y luego evaluar este proceso.</li> </ul>
fr: <p> Tout au long des leçons et des modules de CS Unplugged, vous trouverez beaucoup de liens avec la Pensée Informatique. L'enseignement de la Pensée Informatique par le biais des activités CS Unplugged enseigne aux élèves comment : </p> <ul> <li>décrire un problème,</li> <li>identifier les informations importantes nécessaires pour résoudre ce problème,</li> <li>diviser le problème en petites étapes logiques,</li> <li>utiliser ces étapes pour créer un processus (algorithme) qui résout le problème,</li> <li>et ensuite évaluer ce processus.</li> </ul>
it: <p> In tutte le lezioni e le unità di CS Unplugged ci sono molti collegamenti al pensiero computazionale. Insegnare il pensiero computazionale attraverso le attività CS Unplugged insegna agli studenti come: </p> <ul> <li>descrivere un problema, </li> <li>identificare i dettagli importanti necessari per risolvere questo problema, </li> <li>scomporre il problema in piccoli passi logici, </li> <li>utilizzare questi passaggi per creare un processo (algoritmo) che risolve il problema, </li> <li> e quindi valutare questo processo.</li> </ul>
mi: <p> Kei roto i ngā akomanga, me ngā wāhanga o CS Unplugged, he maha ngā hononga ki te Whakaaro Rorohiko. Mā te whakaako i te Whakaaro Rorohiko mā ngā mahinga o CS Unplugged e ako ai ngā ākonga ki te: </p> <ul> <li>whakaahua i tētahi rapanga,</li> <li>tautuhi i ngā meka nui hei whakaoti i tēnei rapanga,</li> <li>whakawāhi i te rapanga ki ngā wāhanga mahi iti, arorau hoki,</li> <li>whakamahia ngā wāwāhinga ki te waihanga i tētahi tukanga (hātepe) e whakaoti ai te rapanga,</li> <li>kātahi ka aromātai i tēnei tukanga.</li> </ul>

source: These skills are transferable to any other curriculum area, but are particularly relevant to developing digital systems and solving problems using the capabilities of computers.</p>
de: Diese Fähigkeiten sind auf beliebige andere Bildungsbereiche übertragbar, sind jedoch insbesondere wichtig, um digitale Systeme zu entwickeln und Probleme mithilfe der Einsatzmöglichkeiten von Computern zu lösen.</p>
es: Estas habilidades son transferibles a cualquier otra área curricular, pero son particularmente relevantes para desarrollar sistemas digitales y para resolver problemas utilizando la capacidad de los ordenadores.</p>
fr: Ces compétences sont transférables à toute autre discipline, mais sont particulièrement pertinentes pour le développement des systèmes numériques et les résolutions de problèmes en utilisant les capacités des ordinateurs.</p>
it: Queste competenze sono trasferibili a qualsiasi altra area disciplinare, ma sono particolarmente rilevanti per lo sviluppo di sistemi digitali e la risoluzione di problemi utilizzando le potenzialità dei computer.</p>
mi: He pūkenga ēnei ka taea te whakawhiti atu ki marautanga kē, heoi anō, he tino hāngai ki te waihanga i ngā pūnaha hangarau matihiko me te whakaoti rapanga mā ngā āheitanga o te rorohiko.</p>

source: These Computational Thinking concepts are all connected to each other and support each other, but it's important to note that not all aspects of Computational Thinking will necessarily happen in every unit or lesson. In each unit and lesson we've highlighted the important connections for you to observe your students in action.
de: Diese informatischen Denkkonzepte sind alle miteinander verbunden und stützen sich gegenseitig. Insoweit möchten wir jedoch anmerken, dass nicht alle Aspekte des informatischen Denkens in jeder Unterrichtseinheit oder Lektion vorkommen. Wir haben in den einzelnen Unterrichtseinheiten und Lektionen die für Sie wichtigen Verbindungen hervorgehoben, um Ihre Schüler in Aktion zu beobachten.
es: Estos conceptos del pensamiento computacional están todos conectados entre sí y se apoyan mutuamente, pero es importante tener en cuenta que no necesariamente todos los aspectos del pensamiento computacional ocurrirán en cada unidad o lección. En cada unidad y lección, hemos resaltado las conexiones importantes para que puedas observar a tus alumnos en acción.
fr: Ces concepts de la Pensée Informatique sont tous reliés les uns aux autres et se soutiennent les uns les autres, mais il est important de noter que tous les aspects de la Pensée Informatique ne se trouveront pas nécessairement dans chaque module ou leçon. Dans chaque module et chaque leçon, nous avons mis en évidence les liens importants qui vous permettent d'observer vos élèves en action.
it: Questi concetti di Pensiero Computazionale sono tutti collegati tra loro e si supportano l'uno con l'altro, ma è importante notare che non tutti gli aspetti del Pensiero Computazionale sono necessariamente presenti in ogni unità o lezione. In ogni unità e lezione abbiamo messo in evidenza le connessioni importanti, affinché tu le possa osservare nei tuoi studenti in azione.
mi: Ka honohono, ka tautoko hoki katoa ēnei ariā Whakaaro Rorohiko, engari ko te mea nui kia mōhio kāore e kitea ngā āhuatanga katoa o te Whakaaro Rorohiko i roto i ia wāhanga ako, i ia akoranga rānei. Kua tīpako mātou i ngā hononga whakahirahira i roto i ia wāhanga ako, i ia akoranga hoki kia mātakitaki ai koe i ō ākonga e mahi ana.

source: There are a number of definitions of Computational Thinking, but most have a set of 5 or 6 problem solving skills that Computational Thinking embodies. For the Unplugged project we've identified the following six CT skills that are often mentioned in the literature; they are described below, and at the end of each Unplugged lesson we've identified ways that these skills appeared in the lesson, to help you see the CT connection with the lessons.
de: Es gibt etliche Definitionen für informatisches Denken, die meisten weisen jedoch fünf oder sechs Problemlösungsfähigkeiten aus, die informatisches Denken verkörpert. Für das Unplugged-Projekt haben wir die folgenden sechs informatischen Denkfähigkeiten identifiziert, die häufig in der Literatur erwähnt werden. Diese sind nachstehend beschrieben und am Ende einer jeden Unplugged-Lektion finden Sie Hinweise dazu, wie diese Fähigkeiten in der Lektion in Erscheinung treten, um Ihnen die Verbindung zwischen informatischem Denken und der Lektion zu verdeutlichen.
es: Hay una serie de definiciones de pensamiento computacional, pero la mayoría tiene un conjunto de 5 o 6 habilidades de resolución de problemas que representan el pensamiento computacional. Para el proyecto Unplugged, hemos identificado las siguientes seis habilidades de PC que a menudo se mencionan en la bibliografía; se describen a continuación y al final de cada lección de Unplugged, hemos identificado las formas en que se manifestaron estas habilidades en la lección, para ayudarte a ver la conexión del PC con las lecciones.
fr: Il y a un certain nombre de définitions de la Pensée Informatique, mais la plupart ont un ensemble de 5 ou 6 compétences de résolution de problèmes qu'incarne la Pensée Informatique. Pour le projet Unplugged, nous avons identifié six des compétences de Pensée Informatique qui sont souvent mentionnées dans la littérature ; elles sont décrites ci-dessous, et, à la fin de chaque leçon Unplugged, nous avons identifié la façon dont ces compétences apparaissent dans ces leçons, pour vous aider à voir les connexions de la Pensée Informatique avec elles.
it: Ci sono numerose definizioni di pensiero computazionale, ma la maggior parte includono un insieme di 5 o 6 abilità di problem solving che il pensiero computazionale incarna. Per il progetto CS Unplugged abbiamo identificato le seguenti sei abilità di pensiero computazionale che sono spesso citate nella letteratura; sono descritte qui sotto, e alla fine di ogni lezione Unplugged abbiamo identificato i modi in cui queste abilità compaiono nella lezione, per aiutarvi a vedere le connessioni tra il pensiero computazionale e tali lezioni.
mi: He maha ngā tautuhinga mō te Whakaaro Rorohiko, heoi anō, mō te nuinga, ka kitea te huinga pūkenga e 5, e 6 rānei o ngā pūkenga whakaoti rapanga. Mō te hinonga Unplugged, kua whakatau mātou i ngā pūkenga Whakaaro Rorohiko e ono kei raro nei. Ka kitea whānuitia ēnei pūkenga i roto i ngā tuhinga rangahau; ka whakamāramatia ēnei kei raro, kei te mutunga hoki o ia akomanga Unplugged, me te whakamārama hoki i pēhea i tipu ai aua pūkenga i roto i ngā mahi kia kite ai koe i ngā hononga ki te Whakaaro Rorohiko.

source: Computational Thinking skills
de: Informatische Denkfähigkeiten
es: Habilidades del pensamiento computacional
fr: Les compétences de la Pensée Informatique
it: Abilità di pensiero computazionale
mi: Ngā Pūkenga Whakaaro Rorohiko

source: Algorithmic thinking
de: Algorithmisches Denken
es: Pensamiento algorítmico
fr: Pensée algorithmique
it: Pensiero algoritmico
mi: Te Whakaaro Hātepe

source: Algorithms are at the heart of Computational Thinking and Computer Science, because in Computer Science the solutions to problems are not simply an answer (e.g. ‘42’, or a fact), they are algorithms. An algorithm is a step-by-step process that solves a problem or completes a task. If you follow the algorithm's steps correctly, you will arrive at a correct solution, even for different inputs. For example, we can use an algorithm to find the shortest route between two locations on a map; the same algorithm can be used for any pair of starting and finishing points, so the solution depends on the input to the algorithm. If we know the algorithm for solving a problem then we can solve that problem easily, whenever we want, without having to think! We can just follow the steps. Computers can’t think for themselves, so they need to be given algorithms to do things.
de: Algorithmen sind das Herzstück von informatischem Denken und Informatik, da es sich bei Lösungen zu Problemen in der Informatik nicht einfach um Antworten (z. B. „42“ oder eine Tatsache) sondern um Algorithmen handelt. Ein Algorithmus ist ein schrittweiser Prozess, anhand dessen ein Problem gelöst oder eine Funktion ausgeführt werden kann. Werden die einzelnen Schritte des Algorithmus genau befolgt, erhält man selbst bei unterschiedlichen Eingaben stets eine richtige Lösung. Beispielsweise können wir einen Algorithmus dazu einsetzen, den kürzesten Weg zwischen zwei Orten auf einer Karte zu ermitteln. Derselbe Algorithmus kann für jede beliebige Kombination an Start- und Zielpunkten verwendet werden; die Lösung hängt also von der Eingabe in den Algorithmus ab. Wenn wir den Algorithmus zur Lösung einer Problemstellung kennen, können wir dieses Problem jederzeit im Nu lösen, ohne darüber nachdenken zu müssen, indem wir einfach die Schritte befolgen! Computer können nicht selbst denken und müssen daher mit Algorithmen gefüttert werden, um Funktionen auszuführen.
es: Los algoritmos están en el corazón del pensamiento computacional y la informática, porque en informática las soluciones a los problemas no son simplemente respuestas (p. ej. "42" o un hecho), sino que son algoritmos. Un algoritmo es un proceso que paso por paso resuelve un problema o completa una tarea. Si sigues los pasos del algoritmo correctamente, llegarás a una solución correcta, incluso para diferentes entradas. Por ejemplo, podemos usar un algoritmo para encontrar la ruta más corta entre dos ubicaciones en un mapa; el mismo algoritmo se puede usar para cualquier par de puntos de inicio y llegada, por lo que la solución depende de la entrada del algoritmo. Si conocemos el algoritmo para resolver un problema, entonces podemos resolver ese problema fácilmente, cuando queramos, ¡sin tener que pensar! Solo debemos seguir los pasos. Los ordenadores no pueden pensar por sí mismos, por lo que necesitan algoritmos para hacer las cosas.
fr: Les algorithmes sont au cœur de la Pensée Informatique et de l'informatique, parce que dans l'informatique, les solutions aux problèmes ne sont pas simplement une réponse (par exemple ‘42’, ou un fait), ce sont des algorithmes. Un algorithme est un processus étape-par-étape qui permet de résoudre un problème ou d'accomplir une tâche. Si vous suivez correctement les étapes de l'algorithme, vous arriverez à une solution correcte, même pour différentes entrées. Par exemple, on peut utiliser un algorithme pour trouver l'itinéraire le plus court entre deux points sur une carte ; le même algorithme peut être utilisé pour n'importe quelle paire de départ et d'arrivée, de sorte que la solution dépend de l'entrée de l'algorithme. Si nous connaissons l'algorithme pour résoudre un problème, alors on peut résoudre ce problème facilement, quand on veut, sans avoir à réfléchir ! Il nous suffit de suivre les étapes. Les ordinateurs ne peuvent pas penser par eux-mêmes, donc nous devons leur donner des algorithmes pour faire les choses.
it: Gli algoritmi sono al centro del pensiero computazionale e dell'Informatica, perché in informatica le soluzioni ai problemi non sono semplicemente una risposta (ad esempio "42", o un fatto), sono algoritmi. Un algoritmo è un processo passo-passo che risolve un problema o completa un compito. Se segui correttamente i passi dell'algoritmo, arriverai ad una soluzione corretta, anche per dati in ingresso diversi. Ad esempio, possiamo utilizzare un algoritmo per trovare il percorso più breve tra due posizioni su una mappa; lo stesso algoritmo può essere utilizzato per qualsiasi coppia di punti di partenza e di arrivo, quindi la soluzione dipende dall'input all'algoritmo. Se conosciamo l'algoritmo per risolvere un problema, possiamo risolverlo facilmente quando vogliamo, senza dover pensare! Basta solo seguire i passi. I computer non possono pensare da soli, quindi siamo noi a dover fornire loro gli algoritmi per fare le cose.
mi: Ka noho te hātepe hei ngākau mō te Whakaaro Rorohiko me te Pūtaiao Rorohiko, nā te mea, mō te pūtaiao rorohiko, ehara te whakautu te mea nui (hei tauira: '42', ko tētahi meka noa iho rānei), ko te hātepe te mea nui. Ko te hātepe he tohutohu māmā e āta rārangihia ana hei whakaoti rapanga. Ina whāia te raupapa o te hātepe kia tika, ka tae ki te otinga tika, ahakoa ngā tāuru. Hei tauira, ka whakamahia tētahi hātepe ki te kimi i te ara poto rawa mai i tētahi tūnga i te mahere, ki tētahi atu; ka taea te whakamahi i te hātepe ōrite mō ngā ara katoa, ahakoa te tīmatanga me te whakamutunga. Ka rerekē te tāuru ki te hātepe ka rerekē te otinga. Heoi anō, mehemea ka mōhio tātou i te hātepe hei whakaoti i te rapanga, he ngāwari te whakaoti, ahakoa te aha, me te kore whakaaro! Ka whāia noatia e tātou ngā tohutohu o te hātepe. Kāore e taea e te rorohiko te whakaaro, nā reira e hangaia ngā hātepe, kia taea e te rorohiko te whakaoti rapanga.
