Repository: uccser/cs-unplugged
Catalog: csunplugged/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, it, mi

source: Classic CS Unplugged page
de: CS Unplugged Original-Seite
es: Página de CS Unplugged Clásico
fr: Page CS Unplugged classique
it: Pagina di CS Unplugged classico
mi: Whārangi CS Unplugged Classic

source: Translation mode
de: Übersetzungsmodus
es: Modo de traducción
fr: Mode de traduction
it: Modalità di traduzione
mi: Momo whakawhitiwhiti reo

source: Translation mode (Bi-directional)
de: Übersetzungsmodus (bidirektional)
es: Modo de traducción (bidireccional)
fr: Mode de traduction (bidirectionnel)
it: Modalità di traduzione (bidirezionale)
mi: Momo whakawhitiwhiti reo (ngā aronga e rua)

source: General page
de: Allgemeine Seite
es: Página general
fr: Page générale
it: Pagina generale
mi: Whārangi noa

source: 12 digits
de: 12 Stellen
es: 12 dígitos
fr: 12 chiffres
it: 12 cifre
mi: 12 ngā mati

source: 13 digits
de: 13 Stellen
es: 13 dígitos
fr: 13 chiffres
it: 13 cifre
mi: 13 ngā mati

source: Barcode length
de: Barcodelänge
es: Longitud del código de barras
fr: Longueur du code-barres
it: Lunghezza del codice a barre
mi: Roanga pae waehere

source: {} Digit Barcode
de: {}-stelliger Barcode
es: Código de barras de {} dígitos
fr: Code-barre à {} chiffres
it: Codice a barre a {} cifre
mi: {} Mati Pae-waehere

source: Separate!
de: Zerlegen!
es: ¡Separa!
fr: Séparez !
it: Separa!
mi: Whakawehea!

source: Operate!
de: Anwenden!
es: ¡Opera!
fr: Rassemblez !
it: Raggruppa!
mi: Pahekotia!

source: Calculate!
de: Berechnen!
es: ¡Calcula!
fr: Calculez !
it: Calcola!
mi: Tātaihia!

source: Remember that this algorithm uses modulo 10, so we are only interested in the number in the one's column.
de: Achtung: Dieser Algorithmus wird nach Modulo 10 berechnet. Wir sind daher nur an der Zahl in der Einserspalte interessiert.
es: Recuerda que este algoritmo utiliza el módulo 10, por lo que solo nos interesa el número en la columna de las unidades.
fr: Souvenez-vous que cet algorithme utilise le modulo 10, donc ne prenez en compte que le nombre dans la colonne des unités.
it: Ricorda che questo algoritmo utilizza il modulo 10, quindi ci interessa solo la cifra delle unità.
mi: Kia mōhio koe, ka whakamahia te tātai ā-porowhita 10 (modulo 10) mō tēnei hātepe, nā reira, ka aro tātou ki te nama i te tīwae-tahi anake.

source: Display Numbers
de: Zahlen anzeigen
es: Mostrar números
fr: Afficher les nombres
it: Numero di punti visibile
mi: Whakaatu Nama

source: Black on Card Back
de: Schwarze Kartenrückseite
es: Negro en la parte trasera de la carta
fr: Noir au dos des cartes
it: Retro della carta nero
mi: He Pango o Muri o te Kāri

source: Yes - Uses a lot of black ink, but conveys clearer card state. Print double sided.
de: Ja – Verbraucht viel schwarze Tinte, vermittelt aber einen deutlicheren Kartenzustand. Doppelseitig drucken.
es: Sí - Usa mucha tinta negra, pero expresa el estado de la carta de forma más clara. Impresión a doble cara.
fr: Oui - Utilise beaucoup d'encre noire, mais permet de mieux distinguer les deux côtés. Impression recto-verso.
it: Sì - Utilizza un sacco di inchiostro nero, ma trasmette con più chiarezza lo stato della carta. Da stampare fronteretro.
mi: Āe - Ka tino whakapau tae pango, engari ka mārama ake te āhua o te kāri. Whakaritea te pūrere tā kia tāngia ngā taha e rua o te pepa.

source: No - Print single sided.
de: Nein – Einseitig drucken.
es: No - Impresión a una cara.
fr: Non - Imprimer un seul côté.
it: No - Stampa ogni facciata su un foglio (non fronteretro).
mi: Kāore - tāngia kia kotahi te taha o te pepa.

source: with numbers
de: mit Zahlen
es: con números
fr: avec des nombres
it: con numeri
mi: whai nama

source: without numbers
de: ohne Zahlen
es: sin números
fr: sans nombres
it: senza numeri
mi: nama kore

source: with black back
de: mit schwarzer Rückseite
es: con la parte trasera negra
fr: avec dos noir
it: con retro nero
mi: he pango kei muri

source: without black back
de: ohne schwarze Rückseite
es: sin la parte trasera negra
fr: sans dos noir
it: senza retro nero
mi: kāore he pango kei muri

source: Four (1 to 8)
de: Vier (1 bis 8)
es: Cuatro (1 a 8)
fr: Quatre (1 à 8)
it: Quattro (da 1 a 8)
mi: Whā (1 ki te 8)

source: Eight (1 to 128)
de: Acht (1 bis 128)
es: Ocho (1 a 128)
fr: Huit (1 à 128)
it: Otto (da 1 a 128)
mi: Waru (1 ki te 128)

source: Twelve (1 to 2048)
de: Zwölf (1 bis 2048)
es: Doce (1 a 2048)
fr: Douze (1 à 2048)
it: Dodici (da 1 a 2048)
mi: Tekau mā rua (1 ki te 2048)

source: Number of Bits
de: Anzahl der Bits
es: Número de bits
fr: Nombre de bits
it: Numero di bit
mi: Kaute Moka

source: Display Dot Counts
de: Punktezahl anzeigen
es: Mostrar el número total de puntos
fr: Affichage du nombre de points
it: Visualizza Conteggio Punti
mi: Whakaatu i te Kaute o ngā Ira

source: with dot counts
de: mit Punktezahl
es: con número total de puntos
fr: avec le nombre de points
it: con conteggio dei punti
mi: whai kaute ira

source: without dot counts
de: ohne Punktezahl
es: sin número total de puntos
fr: sans le nombre de points
it: senza conteggio dei punti
mi: kāore he kaute ira

source: Student
de: Schüler
es: Alumno
fr: Élève
it: Studente
mi: Ākonga

source: Teacher (solutions)
de: Lehrer (Lösungen)
es: Profesor (soluciones)
fr: Enseignant (solutions)
it: Insegnante (soluzioni)
mi: Kaiako (whakautu)

source: Worksheet Version
de: Arbeitsblattausgabe
es: Versión de la hoja de ejercicios
fr: Version de la fiche
it: Versione del foglio di lavoro
mi: Hei Pepa Mahi

source: Binary
de: Binär
es: Binario
fr: Binaire
it: Binario
mi: Tāhūrua

source: Letter
de: Buchstabe
es: Letra
fr: Lettre
it: Lettera
mi: Pū

source: Binary (0 or 1)
de: Binär (0 oder 1)
es: Binario (0 o 1)
fr: Binaire (0 ou 1)
it: Binario (0 o 1)
mi: Tāhūrua (0, 1 rānei)

source: Lightbulb (off or on)
de: Glühbirne (aus- oder ein)
es: Bombilla (apagada o encendida)
fr: Ampoule (éteinte ou allumée)
it: Lampadina (spenta o accesa)
mi: Pūrama (weto, kā rānei)

source: Value Representation
de: Wertedarstellung
es: Representación de valores
fr: Représentation de la valeur
it: Rappresentazione dei valori
mi: Whakaaturanga Uara

source: Hello, I'm a Programmer
de: Hallo, ich bin ein Programmierer
es: Hola, soy programador
fr: Bonjour, je suis un Programmeur
it: Ciao, sono un Programmatore
mi: Kia ora, he Kaituhiwaehere ahau

source: Hello, I'm a Tester
de: Hallo, ich bin ein Tester
es: Hola, soy tester
fr: Bonjour, je suis un Testeur
it: Ciao, sono un Tester
mi: Kia ora, he Kaiwhakamātau ahau

source: Hello, I'm a Bot
de: Hallo, ich bin ein Bot
es: Hola, soy un bot
fr: Bonjour, je suis un Robot
it: Ciao, sono un Robot
mi: Kia ora, he Karetao ahau

source: Left
de: Links
es: Izquierda
fr: Gauche
it: Sinistra
mi: Mauī

source: Right
de: Rechts
es: Derecha
fr: Droite
it: Destra
mi: Katau

source: Blank
de: Leer
es: En blanco
fr: Vide
it: Vuoto
mi: Wātea

source: Modulo
es: Módulo
mi: Tātai ā-porowhita

source: Easy Numbers (2 digits)
de: Einfache Zahlen (2-stellig)
es: Números fáciles (2 dígitos)
fr: Nombres faciles (2 chiffres)
it: Numeri facili (2 cifre)
mi: Tau Ngāwari (e 2 ngā mati)

source: Medium Numbers (3 digits)
de: Mittelschwere Zahlen (3-stellig)
es: Números de dificultad media (3 dígitos)
fr: Nombres moyennement faciles (3 chiffres)
it: Numeri medi (3 cifre)
mi: Tau Waenga (e 3 ngā mati)

source: Hard Numbers (4 digits)
de: Schwierige Zahlen (4-stellig)
es: Números difíciles (4 dígitos)
fr: Nombres difficiles (4 chiffres)
it: Numeri difficili (4 cifre)
mi: Tau Uaua (e 4 ngā mati)

source: None (Blank)
de: Ohne (Leer)
es: Ninguno (en blanco)
fr: Aucun (vide)
it: Nessuno (Vuoto)
mi: Kore (Wātea)

source: Sorted Numbers
de: Sortierte Zahlen
es: Números ordenados
fr: Nombres triés
it: Numeri ordinati
mi: He Nama Kua Māhititia

source: Unsorted Numbers
de: Unsortierte Zahlen
es: Números desordenados
fr: Nombres non triés
it: Numeri non ordinati
mi: Nama Kāore i Māhititia

source: Number Hunt
de: Zahlensuche
es: Caza de números
fr: La chasse aux nombres
it: Caccia al numero
mi: Te Rapurapu Nama

source: My Boxes
de: Meine Felder
es: Mis cajas
fr: Mes cases
it: Mie scatole
mi: Aku Pouaka

source: Opponent's Boxes
de: Gegnerische Felder
es: Las cajas del adversario
fr: Les cases de l'adversaire
it: Scatole dell'avversario
mi: Ngā Pouaka a te Hoa Kakari

source: <h5>Instructions</h5> <p> <strong>Step 1:</strong> Choose a number in your boxes for your opponent to find. </p> <p> The number my opponent is looking for: _____ </p> <p> <strong>Step 2:</strong> Write down the number your opponent has chosen for you to find. </p> <p> The number of the box I'm looking for: _____ </p> <p> <strong>Step 3:</strong> Ask your opponent for the number stored in a random box. For example: <em>"What is the number in the dotted circle?"</em>. Write the number your opponent says in the box you asked about on the right. Remember to listen for the number you are looking for. </p> <p> <strong>Step 4:</strong> Each time your opponent guesses a box, cross out that box. Keep taking turns until each person's number is found. </p> <p> <strong>Step 5:</strong> Write down the total number of guesses for each person below. </p> <p> <strong>My total guesses:</strong> _____<br> <strong>Opponent's total guesses:</strong> _____ </p>
de: <h5>Anleitung</h5> <p> <strong>Step 1:</strong> Wähle eine Zahl in deinen Feldern, die dein Gegner finden soll. </p> <p> Die von meinem Gegner gesuchte Zahl: _____ </p> <p> <strong>Step 2:</strong> Notiere die Zahl, nach der dich dein Gegner gefragt hat. </p> <p> Die Zahl des Feldes, nach dem ich suche: _____ </p> <p> <strong>Step 3:</strong> Frage deinen Gegner nach der Zahl eines willkürlich ausgewählten Feldes. Zum Beispiel: <em>"Wie lautet die Zahl im gepunkteten Kreis?"</em>. Trage die von deinem Gegner genannte Zahl rechts in das Feld ein, nach dem du gefragt hast. Denke daran, nach der von dir gesuchten Zahl zu horchen. </p> <p> <strong>Step 4:</strong> Wird ein Feld geraten, das entsprechende Feld ausstreichen. Wechselt euch ab, bis die Zahl beider Spieler gefunden wurde. </p> <p> <strong>Step 5:</strong> Schreibe unten die Anzahl der Versuche beider Spieler auf. </p> <p> <strong>Meine Versuche gesamt:</strong> _____<br> <strong>Gegnerische Versuche gesamt:</strong> _____ </p>
es: <h5>Instrucciones</h5> <p> <strong>Paso 1:</strong> Elige un número de tus cajas para que lo encuentre el adversario. </p> <p> El número que está buscando mi adversario es: _____ </p> <p> <strong>Paso 2:</strong> Escribe el número que tu adversario ha elegido para que encuentres. </p> <p> El número de la caja que estoy buscando es: _____ </p> <p> <strong>Paso 3:</strong> Pregunta a tu adversario por el número almacenado en una caja aleatoria. Por ejemplo: <em>"¿Qué número hay en el círculo de puntos?"</em>. Escribe el número que diga tu adversario en la caja por la que has preguntado a la derecha. No te olvides de escuchar para ver si oyes el número que estás buscando. </p> <p> <strong>Paso 4:</strong> Cada vez que tu adversario adivine una caja, táchala. Seguid jugando por turnos hasta que los dos encontréis vuestro número. </p> <p> <strong>Paso 5:</strong> Escribe a continuación el número total de aciertos de cada persona. </p> <p> <strong>Mi número total de aciertos:</strong> _____<br> <strong>El número total de aciertos del adversario:</strong> _____ </p>
fr: <h5>Instructions</h5> <p> <strong>Étape 1 :</strong> Choisissez un nombre dans vos cases que votre adversaire devra trouver. </p> <p> Le nombre que mon adversaire doit trouver : _____ </p> <p> <strong>Étape 2 :</strong> Écrivez le nombre que vous devez trouver, choisi par votre adversaire. </p> <p> Le nombre de la case que je cherche : _____ </p> <p> <strong>Étape 3 :</strong> Demandez à votre adversaire le nombre d'une case choisie au hasard. Par exemple : <em>"Quel est le nombre du cercle en pointillés ?"</em>. Écrivez le nombre donné par votre adversaire dans la case que vous avez choisie, sur la droite de la feuille N'oubliez pas d'écouter le nombre que vous recherchez. </p> <p> <strong>Étape 4 :</strong> Chaque fois que votre adversaire devine une case, cochez cette case. Continuez chacun votre tour, jusqu'à ce que chacun trouve le nombre de l'autre. </p> <p> <strong>Étape 5 :</strong> Écrivez le nombre de questions posées pour chaque joueur ci-dessous. </p> <p> <strong>Mon nombre de questions :</strong> _____<br> <strong>Le nombre de questions de mon adversaire :</strong> _____ </p>
it: <h5>Istruzioni</h5> <p> <strong>Passo 1:</strong> Nelle tue scatole, scegli un numero che l'avversario deve trovare. </p> <p> Il numero che il mio avversario sta cercando: _____ </p> <p> <strong>Passo 2:</strong> Annota il numero che il tuo avversario ha deciso che devi trovare. </p> <p> Il numero della scatola che sto cercando: _____ </p> <p> <strong>Passo 3:</strong> Chiedi al tuo avversario il numero che si trova in una scatola scelta a caso. Per esempio: <em>"Qual è il numero nel cerchio tratteggiato?"</em>. Scrivi nella colonna di destra il numero che il tuo avversario dice essere nella scatola che gli hai chiesto. Ricordati di ascoltare se è il numero che stai cercando. </p> <p> <strong>Passo 4:</strong> Ogni volta che il tuo avversario tenta con una scatola, fai una croce su quella scatola. Continuate ad andare avanti con i turni, finché entrambi non avete trovato il numero che state cercando. </p> <p> <strong>Passo 5:</strong> Scrivi qui sotto il numero totale di tentativi per ogni giocatore. </p> <p> <strong>Il mio numero totale di tentativi:</strong> _____<br> <strong>ll numero totale di tentativi dell'avversario:</strong> _____ </p>
mi: <h5>Ngā Tohutohu</h5> <p> <strong>Takahanga 1:</strong> Kōwhiria tētahi nama o roto i ō pouaka hei kimihanga mā tō hoa kakari. </p> <p> Te nama hei kimihanga mā taku hoa kakari: _____ </p> <p> <strong>Takahanga 2:</strong> Tuhia te nama i kōwhiria e tō hoa kakari hei kimihanga māu. </p> <p> Ko te nama o te pouaka e kimi ana ahau: _____ </p> <p> <strong>Takahanga 3:</strong> Pātai atu ki tō hoa kakari mō te nama, kei roto i tētahi pouaka matapōkere. Hei tauira: <em>"He aha te nama kei roto i te porowhita ira?"</em>. Tuhia tōna nama ki roto i te pouaka i pātai atu koe, kei te taha katau. Āta whakarongo, kei puta te nama e kimi ana koe. </p> <p> <strong>Takahanga 4:</strong> Ia wā ka pātai mai tō hoa kakari mō tētahi pouaka, rīpekangia taua pouaka. Hurihuri ō koutou wā, kia tae ki te wā kua kite ngā nama e rua. </p> <p> <strong>Takahanga 5:</strong> Tuhia te kaute o ngā pātai mā ia tangata ki raro nei. </p> <p> <strong>Aku pātai katoa:</strong> _____<br> <strong>Ngā pātai o taku hoa:</strong> _____ </p>

source: Prefill with Numbers
de: Mit Zahlen ausfüllen
es: Prerellenar con números
fr: Pré-remplir avec des nombres
it: Precompila con numeri
mi: Tuatahi whakakīia ki ngā Nama

source: Numbers Unsorted/Sorted
de: Zahlen sortiert/unsortiert
es: Números desordenados/ordenados
fr: Nombres non triés/triés
it: Numeri non ordinati/ordinati
mi: He Nama Kāore i māhititia/Kua māhititia

source: {} to {}
de: {} bis {}
es: {} a {}
fr: de {} à {} ans
it: Da {} a {}
mi: {} ki {}

source: Black
de: Schwarz
es: Negro
fr: Noir
it: Nero
mi: Pango

source: Blue
de: Blau
es: Azul
fr: Bleu
it: Blu
mi: Kahurangi

source: Green
de: Grün
es: Verde
fr: Vert
it: Verde
mi: Kākāriki

source: Purple
de: Lila
es: Morado
fr: Violet
it: Viola
mi: Waiporoporo

source: Red
de: Rot
es: Rojo
fr: Rouge
it: Rosso
mi: Whero

source: Card back colour
de: Farbe der Kartenrückseite
es: Color del reverso de la carta
fr: Couleur du dos de la carte
it: Colore del retro della carta
mi: Te tae o tua i te kāri

source: Piano key labels
de: Klaviertastenbeschriftung
es: Etiquetas de las teclas del piano
fr: Libellés des touches de piano
it: Etichette dei tasti del pianoforte
mi: Tapanga patuoro piana

source: Black and White (2 possible binary values)
de: Schwarz und Weiß (2 mögliche Binärwerte)
es: Blanco y negro (2 valores binarios posibles)
fr: Noir et blanc (2 valeurs binaires possibles)
it: Bianco e nero (2 possibili valori binari)
mi: Te Pango me te Mā (e āhei ana ngā uara e rua)

source: Black and White (2 possible binary values) in Run Length Encoding
de: Schwarz und Weiß (2 mögliche Binärwerte) bei Lauflängenkodierung
es: Blanco y negro (2 valores binarios posibles) en Run Length Encoding
fr: Noir et blanc (2 valeurs binaires possibles) en codage par plages
it: Bianco e nero (2 possibili valori binari) nella codifica di lunghezza delle sequenze (Run Length Encodings, RLE)
mi: Te Pango me te Mā (e rua ngā uara tāhūrua) i te Whakawaehere Roanga-Rerenga

source: Greyscale (4 possible binary values)
de: Graustufen (4 mögliche Binärwerte)
es: Escala de grises (4 valores binarios posibles)
fr: Niveaux de gris (4 valeurs binaires possibles)
it: Scala di grigi (4 possibili valori binari)
mi: Āwhata hina (e 4 ngā uara tāhūrua)

source: Colour (8 possible binary values)
de: Farbig (8 mögliche Binärwerte)
es: Color (8 valores binarios posibles)
fr: Couleur (8 valeurs binaires possibles)
it: A colori (8 possibili valori binari)
mi: Tae (e 8 ngā uara tāhūrua e taea ai)

source: Star - 1 page
de: Stern – 1 Seite
es: Estrella - 1 página
fr: Étoile - 1 page
mi: Whetū - 1 te whārangi

source: Teacup - 1 page
de: Teetasse – 1 Seite
es: Taza de té - 1 página
fr: Tasse de thé - 1 page
mi: Kapu tī - 1 te whārangi

source: Cat - 1 page
de: Katze – 1 Seite
es: Gato - 1 página
fr: Chat - 1 page
mi: Ngeru - 1 te whārangi

source: Fish - 6 pages
de: Fisch – 6 Seiten
es: Pez - 6 páginas
fr: Poisson - 6 pages
it: Pesce - 6 pagine
mi: Ika - e 6 ngā whārangi

source: Kauri tree - 6 pages
de: Kauribaum – 6 Seiten
es: Árbol kauri - 6 páginas
fr: Arbre Kauri - 6 pages
it: Albero kauri neozelandese - 6 pagine
mi: Rākau kauri - e 6 ngā whārangi

source: Butterfly - 6 pages
de: Schmetterling – 6 Seiten
es: Mariposa - 6 páginas
fr: Papillon - 6 pages
it: Farfalla
mi: Pūrerehua - e 6 ngā whārangi

source: Hot air balloon - 8 pages
de: Heißluftballon – 8 Seiten
es: Globo aerostático - 8 páginas
fr: Montgolfière - 8 pages
it: Mongolfiera - 8 pagine
mi: Poihau-wera - e 8 ngā whārangi

source: Boat - 9 pages
de: Boot – 9 Seiten
es: Barco - 9 páginas
fr: Bateau - 9 pages
it: Barca - 9 pagine
mi: Waka - e 9 ngā whārangi

source: Parrots - 32 pages
de: Papageien – 32 Seiten
es: Loros - 32 páginas
fr: Perroquets - 32 pages
it: Pappagalli - 32 pagine
mi: Kākā - 32 ngā whārangi

source: Black and White
de: Schwarz und Weiß
es: Blanco y negro
fr: Noir et blanc
it: Bianco e nero
mi: Te Pango me te Mā

source: Greyscale
de: Graustufen
es: Escala de grises
fr: Échelle de gris
it: Scala di grigi
mi: Āwhata Hina

source: Colour
de: Farbe
es: Color
fr: Couleur
it: A colori
mi: Tae

source: Star
de: Stern
es: Estrella
fr: Étoile
mi: Whetū

source: Teacup
de: Teetasse
es: Taza de té
fr: Tasse de thé
mi: Kapu tī

source: Cat
de: Katze
es: Gato
fr: Chat
mi: Ngeru

source: Boat
de: Boot
es: Barco
fr: Bateau
it: Barca
mi: Waka

source: Fish
de: Fisch
es: Pez
fr: Poisson
it: Pesce
mi: Ika

source: Hot air balloon
de: Heißluftballon
es: Globo aerostático
fr: Montgolfière
it: Mongolfiera
mi: Poihau wera

source: Parrots
de: Papageien
es: Loros
fr: Les perroquets
it: Pappagalli
mi: Kākā

source: Kauri tree
de: Kauribaum
es: Árbol kauri
fr: Arbre Kauri
it: Albero kauri neozelandese
mi: Rākau Kauri

source: Butterfly
de: Schmetterling
es: Mariposa
fr: Papillon
it: Farfalla
mi: Pūrerehua

source: Colouring type
de: Farbgestaltung
es: Tipo de coloración
fr: Type de coloration
it: Tipo di colorazione
mi: Momo whakakī tae

source: Image
de: Bild
es: Imagen
it: Immagine
mi: Whakaahua

source: Pixel Painter
de: Pixel-Maler
es: Pintor de píxeles
fr: Le Peintre Pixel
it: Pixelartista
mi: Te Peita Tongi-iti

source: This page should be kept secret from students.
de: Diese Seite sollte den Schülern nicht gezeigt werden.
es: Esta página no se debe mostrar a los alumnos.
fr: Cette page ne doit pas être montrée aux élèves.
it: Questa pagina non dovrebbe essere mostrata agli studenti.
mi: Kaua e whākī atu tēnei whārangi ki ngā ākonga.

source: Page grid reference for {} image
de: Seitenrasterreferenz für {}-Bild
es: Referencia de cuadrícula de página para la imagen {}
fr: Référence de grille de page pour l'image {}
it: Griglia di riferimento per l'immagine {}
mi: Taunga tukutuku mō te atahanga {}

source: Once pixels on each page are filled in correctly, cut each grid out and arrange in the following layout (page names are in the top right corner).
de: Sobald die Pixel aller Seiten richtig ausgefüllt sind, die einzelnen Raster ausschneiden und wie folgt anordnen (die Seitennamen befinden sich oben rechts).
es: Una vez que los píxeles de cada página se hayan rellenado correctamente, recorta cada cuadrícula y colócalas en el siguiente orden (los nombres de las páginas se encuentran en la esquina superior derecha).
fr: Une fois que les pixels de chaque page sont coloriés correctement, découpez chaque grille et posez-les suivant la mise en page suivante (les noms de page sont en haut à droite).
it: Una volta che i pixel su ogni pagina sono stati riempiti correttamente, taglia le griglie e disponile nel modo seguente (i nomi delle pagine sono in alto a sinistra).
mi: Ina, kua tika te tuhi i ngā tongi-iti, tapahia te tukutuku, ā, whakatakotoria kia pēnei ki raro nei (kei te taha katau o runga ngā ingoa o ngā whārangi).

source: The pixel values are using 2 bit colour values.
de: Die Pixelwerte verwenden 2-Bit Farbwerte.
es: Los valores de los píxeles usan valores de color de 2 bits.
fr: Les valeurs des pixels utilisent des valeurs de couleur de 2 bits.
it: I valori dei pixel usano colori a 2 bit.
mi: Kei te whakamahi i ngā moka e rua mō ngā uara o ngā tae.

source: The pixel values are using 5 bit RGB colour values (2 red, 2 green, 1 blue).
de: Die Pixelwerte verwenden 5-Bit RGB-Farbwerte (2 rot, 2 grün, 1 blau).
es: Los valores de los píxeles usan valores de color RGB de 5 bits (2 rojos, 2 verdes, 1 azul).
fr: Les valeurs des pixels utilisent des valeurs de couleur RVB 5 bits (2 rouge, 2 vert, 1 bleu).
it: I valori dei pixel usano valori a 5 bit RGB (2 rossi, 2 verdi, 1 blu).
mi: Kei te whakamahi ngā uara tongi-iti i ngā moka e 5, RGB mō ngā uara o ngā tae (2 whero, 2 kākāriki, 1 kahurangi).

source: Extra pixel legends are at the end of this document for students.
de: Zusätzliche Pixellegenden befinden sich am Ende des Dokuments für Schüler.
es: Hay leyendas adicionales sobre los píxeles para los alumnos al final de este documento.
fr: Les légendes supplémentaires des pixels sont à la fin de ce document pour les élèves.
it: Legende colori-pixel in più per gli studenti sono disponibili alla fine di questo documento.
mi: Kei te pito mutunga o tēnei kōnae, he pātohu tongi-iti anō mā ngā ākonga.

source: Pixel legend
de: Pixellegende
es: Leyenda de píxeles
fr: Légende des pixels
it: Legenda
mi: Pātohu tongi-iti

source: Run Length Encodings
de: Lauflängenkodierungen
es: Run length encoding
fr: Le codage par plages
it: codifica di lunghezza delle sequenze (Run Length Encodings, RLE)
mi: Ngā Whakawaehere Roanga-Rerenga

source: Encoding for page {}
de: Kodierung für Seite {}
es: Codificación para la página {}
fr: Encodage pour la page {}
it: Codifica per pagina {}
mi: Te whakawaehere mō te whārangi {}

source: Number of cards (15 or 31)
de: Anzahl der Karten (15 oder 31)
es: Número de cartas (15 o 31)
fr: Nombre de cartes (15 ou 31)
it: Numero di carte (15 o 31)
mi: Te kaute kāri (15, 31 rānei)

source: 1 to 99
de: 1 bis 99
es: 1 a 99
fr: de 1 à 99
it: Da 1 a 99
mi: 1 ki te 99

source: 1 to 999
de: 1 bis 999
es: 1 a 999
fr: de 1 à 999
it: Da 1 a 999
mi: 1 ki te 999

source: Number of cards
de: Anzahl der Karten
es: Número de cartas
fr: Nombre de cartes
it: Numero di carte
mi: Kaute kāri

source: Range of numbers
de: Zahlenbereich
es: Rango de números
fr: Fourchette de nombres
it: Intervallo dei numeri
mi: Awhe nama
