Repository: uccser/cs-unplugged
Catalog: csunplugged/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, it, mi

source: <p><strong>Make cake</strong></p> <ol> <li>Bake cake <ol> <li>Put ingredients in bowl (butter, sugar, egg, flour)</li> <li>Mix</li> <li>Pour into tin</li> <li>Put in oven for 30mins</li> <li>Take out of tin</li> </ol> </li> <li>Make icing</li> <li>Put on cake</li> </ol>
de: <p><strong>Kuchen zubereiten</strong></p> <ol> <li>Kuchen backen <ol> <li>Zutaten in eine Schüssel geben (Butter, Zucker, Ei, Mehl)</li> <li>Alle Zutaten verrühren</li> <li>In eine Backform gießen</li> <li>Für 30 Minuten im Ofen backen</li> <li>Aus der Backform nehmen</li> </ol> </li> <li>Glasur zubereiten</li> <li>Auf den Kuchen auftragen</li> </ol>
es: <p><strong>Hacer tarta</strong></p> <ol> <li>Hornear tarta<ol> <li>Poner los ingredientes en un cuenco (mantequilla, azúcar, huevo, harina)</li> <li>Mezclar</li> <li>Verter en el molde</li> <li>Meter al horno durante 30 min.</li> <li>Sacarla del molde</li> </ol> </li> <li>Hacer el glaseado</li> <li>Poner sobre la tarta</li> </ol>
fr: <p><strong>Faire un gâteau</strong></p> <ol> <li>Cuire le gâteau <ol> <li>Mettre les ingrédients dans un bol (beurre, sucre, œuf, farine)</li> <li>Mélanger</li> <li>Verser dans le plat</li> <li>Le mettre dans le four pendant 30 minutes</li> <li>Sortir le plat</li> </ol> </li> <li>Faire le glaçage</li> <li>Le mettre sur le gâteau</li> </ol>
it: <p><strong>Fare una torta</strong></p> <ol> <li>Cucinare la torta <ol> <li>Metti gli ingredienti in una scodella (burro, zucchero, uova, farina)</li> <li>Mescola</li> <li>Versa nella teglia</li> <li>Metti nel forno per 30 minuti</li> <li>Togli la torta dalla teglia</li> </ol> </li> <li>Prepara la glassa</li> <li>Metti la glassa sulla torta</li> </ol>
mi: <p><strong>Mahi Keke</strong></p> <ol> <li>Tunu Keke <ol> <li>Tukua ngā rawa ki te oko (pata, huka, hēki, puehu paraoa)</li> <li>Whakaranuhia</li> <li>Tukua ki te kēne</li> <li>Whakaurua ki te umu kia 30 miniti te roa</li> <li>Tangohia i te kēne</li> </ol> </li> <li>Mahia te pani reka</li> <li>Pania ki runga i te keke</li> </ol>

source: Generalising and patterns
de: Generalisierung und Muster
es: Generalización y patrones
fr: Généralisation et motifs
it: Generalizzazione e riconoscimento di schemi (pattern)
mi: Te whakatau whānui me ngā tauira

source: Generalising is also referred to as 'pattern recognition and generalisation'. Generalisation is taking a solution (or part of a solution) to a problem and generalising it so it can be applied to other similar problems and tasks. Since solutions in Computer Science are algorithms, this means we take an algorithm and make it general enough that it can be used for a range of problems. This process involves abstraction, because to make something more general we have to remove unnecessary details that are related to a specific problem or situation, but are not important to how the algorithm functions.
de: Generalisierung wird auch „Mustererkennung und Generalisierung“ genannt. Generalisierung bedeutet, die Lösung (oder einen Teil einer Lösung) eines Problems heranzuziehen und zu verallgemeinern, sodass sie auf andere ähnliche Problematiken und Aufgabenstellungen angewandt werden kann. Nachdem es sich bei Lösungen in der Informatik um Algorithmen handelt, bedeutet dies, dass wir einen Algorithmus heranziehen und diesen so verallgemeinern, dass er für eine Reihe von Problemen verwendet werden kann. Um etwas zu verallgemeinern, ist Abstraktion erforderlich, da unwichtige Details, die sich auf eine bestimmte Problematik oder Situation beziehen, jedoch für die Funktionsweise des Algorithmus unwichtig sind, außer Acht gelassen werden müssen.
es: La generalización también se conoce como "reconocimiento y generalización de patrones". La generalización consiste en tomar una solución (o parte de una solución) a un problema y generalizarla para que se pueda aplicar a otros problemas y tareas similares. Dado que las soluciones en informática son algoritmos, esto significa que debemos tomar un algoritmo y hacerlo lo suficientemente general de manera que se pueda usar para una variedad de problemas. Este proceso implica la abstracción, ya que para hacer algo más general, tenemos que eliminar detalles innecesarios que están relacionados con un problema o una situación específica, pero no son importantes para el funcionamiento del algoritmo.
fr: La généralisation est aussi appelée "reconnaissance des motifs et généralisation'. La généralisation est l'utilisation d'une solution (ou une partie d'une solution) à un problème et sa généralisation pour qu'elle puisse être appliquée à d'autres problèmes et tâches similaires. Étant donné que les solutions en informatique sont des algorithmes, cela signifie que nous prenons un algorithme et que nous le rendons assez général pour qu'il puisse être utilisé pour toute une famille de problèmes. Ce processus implique de l'abstraction car, pour faire quelque chose de plus général, nous devons supprimer des détails inutiles qui sont liées à un problème ou une situation spécifiques, mais ne sont pas importants dans la façon dont l'algorithme fonctionne.
it: La generalizzazione viene anche definita "riconoscimento di schemi e generalizzazione". Generalizzazione significa prendere una soluzione (o parte di una soluzione) a un problema e generalizzarla in modo che possa essere applicata ad altri problemi e compiti simili. Poiché le soluzioni in Informatica sono algoritmi, questo significa che prendiamo un algoritmo e lo rendiamo abbastanza generale da poter essere utilizzato per una serie di problemi. Questo processo coinvolge l'astrazione, perché per fare qualcosa di più generale dobbiamo rimuovere i dettagli non necessari relativi a un problema o situazione specifici, ma non sono importanti per il funzionamento dell'algoritmo.
mi: Ka kīia hoki te 'whakatau whānui' ko 'te hopu tauira me te whakatau whānui'. Ko te 'whakatau whānui', ko te whakamahinga o tētahi otinga rapanga (he wahanga o te otinga rānei), kātahi ka whakawhānuitia taua otinga kia hāngai ki tētahi atu kaupapa, rapanga rānei, mahi rānei. Nā te mea he hātepe ngā otinga o te pūtaiao rorohiko, ka whakawhānuitia te hātepe kia taea ai te whakamahi i ngā rapanga maha. Ki te whakawhānuitia te hātepe, ka whakamahia te waitaratanga, nā te mea, kia whakawhānuitia tētahi kaupapa, me tango ngā taipitopito e hāngai ana ki ngā horopaki whāiti noa kia waiho ake ai ngā āhuatanga nui o te hātepe. "Ruia taitea, kia tū ko taikaka anake".

source: Spotting patterns is an important part of this process, when we think about problems we might recognise similarities between them and that they can be solved in similar ways. This is called pattern matching, and it’s something we do naturally all the time in our daily life.
de: Muster zu erkennen ist ein wichtiger Teil dieses Prozesses. Wenn wir über verschiedene Problematiken nachdenken, fallen uns unter Umständen Ähnlichkeiten zwischen ihnen auf, die auf ähnliche Weise gelöst werden können. Dies wird als Musterabgleich bezeichnet und ist etwas, das wir in unserem täglichen Leben von Natur aus tun.
es: La identificación de patrones es una parte importante de este proceso. Cuando pensamos en problemas, podemos detectar similitudes entre ellos y ver que se pueden resolver de manera similar. Esto se llama concordancia de patrones y es algo que hacemos de forma natural todo el tiempo en nuestra vida diaria.
fr: Repérer des motifs est une partie importante de ce processus, lorsque l'on étudie des problèmes nous pourrions reconnaître des similitudes entre eux et voir qu'ils peuvent être résolus de façon similaire. Cela s'appelle la correspondance de motifs, et c'est quelque chose que nous faisons naturellement tout le temps dans notre vie quotidienne.
it: Il riconoscimento di pattern è una parte importante di questo processo: quando ragioniamo su alcuni problemi potremmo riconoscere le somiglianze tra di essi e accorgerci che possono essere risolti in modi simili. Questo è chiamato 'pattern matching', ed è qualcosa che facciamo sempre e naturalmente nella nostra vita quotidiana.
mi: Ko te kimi i ngā tauira tētahi wāhanga nui o tēnei tukanga. Ki te tīmata te tangata ki te whakaaro mō te rapanga, ka kitea pea ngā āhuatanga ōrite, ā, ka whāia te tauira kia pērā hoki te whakaoti i te rapanga hou. Ka kīia tēnei te rapu tauriterite, ā, ka whakamahia whānuitia e te tangata i āna mahi ia rā, ia rā.

source: Generalised algorithms can be reused for a whole group of similar problems, which means we can come up with solutions quickly and effectively.
de: Generalisierte Algorithmen können für zahlreiche ähnliche Problematiken wiederverwendet werden, was bedeutet, dass wir schnell und effektiv mit Lösungen aufwarten können.
es: Los algoritmos generalizados se pueden reutilizar para un grupo completo de problemas similares, lo que significa que podemos encontrar soluciones de manera rápida y eficaz.
fr: Les algorithmes généralisés peuvent être réutilisés pour tout un ensemble de problèmes similaires, ce qui signifie que nous pouvons trouver des solutions rapidement et de manière efficace.
it: Gli algoritmi generalizzati possono essere riutilizzati per un insieme di problemi simili, il che significa che possiamo trovare soluzioni a tali problemi in modo rapido ed efficace.
mi: Ka taea te hangarua i ngā hātepe whakawhānui mō ngā momo rapanga āhua rite, kia ngāwari ai te waihanga i ngā otinga rapanga hou.

source: Evaluation
de: Auswertung
es: Evaluación
fr: Évaluation
it: Valutazione
mi: Arotakenga

source: Evaluation is about identifying the possible solutions to a problem and judging which is the best to use, if they will work in some situations but not others, and how they can be improved. When judging our solutions we need to think about a range of factors. For example how much time it will take these processes (algorithms) to solve the problem and will it reliably solve the problem, or if there are certain situations where it will perform in a very different way. Evaluation is something we do a lot in our everyday lives.
de: Bei der Auswertung geht es darum, die möglichen Lösungen zu einer Problematik zu identifizieren und zu beurteilen, welche am besten zu verwenden ist, ob diese nur unter gewissen Umständen funktionieren wird und wie sie verbessert werden kann. Wenn wir unsere Lösungen bewerten, müssen wir eine Reihe an Faktoren berücksichtigen. Beispielsweise wie lange werden diese Prozesse (Algorithmen) brauchen, um das Problem zu lösen, und ob das Problem dadurch zuverlässig gelöst werden kann, oder ob das Resultat in bestimmten Situationen anders ausfallen wird. Auch in unserem täglichen Leben nehmen wir oft derartige Auswertungen vor.
es: La evaluación consiste en identificar las posibles soluciones a un problema y juzgar cuál nos conviene usar, si funcionarán en algunas situaciones pero no en otras y cómo se pueden mejorar. Al juzgar nuestras soluciones, debemos pensar en una variedad de factores. Por ejemplo, cuánto tiempo tardarán estos procesos (algoritmos) en resolver el problema y si lo resolverá de forma fiable o si hay ciertas situaciones en las que funcionará de una manera muy diferente. La evaluación es algo que practicamos constantemente en nuestra vida cotidiana.
fr: L'évaluation consiste à identifier les solutions possibles à un problème et juger quelle est la meilleure, si ces solutions vont fonctionner dans certaines situations mais pas dans d'autres, et comment elles peuvent être améliorées. Pour juger de la valeur de nos solutions, nous devons réfléchir à une série de facteurs. Par exemple combien de temps vont prendre ces processus (algorithmes) pour résoudre le problème et est-ce qu'ils sont fiables, ou est-ce qu'il y a certaines situations où ces processus vont s'exécuter de manière totalement différente. L'évaluation est quelque chose que nous faisons beaucoup dans notre vie de tous les jours.
it: La valutazione consiste nell'individuare le possibili soluzioni a un problema e nel decidere quale sia la migliore da usare, capire se tali soluzioni funzioneranno in alcune situazioni ma non in altre, e come possono essere migliorate. Nel valutare le nostre soluzioni, dobbiamo tenere in considerazione una una serie di fattori. Per esempio: quanto tempo impiegheranno questi processi (algoritmi) per risolvere il problema, se risolveranno in modo affidabile il problema, o se ci sono certe situazioni in cui si comporteranno in un modo molto diverso. La valutazione è qualcosa che facciamo spesso nelle nostre vite quotidiane.
mi: Mā te arotake, ka rapua ngā otinga e taea ana mō tētahi rapanga, kātahi ka whiriwhiri ko tēhea te otinga pai ake, ko tēhea e hāngai ana ki ētahi horopaki - kaua ki ētahi atu, ā, ka whakaaro hoki me pēhea te whakapai i te otinga kia kaha ake. I a tātou e arotake ana i te otinga, ka whakaaro hoki mō ngā āhuatanga maha. Me whakaaro mō te roa o te wā ka pau kia oti ai te hātepe (tukanga rānei). Ka whakaaro hoki mō te āhei o te hātepe ki te whakaoti i te rapanga, mō te tika, me ngā pānga o te horopaki rerekē. He mahi nui te arotake mā te tangata ia rā ia rā.

source: There are different ways we can evaluate our algorithmic solutions. We can test their speed by implementing them on a computer; or we can analyse them by counting or calculating how many steps they are likely to take. We can test that our algorithmic solutions work correctly by giving them lots of different inputs, and checking they work as expected. When we do this we need to think about the different inputs we test, because we don’t want to check every possible input (often there's an infinite number of possible inputs!), but we still need to know if our algorithmic solutions will work for all inputs. Testing is something Computer Scientists and programmers do all the time. But because we can't usually test every possible input, we also try to evaluate a system using logical reasoning.
de: Es gibt verschiedene Möglichkeiten, wie wir unsere algorithmischen Lösungen beurteilen können. Wir können ihre Schnelligkeit testen, indem wir sie auf einem Computer implementieren, oder wir können sie analysieren, indem wir zählen oder kalkulieren, wie viele Schritte sie voraussichtlich benötigen werden. Wir können testen, ob unsere algorithmischen Lösungen ordnungsgemäß funktionieren, indem wir sie mit etlichen verschiedene Eingaben versehen und prüfen, ob alles erwartungsgemäß abläuft. Dabei müssen wir uns die verschiedenen von uns getesteten Eingaben genau überlegen, da wir nicht jede nur mögliche Eingabe überprüfen wollen (oftmals gibt es unendlich viele verschiedene mögliche Eingaben!), aber trotzdem feststellen müssen, ob unsere algorithmischen Lösungen für alle Eingaben geeignet sind. Informatiker und Programmierer führen fortwährend Testmaßnahmen durch. Da wir jedoch normalerweise nicht jede mögliche Eingabe testen können, versuchen wir zudem, Systeme anhand von logischem Denken zu beurteilen.
es: Existen diferentes maneras de evaluar nuestras soluciones algorítmicas. Podemos probar su velocidad implementándolas en un ordenador; o podemos analizarlas contando o calculando cuántos pasos es probable que necesiten. Podemos probar que nuestras soluciones algorítmicas funcionan correctamente proporcionándoles muchas entradas diferentes y verificando que funcionan como esperamos. Cuando hacemos esto, tenemos que pensar en las diferentes entradas que probamos, porque no queremos verificar todas las entradas posibles (¡a menudo hay un número infinito de posibles entradas!), pero aún necesitamos saber si nuestras soluciones algorítmicas funcionarán para todas ellas. La realización de pruebas es algo que los informáticos y programadores hacen todo el tiempo. Pero como normalmente no podemos probar todas las entradas posibles, también tratamos de evaluar un sistema utilizando el razonamiento lógico.
fr: Il y a différentes façons d'évaluer nos solutions algorithmiques. Nous pouvons tester leur vitesse en les implémentant sur un ordinateur ; ou nous pouvons les analyser en comptant ou en calculant combien d'opérations ils sont susceptibles de faire. Nous pouvons tester que nos solutions algorithmiques fonctionnent correctement en leur donnant beaucoup d'entrées différentes, et en vérifiant qu'elles fonctionnent comme prévu. Lorsque nous faisons cela, nous devons penser aux différentes entrées que nous testons, parce que nous ne voulons pas vérifier toutes les entrées possibles (souvent il y a un nombre infini d'entrées possibles !), mais nous devons quand même savoir si nos solutions algorithmiques fonctionneront pour toutes les entrées. Tester est quelque chose que les informaticiens et les programmeurs font tout le temps. Mais comme nous ne pouvons généralement pas tester toutes les entrées possibles, nous essayons aussi d'évaluer un système en utilisant un raisonnement logique.
it: Esistono diversi modi in cui possiamo valutare le nostre soluzioni algoritmiche. Possiamo testare la loro velocità implementandole su un computer; oppure possiamo analizzarli contando o calcolando il numero di passi che è probabile che impieghino. Possiamo verificare che le nostre soluzioni algoritmiche funzionino correttamente dando loro molti input diversi e verificando che funzionino come previsto. Quando facciamo ciò, dobbiamo pensare ai diversi input che testiamo, perché non vogliamo controllare ogni possibile input (spesso c'è un numero infinito di input possibili!) ma dobbiamo comunque sapere se le nostre soluzioni algoritmiche funzioneranno per tutti gli input. Testare è una cosa che informatici e programmatori fanno sempre. Ma poiché di solito non possiamo testare ogni possibile input, proviamo anche a valutare un sistema usando il ragionamento logico.
mi: He maha ngā huarahi hei arotake i ā mātou otinga hātepe. Ka āhei te ine i te tere o te hātepe ki te rorohiko; ka kaute rānei i ngā hipanga mahi o te hātepe. Ka whakamātauria te otinga mā te tuku i ngā tāurutanga maha, mā te āta arotake hoki i ngā putanga. Ina pērā te arotake, me mātua whakaaro mō ngā tāurutanga e tika ana, nā te mea, kāore pea e taea te whakamātau i ngā tāurutanga katoa (mō ētahi hātepe, kāore he mutunga mō ngā tāurutanga ka taea!). Heoi anō me arotake tonu te tika o te hātepe ina he rerekē ngā tāuru. Ko te whakamātautau i ngā pūnaha tētahi o ngā mahi nui mō ngā kaipūtaiao rorohiko. Nā te mea, kāore e taea te whakamātautau i ngā tāuru katoa, ka arotekengia te pūnaha mā te whakaaro arorau.

source: Logic
de: Logik
es: Lógica
fr: Logique
it: Logica
mi: Arorau

source: When trying to solve problems we need to think logically. Logical reasoning is about trying to make sense of things by observing, collecting data, thinking about the facts you know, and then figuring things out based on what you already know. It helps us use our existing knowledge to establish rules and check facts.
de: Wenn wir versuchen, Probleme zu lösen, müssen wir logisch denken. Logisches Denken bedeutet, durch Beobachtung, Datenerfassung und Erwägung der uns bekannten Gegebenheiten zu versuchen, einen Sinnzusammenhang herzustellen und dann basierend auf dem uns bereits Bekannten Schlußfolgerungen zu ziehen. Mithilfe unseres bereits vorhandenen Wissens können wir Regeln festlegen und Tatsachen überprüfen.
es: Al tratar de resolver problemas, debemos pensar de forma lógica. El razonamiento lógico consiste en tratar de darle sentido a las cosas observando, recopilando datos, pensando en los hechos conocidos y luego resolviendo las cosas en función de lo que ya se sabe. Nos ayuda a usar nuestro conocimiento existente para establecer reglas y verificar hechos.
fr: Quand nous essayons de résoudre des problèmes nous devons penser de manière logique. Le raisonnement logique, c'est essayer de donner du sens aux choses par l'observation, la collecte de données, la réflexion sur les faits que nous connaissons, et ensuite essayer de comprendre les choses en fonction de ce que nous savons déjà. Cela nous permet d'utiliser nos connaissances existantes pour établir des règles et de vérifier les faits.
it: Quando cerchiamo di risolvere problemi, dobbiamo pensare logicamente. Il ragionamento logico consiste nel cercare di dare un senso alle cose osservando, raccogliendo dati, riflettendo sui fatti che conosciamo, e poi cercando di dedurre fatti in base a ciò che già conosciamo. Ci aiuta ad usare le nostre conoscenze pregresse per stabilire regole e verificare i fatti.
mi: Ki te whakaoti rapanga, me whakaaro arorau tātou. Ka whakamahia te whakaaro arorau ki te kimi māramatanga, mā te āta titiro, mā te kohikohi raraunga hoki, mā te whakaaro hoki mō ngā mea kei te mōhiotia kētia, kātahi ka whiriwhiri i te otinga i runga i aua mōhiotanga. Mā te whakaaro arorau e pai ake ai te whakamahi mōhiotanga hei waihanga i ngā whakatau, hei arotake hoki i ngā meka.

source: For example, suppose you are writing software that works out the shortest route to a location from your house. In the following map it's 2 minutes to the library if you head north from your house, but if you head south it's 3 minutes to the next intersection. You might wonder if there's a better route to the library if you start by heading south, but logically there can't be because you'll already have walked for 3 minutes to get to the intersection.
de: Nehmen wir beispielsweise an, wir schreiben eine Software, die den kürzesten Weg von unserem Haus zu einem bestimmten Ort ermittelt. Auf der daraus folgenden Karte sind es zwei Minuten zur Bibliothek, wenn wir von unserem Haus in Richtung Norden gehen, doch wenn wir Richtung Süden gehen, sind es drei Minuten zur nächsten Kreuzung. Nun fragen wir uns vielleicht, ob es einen besseren Weg zur Bibliothek gibt, wenn wir Richtung Süden gehen. Logisch gesehen ist dies jedoch nicht möglich, da wir bereits drei Minuten laufen würden, um zur Kreuzung zu gelangen.
es: Por ejemplo, supongamos que estás desarrollando un programa que calcula la ruta más corta a una ubicación desde tu casa. En el siguiente mapa, la biblioteca se encuentra a 2 minutos si vas hacia el norte desde tu casa, pero si vas hacia el sur, el siguiente cruce se encuentra a 3 minutos. Quizás te preguntes si hay una ruta mejor hacia la biblioteca si comienzas dirigiéndote hacia el sur, pero lógicamente no puede existir porque ya habrías caminado durante 3 minutos para llegar al cruce.
fr: Par exemple, supposons que vous écrivez un logiciel qui calcule le plus court chemin vers un emplacement depuis votre maison. Sur la carte, vous êtes à 2 minutes de la bibliothèque si vous vous dirigez au nord depuis votre maison, mais si vous vous dirigez vers le sud, il y a 3 minutes jusqu'à la prochaine intersection. Vous pourriez vous demander si il y a une meilleure route vers la bibliothèque si vous commencez par le sud, mais logiquement ce n'est pas possible car vous aurez déjà marché pendant 3 minutes pour arriver à l'intersection.
it: Ad esempio, supponiamo che tu stia scrivendo un programma che trova il percorso più breve per andare in un luogo partendo da casa tua. Secondo tale ipotetica mappa, ci metti 2 minuti per andare in biblioteca se ti dirigi verso nord da casa tua, mentre se ti dirigi verso sud, ci metti 3 minuti per raggiungere l'incrocio successivo. Potresti chiederti se c'è un percorso migliore per la biblioteca se cominci a camminare verso sud, ma logicamente non può esserci perché dovresti camminare per 3 minuti solo per arrivare all'incrocio.
mi: Hei tauira, mō te waihanga i tētahi papatono e whakatau ana i te ara poto rawa atu i tō whare ki tētahi atu wāhi. Kei te mahere ki raro nei, e 2 ngā miniti ki te whare pukapuka, ina ahu whakateraki atu i tō whare. Ina ahu atu koe ki te tonga, e 3 miniti ki te rīpekatanga o ngā huarahi. Mehemea ka whakaaro koe mō te ara pai e tīmata ai ki te ahu whakatetonga, mā te whakaaro arorau ka mōhio koe, kāore he ara poto ki te tonga nā te mea, ka pau te 3 miniti ki te hīkoi ki te rīpekatanga noa iho.
