Repository: uccser/cs-unplugged
Catalog: csunplugged/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, it, mi

source: At a deeper level, computers are built entirely on logic. They use 'True' and 'False' values, and use something called 'Boolean expressions', like “is age > 5”, to make decisions in computer programs.
de: Auf einer tieferen Ebene sind Computer gänzlich auf Logik aufgebaut. Sie verwenden „True“- und „False“-Werte (also „wahr“- und „falsch“-Werte) und etwas, das „Boolesche Ausdrücke“ genannt wird, wie beispielsweise „ist Alter > 5“, um in Computerprogrammen Entscheidungen zu treffen.
es: A un nivel más profundo, los ordenadores están construidos completamente sobre la lógica. Usan los valores "Verdadero" y "Falso" y usan una cosa llamada "expresiones booleanas", como "edad > 5", para tomar decisiones en los programas de ordenador.
fr: À un niveau plus profond, les ordinateurs sont entièrement construits sur la logique. Ils utilisent les valeurs 'Vrai' et 'Faux', et utilisent quelque chose appelé des "expressions Booléennes", comme par exemple “est-ce que âge > 5”, pour prendre des décisions dans les programmes informatiques.
it: Ad un livello più profondo, i computer sono basati interamente sulla logica. Usano i valori "Vero" e "Falso" e usano le cosiddette "espressioni booleane", come "età > 5", per prendere decisioni nei programmi.
mi: Mēnā ka hōhonu ake te tirohanga, ka kite tātou ka hangaia tonu ngā rorohiko ki te arorau noa iho. Ka whakamahia ngā uara 'Pono' me te 'Hē', me ngā kīanga 'Boolean' pērā ki te "mēnā pakeke > 5", ki te whakatau i ngā mahi a te papatono rorohiko.

source: Tracking down a bug in a program also requires logical thinking, to work out where, and why, something in the program is going wrong.
de: Auch um Fehler in einem Programm ausfindig zu machen, muss anhand von logischem Denken ermittelt werden, wo und warum irgendetwas im Programm schief läuft.
es: Rastrear un error en un programa también requiere pensamiento lógico, para determinar dónde y por qué está fallando algo en el programa.
fr: Traquer un bug dans un programme nécessite également de la pensée logique, pour trouver où, et pourquoi, quelque chose dans le programme ne fonctionne pas.
it: Anche scovare un bug (un errore) in un programma richiede ragionamento logico, per capire dove, e perché, qualcosa nel programma non sta funzionando.
mi: Ki te rapu i te hapa kei roto i tētahi papatono, me whakamahi te whakaaro arorau, kia kimi ai, kei whea, nā te aha hoki i hē ai te mahi a te papatono.

source: <strong>Email:</strong> You can <a href="mailto:csse.education.research@gmail.com">email the CS Unplugged team here</a>.
de: <strong>E-Mail:</strong> Sie können <a href="mailto:csse.education.research@gmail.com">das CS Unplugged Team per E-Mail hier kontaktieren</a>.
es: <strong>Correo electrónico:</strong> Puedes <a href="mailto:csse.education.research@gmail.com">enviar un correo electrónico al equipo de CS Unplugged aquí</a>.
fr: <strong>Courriel :</strong> Vous pouvez <a href="mailto:csse.education.research@gmail.com">envoyer un courriel à l'équipe CS Unplugged à cette adresse</a>.
it: <strong>Email:</strong> Puoi mandare una email <a href="mailto:csse.education.research@gmail.com">al team di CS Unplugged qui</a>.
mi: <strong>Īmēra:</strong> Tuku <a href="mailto:csse.education.research@gmail.com">īmēra ki te CS Unplugged team kei konei</a>.

source: <strong>Community Google Group:</strong> We have a <a href="https://groups.google.com/forum/#!forum/cs-unplugged-sharing">Google Group</a> you can join and talk about CS Unplugged.
de: <strong>Community Google Gruppe:</strong> Wir haben eine <a href="https://groups.google.com/forum/#!forum/cs-unplugged-sharing">Google-Gruppe</a>, der Sie beitreten und für Diskussionen zu CS Unplugged nutzen können.
es: <strong>Grupo de Google de la comunidad:</strong> Tenemos un <a href="https://groups.google.com/forum/#!forum/cs-unplugged-sharing">grupo de Google</a> al que te puedes unir para hablar de CS Unplugged.
fr: <strong>Communauté Google Groups :</strong> Nous avons un <a href="https://groups.google.com/forum/#!forum/cs-unplugged-sharing">Groupe Google</a> que vous pouvez rejoindre pour discuter de CS Unplugged.
it: <strong>Google Group della Community:</strong> Abbiamo un <a href="https://groups.google.com/forum/#!forum/cs-unplugged-sharing">Google Group</a> a cui puoi aderire per parlare di CS Unplugged.
mi: <strong>Community Google Group:</strong> He <a href="https://groups.google.com/forum/#!forum/cs-unplugged-sharing">Rōpū Google</a> mō te whakawhiti whakaaro mō CS Unplugged.

source: How do I teach CS Unplugged?
de: Wie unterrichte ich CS Unplugged?
es: ¿Cómo enseño CS Unplugged?
fr: Comment enseigner l'Informatique Débranchée ?
it: Come insegno CS Unplugged?
mi: Me pēhea ahau ka whakaako i te CS Unplugged?

source: CS Unplugged is very much based on a constructivist approach: students are given challenges based on a few simple rules, and in the process of solving those challenges they uncover powerful ideas on their own. Not only is this a more memorable way to learn, but it empowers them to realise that these are ideas within their grasp. The activities are also very kinesthetic - the bigger the materials, the better.
de: CS Unplugged verfolgt überwiegend eine konstruktivistische Vorgehensweise: Schüler erhalten auf ein paar einfachen Regeln basierende Aufgabenstellungen und kommen dann während des Lösungsprozesses dieser Aufgaben selbst auf stichhaltige Ideen. Dies ist nicht nur eine einprägsamere Lernmethode, auf diese Weise erkennen sie auch, dass sie diese Konzepte durchaus erfassen können. Zudem sind die Aktivitäten sehr kinästhetisch ausgerichtet – je großformatiger die Materialien, desto besser.
es: CS Unplugged se basa principalmente en un enfoque constructivista: los alumnos reciben desafíos basados en unas cuantas reglas sencillas y en el proceso de resolver esos desafíos descubren poderosas ideas por cuenta propia. No solo es una forma más memorable de aprender, sino que además los empodera para darse cuenta de que estas son ideas que están a su alcance. Las actividades también son bastante cenestésicas, cuanto más grandes sean los materiales, mejor.
fr: L'Informatique Débranchée (CS Unplugged) est très largement basée sur une approche constructiviste : les élèves reçoivent des défis basés sur quelques règles simples, et dans le processus de résolution de ces défis ils découvrent des idées puissantes par eux-mêmes. Non seulement c'est une façon d'apprendre plus marquante, mais cela leur permet de réaliser que ce sont des idées à leur portée. Les activités sont également très kinesthésiques - plus grand est le matériel, mieux c'est.
it: CS Unplugged si basa molto su un approccio costruttivista: agli studenti sono proposte sfide basate su poche semplici regole, e nel processo di risoluzione di queste sfide scoprono da soli idee potenti. Non solo questo è un modo per imparare e ricordare di più, ma consente loro di rendersi conto che queste sono idee alla loro portata. Le attività sono anche molto cinestetiche - più grandi sono i materiali e meglio è.
mi: Ka whai a CS Unplugged i te kaupapa o te ako mā te waihanga; ka tukuna he wero ki ngā ākonga, kia whai ai rātou i ngā tikanga māmā hei whakaoti i ngā wero. Heoi anō, i a rātou e whakaoti ana i aua rapanga, ka puawai mai ō rātou ake whakaaro. Atu i te mau pai o te akoranga, ka kite hoki rātou ka taea e rātou te hopu i ēnei mātauranga. He ngohe rāwekeweke ēnei - mā te nui ake o ngā rauemi e pai ake ai te ako.

source: Because of this approach, you can also learn alongside the students. You'll need to read through the whole activity so that you're prepared for it, and we have provided videos for many of them so you can visualise them, but as the students discover how these ideas work out, you'll start to see patterns and ideas that the students are discovering as they understand the principles behind these topics from Computer Science.
de: Durch diese Vorgehensweise können auch Sie mit Ihren Schülern lernen. Sie sollten sich zunächst die gesamte Aktivität durchlesen, um vorbereitet zu sein. Zudem haben wir Videos für viele dieser Aktivitäten bereitgestellt, damit Sie diese visualisieren können. Während die Schüler herausfinden, wie diese Konzepte funktionieren, werden Sie jedoch auch Muster und Ideen sehen, die die Schüler beim Nachvollziehen der Grundsätze hinter diesen Themen aus der Informatik erkennen.
es: Debido a la naturaleza de este enfoque, también puedes aprender junto a los alumnos. Tendrás que leerte toda la actividad para prepararla y hemos proporcionado vídeos para muchas de ellas, para que puedas visualizarlas, pero a medida que los alumnos van descubriendo cómo funcionan estas ideas, empezarás a ver patrones e ideas que los alumnos van descubriendo según van entendiendo los principios detrás de estos temas de informática.
fr: Grâce à cette approche, vous pouvez également apprendre avec les élèves. Vous aurez besoin de lire l'ensemble de l'activité afin de vous préparer, et nous avons créé des vidéos pour beaucoup de ces activités de sorte que vous puissiez les visualiser, mais au fur et à mesure que les élèves saisissent comment ces idées fonctionnent, vous commencerez à voir des motifs et des idées que les élèves découvrent en comprenant les principes à l'origine de ces thèmes de l'Informatique.
it: Grazie a questo approccio, puoi anche imparare fianco a fianco con gli studenti. Avrai bisogno di leggere tutta l'attività, di modo da essere preparato, e abbiamo fornito video per molte di esse, così che tu le possa visualizzare, ma mentre gli studenti scoprono come funzionano queste idee, potrai iniziare a vedere gli schemi ricorrenti e le idee che essi stanno scoprendo, e come comprendono i principi che stanno dietro a questi argomenti di Informatica.
mi: Nā tēnei kaupapa ako, ka taea hoki te ako tahi koutou ko āu ākonga. Pānuitia te katoa o te ngohe kia rite ai koe. Kua waihanga mātou i ngā kiriata mō ētahi ngohe kia kite ai koe i ngā mahi. Heoi, mā te wā ka kite atu koe ka mārama haere ngā ākonga ki ngā tauira me ngā whakaaro nui me ngā mātāpono mō ēnei kaupapa Pūtaiao Rorohiko.

source: If you're working within a school curriculum, you can find appropriate activities based on the learning objectives and age group. In several countries there are guides linking CS Unplugged to the local curriculum (e.g. <a href="https://www.digitaltechnologieshub.edu.au/">Digital Technologies Hub for Australia</a>). But the unit plans listed follow the common topics that are appearing in school curricula, so you are likely to find something relevant from the titles. Note that CS Unplugged does not teach programming - the Kidbots activity is an excellent lead in to programming and the "Plugging it in" sections give some programming exercises to follow up with - but in general we are trying to show students what they could do with programming, before they have to learn it.
de: Auch wenn Sie im Rahmen eines schulischen Lehrprogramms arbeiten, können Sie zu den Lernzielen und zur Altersgruppe passende Aktivitäten finden. In etlichen Ländern gibt es Leitfäden, die CS Unplugged mit dem lokalen Lehrprogramm verbinden (z. B. <a href="https://www.digitaltechnologieshub.edu.au/">Digital Technologies Hub for Australia</a>). Da die aufgeführten Lehrpläne den für gewöhnlich in schulischen Lehrprogrammen enthaltenen Themen folgen, werden Sie sicherlich etwas Passendes unter den Titeln finden. Beachten Sie bitte, das CS Unplugged nicht Programmieren unterrichtet – die Kidbots-Aktivität ist eine ausgezeichnete Einführung zum Programmieren und die „Plugging it in“-Abschnitte enthalten ein paar Programmierübungen zum Nachfassen – im Großen und Ganzen versuchen wir jedoch, Schülern zu zeigen, was Sie mit Programmieren tun könnten, bevor sie es lernen müssen.
es: Si trabajas con un currículum escolar, puedes encontrar actividades apropiadas en función de los objetivos de aprendizaje y del grupo de edad. En varios países existen guías que vinculan CS Unplugged al currículum local (p. ej. <a href="https://www.digitaltechnologieshub.edu.au/">Digital Technologies Hub para Australia</a>). Los planes de estudios que se listan siguen los temas comunes que suelen aparecer en el currículum escolar, así que es probable que encuentres algo relevante a partir de los títulos. Ten en cuenta que CS Unplugged no enseña programación, la actividad Kidbots es una excelente introducción a la programación y las secciones "Plugging it in" te ofrecen algunos ejercicios de programación con los que seguir, pero en general lo que intentamos es enseñar a los alumnos lo que podrían hacer con la programación antes de que tengan que estudiarla.
fr: Si vous travaillez en suivant un programme scolaire, vous pouvez trouver des activités basées sur les objectifs d'apprentissage et le groupe d'âge. Dans plusieurs pays il y a des guides pour les programmes scolaires qui les relient à CS Unplugged (par exemple <a href="https://www.digitaltechnologieshub.edu.au/">Hub des Technologies numériques pour l'Australie</a>). Mais les plans de cours fournis suivent les thèmes qui apparaissent communément dans les programmes scolaires, donc vous êtes susceptible de trouver quelque chose de pertinent à partir des titres. Notez que CS Unplugged n'enseigne pas la programmation — même si l'activité Kidbots est une excellente introduction à la programmation et la section "Rebranchez le débranché" donne quelques exercices de programmation pour aller plus loin - mais en général nous essayons de montrer aux élèves ce qu'ils pourraient faire avec la programmation avant d'avoir à l'apprendre.
it: Se stai lavorando all'interno di un curricolo scolastico, puoi trovare attività appropriate in base agli obiettivi di apprendimento e alla fascia d'età. In diversi paesi esistono guide che collegano CS Unplugged al curricolo locale (ad es. <a href="https://www.digitaltechnologieshub.edu.au/">Centro tecnologie digitali per l'Australia</a>). Ma i le unità didattiche proposte seguono gli argomenti che appaiono comunemente nei programmi scolastici, quindi è probabile che tu trovi qualcosa di rilevante già leggendo i titoli. È bene notare che CS Unplugged non insegna programmazione - l'attività "Kidbots" ("Bimbibot") è un eccellente punto di partenza per la programmazione e le sezioni "Plugging it in" ("Connessioni tramite la programmazione") forniscono alcuni esercizi di programmazione da far seguire a specifiche attività unplugged - ma in generale stiamo cercando di mostrare agli studenti cosa potrebbero fare tramite la programmazione, prima che debbano impararla.
mi: Ki te whai tō mahi i te marautanga o te kura, ka kitea he ngohe e hāngai ana ki ngā whāinga me te pakeke o ngā tamariki. Kei ētahi o ngā whenua o te ao he pukapuka arataki e honohono ana i te CS Unplugged ki te marautanga o te rohe (hei tauira: <a href="https://www.digitaltechnologieshub.edu.au/">Te Digital Technologies Hub mō Ahitereiria</a>). Heoi anō, ka whai ngā mahere kōwae o konei i ngā kaupapa nui o ngā marau maha, nā, kāore e kore ka kitea tētahi mahi hāngai. Kia mōhio mai koe, kāore te CS Unplugged e whakaako i te tuhiwaehere. Heoi anō, ko te Kidbots (tamariki rorohiko) tētahi mahi pai hei whakarite kia tuhiwaehere, ā, kei ngā wāhanga "Purua kia Mau" ("Plugging it in") ētahi ngohe tuhiwaehere hei tautoko - engari mō te nuinga o ngā mahi mā te ākonga, he whakaaturanga o ngā mahi ka taea mā te tuhiwaehere, i mua i te ako i te tuhiwaehere.

source: But reading about Unplugged isn't the fun way to engage with it - pick a lesson for your students, and dive into it!
de: Doch nur über Unplugged zu lesen ist nicht das gleiche Vergnügen, wie damit zur Tat zu schreiten. Wählen Sie eine Lektion für Ihre Schüler aus und stürzen Sie sich hinein!
es: Pero leer cosas sobre Unplugged no es la forma más divertida de experimentarlo - ¡elige una lección para tus alumnos y sumérgete en ella!
fr: Mais la lecture sur l'Informatique Débranchée n'est pas une façon amusante de commencer - choisissez une leçon pour vos élèves, et plongez-vous dedans !
it: Ma leggere qualcosa su CS Unplugged non è il modo divertente di farsi coinvolgere - scegli una lezione per i tuoi studenti e buttati!
mi: Heoi anō, ehara te pānui noa mō te Unplugged i te āhuareka - tīpakongia tētahi ngohe mā ō ākonga, ā, rukuhia!

source: View available topics
de: Verfügbare Themen anzeigen
es: Ver temas disponibles
fr: Voir les thèmes disponibles
it: Visualizza gli argomenti disponibili
mi: Tirohia ngā kaupapa e wātea ana

source: Computer Science<br>without a computer
de: Informatik<br>ohne Computer
es: Informática<br>sin un ordenador
fr: L'Informatique<br>sans ordinateur
it: Informatica<br>senza computer
mi: Te Pūtaiao Rorohiko<br>kāore he rorohiko

source: CS Unplugged is a collection of free teaching material that teaches Computer Science through engaging games and puzzles that use cards, string, crayons and lots of running around.
de: CS Unplugged ist eine Sammlung kostenloser Lehrmaterialien, durch die Informatik anhand von anregenden Spielen und Aufgaben mit Karten, Bindfaden, Wachsstiften und viel Herumrennen gelehrt wird.
es: CS Unplugged es una colección de material didáctico gratuito que enseña informática a través de interesantes juegos y puzles con la ayuda de cartas, cuerdas, lápices de colores y mucha actividad física.
fr: CS Unplugged est une collection gratuite de matériel pédagogique qui enseigne l'Informatique à travers des jeux et des casse-têtes engageants qui utilisent des cartes, des cordes, des crayons de couleur et beaucoup de remue-ménage.
it: CS Unplugged è una raccolta di materiali didattici gratuiti che insegna l'Informatica attraverso giochi coinvolgenti e puzzle che usano carte, fili, pastelli e un sacco di movimento fisico.
mi: He kohinga te CS Unplugged o ngā rauemi whakaako hei whakaako atu i te Pūtaiao Rorohiko, mā ngā kēmu me ngā panga āhuareka. Ka whakamahia he kāri, he aho, he pene hinu me te omaoma haere.

source: What is Computer Science?
de: Was ist Informatik?
es: ¿Qué es la informática?
fr: Qu'est-ce que l'Informatique ?
it: Che cos'è l'Informatica?
mi: He aha te Pūtaiao Rorohiko?

source: Curriculum Integrations
de: Lehrplaninhalte
es: Integraciones curriculares
fr: Intégrations dans le programme scolaire
it: Integrazione<br>con altre discipline
mi: Te Whakaurunga Marautanga

source: Activities
es: Actividades
fr: Activités

source: Plugging it in
es: Conexión
fr: Rebranchez le débranché

source: version 4.0.0 onwards
de: ab Version 4.0.0
es: a partir de la versión 4.0.0
fr: à partir de la version 4.0.0
it: versione 4.0.0 e successive
mi: tukunga 4.0.0 piki ake rānei

source: Founders
de: Gründer
es: Fundadores
fr: Fondateurs
it: Fondatori
mi: Kaiwhakatō

source: Advisers
de: Berater
es: Asesores
fr: Conseillers
it: Consiglieri
mi: Ngā Kaitohutohu

source: Computer Scientist
de: Informatiker
es: Informático
fr: Informaticien
it: Informatico
mi: Kaipūtaiao Rorohiko

source: Current Team
de: Aktuelles Team
es: Equipo actual
fr: Équipe actuelle
it: Team Attuale
mi: Te Tīma Ināianei

source: Founder &amp; Content Writer
de: Gründer &amp; Content-Verfasser
es: Fundador y creador de contenido
fr: Fondateur &amp; rédacteur
it: Fondatore &amp; Autore di contenuti
mi: Kaiwhakatō &amp; Kaituhi Kōrero

source: Content Writer
de: Content-Verfasser
es: Creador de contenido
fr: Rédacteur
it: Autori di contenuti
mi: Kaituhi Kōrero

source: Project Manager &amp; Technical Team
de: Projektmanager &amp; Technisches Team
es: Gestor de proyectos y equipo técnico
fr: Chef de projet &amp; équipe technique
it: Project Manager &amp; Team Tecnico
mi: Kaiwhakahaere Kaupapa &amp; Tīma Hangarau

source: Technical Team
de: Technisches Team
es: Equipo técnico
fr: Équipe technique
it: Team Tecnico
mi: Tīma Hangarau

source: Previous Team Members
de: Frühere Teammitglieder
es: Miembros anteriores del equipo
fr: Anciens Membres de l'Équipe
it: Membri precedenti del team
mi: He Mema o te Tīma i Mua

source: Creative Content Developer &amp; Illustrator
de: Kreativer Content-Entwickler &amp; Grafiker
es: Desarrollador de contenido creativo e ilustrador
fr: Développeur de contenu créatif &amp; illustrateur
it: Sviluppatore di contenuti creativi &amp; Illustratore
mi: Kaiwaihanga Ihirangi Auaha &amp; Ringa Tā

source: Community Contributors
de: Community-Beiträge
es: Colaboradores de la comunidad
fr: Contributeurs de la communauté
it: Contributori della community
mi: Kaiāwhina o te Hapori

source: Translations
de: Übersetzungen
es: Traducciones
fr: Traductions
it: Traduzioni
mi: Whakawhitinga Reo

source: up to version 3.2.2
de: bis zu Version 3.2.2
es: hasta la versión 3.2.2
fr: jusqu'à la version 3.2.2
it: fino alla versione 3.2.2
mi: tae atu ki te tukunga 3.2.2

source: Contributors
de: Mitwirkende
es: Colaboradores
fr: Contributeurs
it: Hanno contribuito
mi: Kaiāwhina

source: Website
es: Sitio web
fr: Site web
it: Sito web
mi: Pae Tukutuku
