Repository: uccser/cs-unplugged
Catalog: csunplugged/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, it, mi

source: Algorithmic thinking is the process of creating algorithms. When we create an algorithm to solve a problem, we call this an algorithmic solution.
de: Algorithmisches Denken ist der Prozess zur Erstellung von Algorithmen. Wenn wir einen Algorithmus erstellen, um ein Problem zu lösen, nennen wir dies eine algorithmische Lösung.
es: El pensamiento algorítmico es el proceso de creación de algoritmos. Cuando creamos un algoritmo para resolver un problema, lo llamamos una solución algorítmica.
fr: La pensée algorithmique est le processus de création d'algorithmes. Lorsque nous créons un algorithme pour résoudre un problème, nous appelons cela une solution algorithmique.
it: Il pensiero algoritmico è il processo di creazione degli algoritmi. Quando creiamo un algoritmo per risolvere un problema, parliamo di soluzione algoritmica.
mi: Ko te whakaaro hātepe, te tukanga mō te waihanga i ngā hātepe. Ina waihanga te tangata i te hātepe, ki te whakaoti i tētahi rapanga, ka kīia tērā te otinga hātepe.

source: Computational algorithms (the kind that can run on digital devices) have relatively few ingredients because digital devices only have a few types of instruction that they can follow; the main things they can do are receive input, provide output, store values, follow instructions in a sequence, choose between options, and repeat instructions in a loop. Despite how limited this range of instructions is, we've described everything that digital devices can compute, and this is why algorithms are described restricted to these elements.
de: Computeralgorithmen (also die auf digitalen Geräten ausgeführten Algorithmen) haben relativ wenig Bestandteile, da digitale Geräte nur ein paar Befehlstypen folgen können. Sie sind hauptsächlich in der Lage, Eingaben anzunehmen, Ausgaben zu liefern, Werte zu speichern, Befehlsabläufe zu befolgen, zwischen Optionen zu wählen und Befehle in einer Schleife zu wiederholen. Da wir ungeachtet dieses eingeschränkten Befehlsumfangs alles geschildert haben, was digitale Geräte kalkulieren können, wurden die Algorithmen auf diese Elemente beschränkt erläutert.
es: Los algoritmos computacionales (del tipo que se puede ejecutar en dispositivos digitales) tienen relativamente pocos ingredientes porque los dispositivos digitales solo tienen unos pocos tipos de instrucciones que pueden seguir; las principales cosas que pueden hacer son recibir entrada, proporcionar salida, almacenar valores, seguir instrucciones en una secuencia, elegir entre opciones y repetir instrucciones en un bucle. A pesar de lo limitada que es esta gama de instrucciones, hemos descrito todo lo que los dispositivos digitales pueden computar y esta es la razón por la que los algoritmos están restringidos a estos elementos.
fr: Les algorithmes informatique (le genre qui peut fonctionner sur les appareils numériques) ont relativement peu d'ingrédients, parce que les appareils numériques n'ont que quelques types d'instructions qu'ils peuvent suivre ; les principales choses qu'ils peuvent faire sont de recevoir des données, fournir une sortie, stocker des valeurs, suivre des séquences d'instructions, choisir parmi plusieurs options, et répétez des instructions dans une boucle. Bien que cet ensemble d'instructions soit très limité, nous avons décrit tout ce que les appareils numériques peuvent calculer, et c'est pourquoi les algorithmes sont décrits comme limités à ces éléments.
it: Gli algoritmi computazionali (cioè quelli possono essere eseguiti su dispositivi digitali) hanno relativamente pochi ingredienti, perché i dispositivi digitali comprendono solo pochissimi tipi di istruzioni che possono eseguire; le cose principali che possono fare sono: ricevere input, fornire output, memorizzare i valori, eseguire le istruzioni in sequenza, scegliere tra diverse opzioni e ripetere le istruzioni in un ciclo. Nonostante questa gamma limitata di tipologie di di istruzioni, abbiamo descritto tutto ciò di cui i dispositivi digitali necessitano per elaborare, ed è per questo che gli algoritmi sono descritti tramite questo insieme limitato di elementi.
mi: He torutoru noa iho ngā wāhanga o ngā hātepe tātai (arā, ko ngā momo ka taea te whakahaere ki ngā pūrere matihiko), nā te mea he torutoru noa iho ngā momo tohutohu ka taea e ērā pūrere matihiko te whai; ko ngā mahi matua a aua pūrere matihiko ko te tiki tāuru, te tuku tāputa, te rokiroki i ngā uara, te whai i ngā tohutohu kua raupapangia, te whiriwhiri i ngā kōwhiringa, me te tāruarua i ngā tohutohu kei roto i tētahi koromeke. Ahakoa he ruarua noa iho ngā tohutohu, ko ērā te katoa o ngā āhuatanga ka taea e te pūrere matihiko te tātai, ā, nā tēnei ka kīia ai he whāititanga ō te hātepe i ēnei huānga.

source: Abstraction
de: Abstraktion
es: Abstracción
it: Astrazione
mi: Waitaratanga

source: Abstraction is all about simplifying things to help us manage complexity. It requires identifying what the most important aspects of a problem are and hiding the other specific details that we don’t need to focus on. The important aspects can be used to create a model, or simplified representation, of the original thing we were dealing with. We can then work with this model to solve the problem, rather than having to deal with all the nitty gritty details at once. Computer Scientists often work with multiple levels of abstraction.
de: Bei Abstraktion geht es darum, Dinge zu vereinfachen, um mit Komplexität zurechtzukommen. Dabei werden die wichtigsten Aspekte eines Problems identifiziert und alle anderen Details ausgeblendet, denen wir keine Beachtung schenken müssen. Anhand dieser wichtigen Aspekte können wir dann ein Modell oder eine vereinfachte Darstellung unserer anfänglichen Problemstellung entwerfen. Anschließend können wir mit diesem Modell arbeiten, um das Problem zu lösen, anstatt uns mit allen wesentlichen Details auf einmal auseinandersetzen zu müssen. Informatiker arbeiten oft mit mehreren Abstraktionsebenen.
es: La abstracción consiste en simplificar las cosas para ayudarnos a gestionar la complejidad. Requiere identificar cuáles son los aspectos más importantes de un problema y ocultar los otros detalles específicos en los que no necesitamos centrarnos. Los aspectos importantes se pueden usar para crear un modelo o una representación simplificada de la cosa original con la que estábamos tratando. Entonces podemos trabajar con este modelo para resolver el problema, en lugar de tener que lidiar con todos los detalles esenciales a la vez. Los informáticos a menudo trabajan con múltiples niveles de abstracción.
fr: L'abstraction est la capacité de simplifier les choses pour nous aider à appréhender la complexité. Elle exige de déterminer quels sont les principaux aspects d'un problème et de masquer les détails sur lesquels nous n'avons pas besoin de nous concentrer. Les aspects importants peuvent être utilisés pour créer un modèle, ou une représentation simplifiée de la chose à laquelle nous avons été confrontés. Ensuite, nous pouvons travailler avec ce modèle pour résoudre le problème, plutôt que d'avoir à traiter tous les petits détails en même temps. Les chercheurs en informatique travaillent souvent avec plusieurs niveaux d'abstraction.
it: L'astrazione consiste nel semplificare le cose per aiutarci a gestire la complessità. È necessario identificare gli aspetti più importanti di un problema e nascondere gli altri dettagli specifici su cui non dobbiamo concentrarci. Gli aspetti importanti possono essere usati per creare un modello, una rappresentazione semplificata, di ciò di cui ci stiamo occupando. Possiamo quindi lavorare con questo modello per risolvere il problema, piuttosto che dover gestire contemporaneamente tutti i dettagli precisi. Gli informatici spesso lavorano con più livelli di astrazione.
mi: Ko te tino whāinga o te waitaratanga, ko te whakangāwari i ngā kaupapa matatini. Me tautuhi ngā āhuatanga nui o te rapanga, te huna hoki i ngā tini āhuatanga kāore i te tino hāngai. Mā te wetewete i ngā āhuatanga whakahirahira e taea ai te waihanga i tētahi tauira, āhuahanga ngāwari rānei o te rapanga e aro atu ana tātou. Kātahi, ka taea e tātou te whai i taua tauira hei whakaoti rapanga, kia kaua e aro ki ngā tini āhuatanga iti i te wā kotahi. Ka mahi ai te Kaipūtaiao Rorohiko i ngā kaupae waitaratanga maha.

source: We use abstraction often in our everyday lives, for example when we use maps. Maps show us a simplified version of the world by leaving out unnecessary details, like where every individual tree in a park is, and only keeping the most relevant information the map reader will need, such as roads and street names.
de: Auch wir setzen in unserem täglichen Leben oft Abstraktion ein, beispielsweise wenn wir Karten verwenden. Karten zeigen uns eine vereinfachte Version der Umgebung an, indem unnötige Details wie die Standorte der einzelnen Bäume in einem Park ausgelassen und nur die für den Leser der Karte wichtigsten Informationen beibehalten werden, wie beispielsweise Orts- und Straßennamen.
es: Usamos la abstracción a menudo en nuestra vida cotidiana, por ejemplo, cuando usamos mapas. Los mapas nos muestran una versión simplificada del mundo al omitir detalles innecesarios, como dónde se encuentra cada árbol en un parque y solo conservan la información más relevante que el lector del mapa necesitará, como carreteras y nombres de calles.
fr: Nous utilisons souvent l'abstraction dans notre vie de tous les jours, par exemple lorsque nous utilisons des cartes. Les cartes nous montrent une version simplifiée du monde en laissant de côté les détails inutiles, comme chaque arbre dans un parc, et ne gardant que les informations les plus pertinentes pour le lecteur, comme les routes et les noms de rue.
it: Usiamo spesso l'astrazione nelle nostre vite quotidiane, ad esempio quando usiamo le mappe. Le mappe ci mostrano una versione semplificata del mondo che tralascia dettagli superflui, come il luogo in cui si trova ogni singolo albero in un parco, e mantengono solo le informazioni più rilevanti di cui avrà bisogno chi sta consultando la mappa, come i nomi delle strade e delle vie.
mi: Ka whakamahia noatia te waitaratanga e te tangata ia rā, ko tētahi tauira, ko te whakamahi i ngā mahere whenua. Kei te mahere, he whakaaturanga ngāwari o te whenua, me te mahue atu ko ngā mea iti pērā ki ngā rākau maha i te ngahere, ā, ka mau tonu ngā mōhiohiotanga whakahirahira anake e hiahiatia ana e te tangata, pērā ki ngā ingoa o ngā huarahi me ngā rōri.

source: Digital devices use abstraction all the time; they try to hide as much unnecessary information from the user as possible. For example, let's say you took a nice scenic photo on your last camping trip, and now you want to edit it on your laptop and adjust the colours in it. Normally we could do this by opening a picture editing program, adjusting some colour sliders or maybe choosing a filter. When you do this there are a lot of complicated operations happening which the computer is hiding from you.
de: Digitage Geräte bedienen sich ständig der Abstraktion und versuchen, möglichst viele unnötige Informationen vor uns Benutzern zu verbergen. Nehmen wir beispielsweise einmal an, Sie haben bei Ihrem letzten Campingausflug ein herrliches Landschaftsfoto aufgenommen, das Sie nun auf Ihrem Computer bearbeiten und die Farben anpassen möchten. Dies können wir normalerweise tun, indem wir ein Bildbearbeitungsprogramm öffnen, ein paar Farbregler anpassen und vielleicht noch einen Filter auswählen. Während wir dies tun, finden jede Menge komplizierte Vorgänge statt, die der Computer vor uns verbirgt.
es: Los dispositivos digitales usan la abstracción todo el tiempo; intentan ocultar tanta información innecesaria como sea posible. Por ejemplo, supongamos que hiciste una bonita foto panorámica en tu última acampada y ahora deseas editarla en el portátil y ajustar los colores. Normalmente podríamos hacer esto abriendo un programa de edición de imágenes, ajustando algunos controles deslizantes de color o tal vez eligiendo un filtro. Cuando haces esto suceden muchas operaciones complicadas que el ordenador te oculta.
fr: Les appareils numériques utilisent abstraction tout le temps ; ils essaient de cacher autant d'information inutiles que possible à l'utilisateur. Par exemple, imaginez que vous avez pris une belle photo panoramique pendant votre dernière excursion en camping, et maintenant vous voulez la modifier sur votre ordinateur portable et ajuster ses couleurs. En général, nous le faisons par l'ouverture d'un programme d'édition d'image, en ajustant des curseurs sur la couleur ou peut-être en choisissant un filtre. Lorsque vous faites cela il se produit beaucoup d'opérations compliquées que l'ordinateur vous cache.
it: I dispositivi digitali usano sempre l'astrazione; cercano di nascondere il più possibile le informazioni inutili per l'utente. Ad esempio, supponiamo che tu abbia scattato una bella foto panoramica durante il tuo ultimo viaggio in campeggio e ora desideri modificarla a computer per regolarne i colori. Normalmente possiamo farlo aprendo un programma di modifica delle immagini, regolando alcuni cursori del colore o magari scegliendo un filtro. Quando facciamo ciò, ci sono un sacco di operazioni complicate in corso, che il computer ti sta nascondendo.
mi: Ka whakamahi ngā pūrere matihiko i te waitaratanga i ngā wā katoa; ka hunaia ngā mōhiohio take kore e taea ana i te kaiwhakamahi. Hei tauira, ina hiahia koe ki te whakatika i ngā tae o te whakaahua o tō haerenga ki tāwāhi, ka huakina ki te taupānga whakatika pikitia, ka nekehia ngā rēreti tae, ka whakamahia tētahi tātari kano rānei. He maha ngā mahinga whīwhiwhi o te rorohiko, engari ka hunaia te nuinga o ērā.

source: The picture you took is stored on the computer as a big list of pixels, which are each a different colour, and each colour is represented by a set of numbers, and each of these numbers are stored as binary digits! That’s a lot of information. Imagine if when you adjusted the colours you had to go through and look at all the colour values of every pixel and change each and every one of those! That’s what the computer is doing for you, but since you don’t need to know this to accomplish your goal the computer hides this information away.
de: Das aufgenommene Foto ist auf dem Computer als riesige Liste an Pixeln gespeichert, die alle eine unterschiedliche Farbe haben. Jede Farbe wird durch einen Satz an Zahlen dargestellt und jede dieser Zahlen ist als binäre Einheit gespeichert! Das sind eine ganze Menge Daten. Stellen Sie sich vor, wir müssten beim Anpassen der Farben alle Farbwerte eines jeden Pixels durchgehen und jeden einzelnen davon anpassen! Das ist genau das, was der Computer für uns macht. Da wir dies jedoch nicht wissen müssen, um unser Vorhaben auszuführen, werden diese Informationen vom Computer verborgen.
es: La foto que hiciste se almacena en el ordenador como una gran lista de píxeles, cada uno de un color diferente y cada color se representa mediante un conjunto de números y cada uno de estos números se almacena como dígitos binarios. Eso es mucha información. ¡Imagínate si al ajustar los colores tuvieras que repasar y mirar todos los valores del color de cada píxel y cambiarlos todos! Eso es lo que el ordenador hace por ti, pero como tú no necesitas saber todo esto para lograr tu objetivo, el ordenador oculta esta información.
fr: La photo que vous avez prise est stocké sur l'ordinateur sous forme une grande liste de pixels, qui sont chacun d'une couleur différente, et chaque couleur est représentée par un ensemble de nombres, et chacun de ces nombres est stocké sous forme de chiffres binaires ! Cela fait beaucoup d'informations. Imaginez si, lorsque vous avez réglé les couleurs, il fallait inspecter et regarder toutes les valeurs des couleurs de chaque pixel et changer chacune d'entre elles ! C'est ce que l'ordinateur fait pour vous, mais puisque vous n'avez pas besoin de le savoir pour accomplir votre objectif, l'ordinateur cache cette information.
it: L'immagine che hai scattato è memorizzata sul computer come una grande sequenza di pixel, ognuno dei quali ha un colore diverso, e ogni colore è rappresentato da una serie di numeri, e ognuno di questi numeri è memorizzato come cifre binarie! Sono un sacco di informazioni. Immagina se, nel momento in cui hai regolato i colori, avessi dovuto passare attraverso tutti i valori cromatici di ogni pixel e cambiare ognuno di essi! Questo è ciò che il computer sta facendo per te, ma dal momento che non hai bisogno di saperlo per raggiungere il tuo obiettivo, il computer nasconde queste informazioni.
mi: Ka utaina tō whakaahua ki te rorohiko hei rārangi roa o ngā tongi-iti, he rerekē ngā tae, ā, he nama te whakaahuahanga mō ia tongi-iti, he mati tāhūrua ia nama! He maha te mōhiohio kore rawa e taea te whakatikatika i ngā uara kano o ia tongi-iti! Ko tērā kē te mahi a te rorohiko, nā te mea kāore he take kia mōhio koe ki aua mahi a te rorohiko ka hunaia.

source: Decomposition
de: Dekomposition
es: Descomposición
fr: Décomposition
it: Scomposizione
mi: Whakamatariki

source: Decomposition is about breaking down problems into smaller, more manageable, parts, and then focusing on solving each of these smaller problems. We can break a complex problem down until the smaller parts are so simple they become easy to solve. The solutions to each of these smaller, and simpler, problems build up to a solution to the big problem we started with. Decomposition helps make large problems much less intimidating!
de: Bei Dekomposition geht es darum, Problematiken in kleinere, überschaubarere Teile zu zerlegen und sich dann darauf zu konzentrieren, diese kleineren Probleme nacheinander zu lösen. Jede komplexe Problematik kann so weit zerlegt werden, bis die kleineren Teile so simpel sind, dass sie leicht gelöst werden können. Die Lösungen zu diesen kleineren, simpleren Problemen bauen aufeinander auf und ergeben die Lösung zur anfänglichen Problemstellung. Mit Dekomposition werden große Problematiken zu weitaus weniger einschüchternden Teilaufgaben!
es: La descomposición consiste en descomponer los problemas en partes más pequeñas y manejables, para luego enfocarse en resolver cada uno de estos problemas más pequeños. Podemos descomponer un problema complejo hasta que las partes más pequeñas sean tan simples que sean fáciles de resolver. Las soluciones para cada uno de estos problemas más pequeños y simples se convierten en una solución al gran problema con el que comenzamos. ¡La descomposición ayuda a que los problemas grandes sean mucho menos intimidantes!
fr: La décomposition consiste à décomposer les problèmes en parties plus petites et plus faciles à gérer, puis à se concentrer sur la résolution de chacun de ces petits problèmes. Nous pouvons continuer de diviser un problème complexe encore et encore jusqu'à ce que les plus petits morceaux soient si simples qu'ils deviennent faciles à résoudre. Les solutions à chacun de ces plus petits et plus simples problèmes permettent de construire une solution du grand problème que nous avions au départ. La décomposition permet de rendre de gros problèmes beaucoup moins intimidants !
it: Scomposizione significa suddividere i problemi in parti più piccole e più gestibili, e quindi concentrarsi sulla risoluzione di ciascuno di questi problemi minori. Possiamo scomporre un problema complesso fino a quando le parti più piccole sono così semplici che diventano facili da risolvere. Le soluzioni a ciascuno di questi problemi più piccoli e più semplici si sviluppano fino a una soluzione al problema complesso con cui abbiamo iniziato. La scomposizione aiuta a rendere i problemi complessi molto meno minacciosi!
mi: Ko te whakamatariki te whakawehewehe i te rapanga kia kitea ai ngā wāhanga iti, kia ngāwari ai hoki te whakahaere, kātahi ka taea te whakaoti i ēnei rapanga paku nei. Ka taea te whakawehewehe i ngā rapanga matatini ki ngā wāhanga iti, kia ngāwari ai te whakaoti. Mā te whakakotahi i ēnei otinga e hangaia ai te otinga nui katoa. Mā te whakamatariki e patua ai te taniwha whakamataku o ngā rapanga nui!

source: Decomposition is an important skill for creating algorithms and processes that can be implemented on a computing device, because computers need very specific instructions. They need to be told each of the tiny steps they need to follow in order to do things.
de: Dekomposition ist eine wichtige Qualifikation zur Erstellung von Algorithmen und Prozessen für Computersysteme, da Computer äußerst genaue Anweisungen erfordern. Computern benötigen Anweisungen für jeden kleinen Schritt, der von ihnen zu befolgen ist, um Funktionen auszuführen.
es: La descomposición es una habilidad importante para crear algoritmos y procesos que se puedan implementar en un dispositivo informático, porque los ordenadores necesitan instrucciones muy específicas. Necesitan que les digan cada uno de los pequeños pasos que deben seguir para hacer las cosas.
fr: La décomposition est une compétence importante pour créer des algorithmes et des processus qui peuvent être mis en œuvre sur un dispositif informatique, parce que les ordinateurs ont besoin de directives très précises. Il faut leur dire chacune des petites étapes qu'ils doivent suivre pour faire quelque chose.
it: La scomposizione è un'abilità importante per la creazione di algoritmi e processi che possono essere implementati su un dispositivo di elaborazione, poiché i computer hanno bisogno di istruzioni molto specifiche. Bisogna dire loro ciascuno dei piccoli passi che devono seguire per fare qualcosa.
mi: Ko te whakamatariki tētahi pūkenga nui hei waihanga hātepe, hei waihanga tukanga hoki e taea ai te whakahaere i ngā pūrere matihiko, nā te mea, me tino whāiti te aronga o ngā tohutohu ki ngā rorohiko. Me āta tohutohu mō ia takahanga paku nei, he whāinga kia tutuki ai ngā mahi.

source: For example the overall task of making a cake can be decomposed into several smaller tasks, each of which can be performed easily.
de: Beispielsweise kann die Gesamtaufgabe, einen Kuchen zuzubereiten, in mehrere Unteraufgaben zerlegt werden, die einzeln jeweils leicht bewältigt werden können.
es: Por ejemplo, la tarea general de hacer una tarta se puede descomponer en varias tareas más pequeñas, cada una de las cuales se puede realizar fácilmente.
fr: Par exemple l'ensemble de la tâche "faire un gâteau" peut être décomposé en plusieurs tâches plus petites, dont chacune peut être effectuée facilement.
it: Ad esempio, il compito generale di fare una torta può essere scomposto in diversi compiti più piccoli, ognuno dei quali può essere facilmente eseguito.
mi: Hei tauira, ka taea te whakamatariki i te mahi tunu keke, ki ngā mahinga iti iho, kia ngāwari ai te whakaoti i ia wāhanga o te mahi.
