Repository: uccser/cs-unplugged
Catalog: csunplugged/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, it, mi

source: The activities are resilient to errors made by students; they should not depend on getting many difficult steps exactly right, and minor mistakes should not prevent participants from understanding the principles. The instructions are usually just one or two rules and a goal that can be expressed in a single sentence (e.g. “Each card is either fully visible or not; how can you display exactly 11 dots?”, or “We need to get from any house to any other house; what is the smallest number of paving stones that make this possible”).
de: Die Aktivitäten werden durch Fehler von Studenten nicht beeinträchtigt. Sie sollten nicht davon abhängen, viele schwierige Schritte genau richtig auszuführen, und geringfügige Fehler sollten Teilnehmer nicht daran hindern, die Grundsätze zu verstehen. Die Anleitungen bestehen für gewöhnlich aus nur einer oder zwei Regeln und einem Ziel und können in einem Satz ausgedrückt werden (z. B. „Jede Karte ist entweder vollständig sichtbar oder nicht; wie können wir genau elf Punkte darstellen?“ oder „Wir müssen von einem Haus zu einem anderen Haus gelangen; was ist die kleinste Anzahl an Pflastersteinen, mit der dies ermöglicht werden kann?“).
es: Las actividades son flexibles ante los errores cometidos por los alumnos; no deberían depender de la realización correcta de muchos pasos difíciles y los errores menores no deberían evitar que los participantes entiendan los principios. Las instrucciones son generalmente solo una o dos reglas y un objetivo que se puede expresar en una sola oración (por ejemplo, "Cada carta es completamente visible o no, ¿cómo se pueden mostrar exactamente 11 puntos?" o "Necesitamos llegar de cualquier casa a cualquier otra casa; cuál es el menor número de adoquines que lo hacen posible").
fr: Les activités sont robustes aux erreurs commises par les élèves ; elles ne doivent pas dépendre d'étapes difficiles faites exactement comme elles le devraient, et des erreurs mineures ne devraient pas empêcher les participants de comprendre les principes. Les instructions sont généralement seulement une ou deux règles et un objectif qui peut être exprimé en une seule phrase (par exemple, “Chaque carte est entièrement visible ou non ; comment pouvez-vous afficher exactement 11 points ?”, ou “Nous avons besoin d'aller depuis n'importe quelle maison à n'importe quelle autre maison ; quel est le plus petit nombre de pavés pour que cela soit possible ?”).
it: Le attività sono resilienti agli errori commessi dagli studenti; la loro riuscita non dovrebbero dipendere dal compiere in modo esatto molti passi difficili, e piccoli errori non dovrebbero impedire ai partecipanti di comprendere i principi. Le istruzioni sono di solito composte soltanto da una o due regole e un obiettivo che può essere espresso in una singola frase (es. "Ogni carta è completamente visibile oppure no; come si fa a rendere visibili esattamente 11 punti?", oppure "Dobbiamo andare da una casa qualsiasi ad un'altra casa qualsiasi, qual è il più piccolo numero di pietre per lastricati necessarie?").
mi: Ko te tūmanako ka taea tonutia ēnei ngohe ahakoa ngā hapa o ngā ākonga, kia kore hoki he maha ngā hipanga uaua hei whai atu, kia ako hoki ngā ākonga i ngā mātāpono ahakoa ngā paku hapa e puta ana. Mō te nuinga, he ruarua noa iho ngā ture, ka taea hoki te whakapuaki i te tino whāinga i te rerenga kōrero kotahi (hei tauira: "Mō ia kāri, ka kitea te katoa, kāore rānei; pēhea te whakaatu i ngā ira 11?, "Ko tō tātou hiahia, kia taea te haere mai i tētahi o ngā whare kia tae ki ngā whare katoa, he aha te nama iti iho mō ngā kōhatu takahanga kia taea ai tēnei?").

source: In today's digital world, Computer Science has become an important subject for everyone to learn about. The knowledge and <a href="%(computational_thinking_url)s">Computational Thinking skills</a> associated with it are now crucial to developing innovative digital technology, understanding modern society, and qualifications in this area are highly sought after.
es: En el mundo digital actual, la informática se ha convertido en una materia importante que todo el mundo debería estudiar. El conocimiento y las <a href="%(computational_thinking_url)s">Habilidades del pensamiento computacional</a> asociados a ella ahora son cruciales para desarrollar tecnología digital innovadora y para comprender la sociedad moderna y la demanda de personas cualificadas en este campo es muy alta.
fr: Dans le monde numérique d'aujourd'hui, l'informatique est devenue un sujet important que tout le monde doit connaitre. Les connaissances et les <a href="%(computational_thinking_url)s">Compétences en matière de Pensée Informatique</a> qui y sont associées sont désormais cruciales pour développer une technologie numérique innovante, comprendre la société moderne, et les qualifications dans ce domaine sont très recherchées.

source: The CS Unplugged activities are intended to give you a feel for what the subject is - you can learn what it is by doing. At this early stage, rather than define it formally, let's think about how it might influence our daily lives. For example, think of your favourite search engine. On the surface it seems like a fairly simple interface: a text box where you type what you want to search for, and a button to start the search. The level of programming knowledge needed to implement a text box and a button is fairly rudimentary, and you could implement a search by writing a short program (probably less than 20 lines) to go through all the text on the web and displaying any that match. But obviously there's more to it than this! There are billions of searches are made every day, on billions on web pages, and the approach above will give answers (eventually), but will be so slow and ineffective that no-one would use it.
de: Die Aktivitäten auf CS Unplugged sollen ein Gefühl für dieses Fachgebiet vermitteln – man kann durch Üben lernen, um was es geht. Überlegen wir uns zu Anfang erst einmal, wie es unser tägliches Leben beeinflusst, anstatt das Ganze in förmlicher Weise zu definieren. Denken wir beispielsweise an unsere Lieblingssuchmaschine. Auf den ersten Blick scheint es sich dabei um eine relativ simple Schnittstelle zu handeln: ein Textfeld, in das wir den gesuchten Begriff eingeben, und eine Schaltfläche, um die Suche zu starten. Das zur Implementierung eines Textfelds und einer Schaltfläche benötigte Niveau an Programmierkenntnissen ist recht rudimentär und man könnte eine Suche implementieren, indem man ein kurzes Programm (vermutlich weniger als 20 Zeilen) schreibt, das sämtliche Texte im Internet durchsucht und alle passenden Begriffe anzeigt. Doch das ist zweifellos noch nicht alles! Tagtäglich werden Milliarden von Suchen auf Milliarden von Webseiten ausgeführt und die vorstehende Vorgehensweise würde zwar (letztendlich) Antworten liefern, wäre aber so langsam und ineffektiv, dass niemand sie anwenden würde.
es: Las actividades de CS Unplugged están destinadas a darte una idea de lo que es el tema - puedes aprender lo que es haciendo cosas. En esta etapa temprana, en lugar de definirlo formalmente, pensemos en cómo puede influir en nuestra vida diaria. Por ejemplo, piensa en tu motor de búsqueda favorito. A simple vista parece una interfaz bastante simple: un cuadro de texto donde puedes escribir lo que deseas buscar y un botón para comenzar la búsqueda. El nivel de conocimiento de programación necesario para implementar un cuadro de texto y un botón es bastante rudimentario y puedes implementar una búsqueda escribiendo un programa corto (probablemente menos de 20 líneas) para revisar todos los textos en la web y mostrar todo lo que coincida. ¡Pero obviamente es más que eso! Se realizan billones de búsquedas todos los días, en billones de páginas web y el enfoque anterior dará respuestas (con el tiempo), pero será tan lento e ineficaz que nadie lo usaría.
fr: Les activités d'Informatique Débranchée (CS Unplugged) sont destinées à vous donner une idée sur ce sujet - vous pouvez apprendre ce que c'est par la pratique. À ce stade, plutôt que de le définir formellement, réfléchissons à la façon dont il pourrait influer sur notre vie quotidienne. Par exemple, pensez à votre moteur de recherche favori. Sur la surface, ça ressemble à une interface assez simple : une zone de texte où vous tapez ce que vous voulez rechercher, et un bouton pour lancer la recherche. Le niveau de connaissance en programmation nécessaire pour mettre en œuvre une zone de texte et un bouton est assez rudimentaire, et vous pourriez mettre en place une recherche par la rédaction d'un programme court (probablement moins de 20 lignes) pour aller à travers tout les textes sur le web et afficher tout ce qui correspond. Mais, évidemment, ce n'est pas si simple que ça ! Des milliards de recherches sont effectuées chaque jour, sur des milliards de pages web, et l'approche ci-dessus vous donnera des réponses (tôt ou tard), mais si lente et inefficace que personne ne voudrait l'utiliser.
it: Le attività di CS Unplugged hanno lo scopo di darti un'idea di cosa sia questa disciplina - e lo puoi imparare facendo. In questa fase iniziale, piuttosto che definirla formalmente, pensiamo a come potrebbe influenzare la nostra vita quotidiana. Ad esempio, pensa al tuo motore di ricerca preferito. In apparenza sembra un'interfaccia abbastanza semplice: una casella di testo in cui si digita ciò che si desidera cercare e un pulsante per avviare la ricerca. Il livello delle conoscenze di programmazione necessarie per implementare una casella di testo e un pulsante è abbastanza rudimentale, e potresti implementare la ricerca scrivendo un breve programma (probabilmente meno di 20 righe) per esaminare tutto il testo presente sul Web e visualizzare qualsiasi corrispondenza. Ma ovviamente serve dell'altro! Vengono svolti miliardi di ricerche ogni giorno, su miliardi di pagine web, e l'approccio sopra citato fornirebbe risposte (alla fine), ma sarebbe così lento e inefficace che nessuno lo userebbe.
mi: Ko te whāinga mā ēnei ngohe CS Unplugged e waia ai koe ki te kaupapa - e taea ai hoki te ako i te kaupapa nei mā te mahi i ēnei ngohe. I te tīmatanga me mārama tātou ki ngā pānga ki tō tātou nei ao, waihotia te tautuhi i te kaupapa mō āmuri. Hei tauira, whakaarohia tō tino pūkaha rapu. Tērā pea, he ngāwari noa iho te atanga: he pouaka hei patopato i ngā mea ka rapua me tētahi pātene hei tīmata i te rapu. Ka taea te hanga i taua pouaka me te pātene mā te mōhiotanga paku noa, ka taea hoki te hanga i te taupānga poto (kei raro i te 20 ngā rārangi o te waehere) kia rapu i ngā tuhinga katoa i runga i te ipurangi me te whakaatu i ngā kitenga. Heoi anō, he maha ngā āhuatanga e pā ana ki enei momo mahi. E hia kē ngā manomano rapunga ia rā, kei ngā whārangi maha anō hoki, ā, mā te momo whārangi ka kōrerohia kei runga nei, nāwai rā ka puta ngā kitenga, engari, mā te tino pōturi o tēnei momo, e kore ai pea e hiahia te tangata ki te whakamahi.

source: This is where Computer Science comes in; many areas of Computer Science are employed to make the system work well, and most of them are illustrated through Unplugged. How could you search billions of items in a fraction of a second (Searching Algorithms)? How do you make sure that it's easy to use (Human-Computer Interaction)? We need to keep it secure - users don't want other people to know what they are searching for, and the search engine doesn't want commercial interests to manipulate search ranking (Computer Security and Encryption)? Search engines generally predict what you are about to search for (Artificial Intelligence). It needs to be reliable - a small mistake from one of the thousands of programmers at a search engine company shouldn't prevent the site working (Software Engineering). It needs to scale well - if it becomes 10 times as popular, you don't want it to need 100 times the computing resources (Algorithms). The relevance of a search generally depends on the relationships between web sites - you need a map showing which sites are linked to which other ones (Graphs).
de: Das ist der Punkt, an dem Informatik ins Spiel kommt. Viele Bereiche der Informatik werden eingesetzt, um die Funktionsfähigkeit des Systems zu gewährleisten, und die meisten davon werden durch Unplugged veranschaulicht. Wie könnte man innerhalb eines Bruchteils einer Sekunde Milliarden von Elementen durchsuchen (Suchalgorithmen)? Wie können wir sicherstellen, dass es benutzerfreundlich ist (Mensch-Computer-Interaktion)? Wir müssen es schützen – Benutzer wollen nicht, dass andere wissen, wonach sie suchen, und die Suchmaschine will nicht, dass die Suchrangliste durch kommerzielle Interessen manipuliert wird (Computersicherheit und Verschlüsselung). Suchmaschinen antizipieren in der Regel, was wir im Begriff sind, zu suchen (Künstliche Intelligenz). Es muss zuverlässig sein – ein kleiner Fehler einer der Tausenden von Programmierern einer Suchmaschinenfirma sollte den Betrieb der Website nicht beeinträchtigen (Softwaretechnik). Es muss skalierfähig sein – falls es 10-mal beliebter wird, wollen wir nicht, dass es 100-mal mehr Datenverarbeitungsressourcen (Algorithmen) benötigt. Die Relevanz einer Suche hängt im Allgemeinen von der Beziehung zwischen Websites ab – dazu wird eine Karte benötigt, die aufzeigt, welche Websites mit welchen Websites verknüpft sind (Graphen).
es: Aquí es donde entra la informática; muchas áreas de la informática se emplean para hacer que el sistema funcione bien y la mayoría de ellas se ilustran en Unplugged. ¿Cómo podrías buscar entre millones de elementos en una fracción de segundo (algoritmos de búsqueda)? ¿Cómo te aseguras de que sea fácil de usar (interacción persona-ordenador)? Necesitamos que sea seguro - los usuarios no quieren que otras personas sepan lo que están buscando y el motor de búsqueda no quiere que los intereses comerciales manipulen la clasificación de búsqueda (seguridad y cifrado informáticos)? Los motores de búsqueda generalmente predicen lo que vas a buscar (inteligencia artificial). Tiene que ser fiable - un pequeño error de uno de los miles de programadores en una empresa de motores de búsqueda no debería hacer que el sitio deje de funcionar (ingeniería del software). Necesita funcionar bien a gran escala - si se vuelve 10 veces más popular, no querrás que necesite 100 veces los recursos informáticos (algoritmos). La relevancia de una búsqueda generalmente depende de las relaciones entre los sitios web - necesitas un mapa que muestre qué sitios están vinculados a otros (gráficos).
fr: C'est là que la science informatique entre en jeu ; de nombreux domaines de l'informatique sont utilisés pour que le système fonctionne bien, et la plupart d'entre eux sont illustrés dans CS Unplugged. Comment pouvez-vous rechercher des milliards d'objets en une fraction de seconde (algorithmes de recherche) ? Comment vous assurer que c'est facile d'utilisation (interaction homme-machine) ? Nous devons le sécuriser : les utilisateurs ne veulent pas que d'autres personnes sachent ce qu'ils recherchent, et le moteur de recherche ne veut pas que les intérêts commerciaux faussent le classement des recherches (sécurité informatique et cryptage). Les moteurs de recherche prédisent généralement ce que vous êtes sur le point de rechercher (intelligence artificielle). Il doit être fiable : une petite erreur de l'un des milliers de programmeurs d'une société de moteurs de recherche ne doit pas empêcher le site de fonctionner (ingénierie logicielle). Il doit bien s'adapter à de plus grandes échelles : s'il devient 10 fois plus populaire, vous ne voulez pas qu'il ait besoin de 100 fois plus de ressources de calcul (algorithmes). La pertinence d'une recherche dépend généralement des relations entre les sites Web : vous avez besoin d'une carte montrant quels sites sont liés à quels autres (graphes).
mi: Mā konei e whai wāhi ai te Pūtaiao Rorohiko; mā te āta whakamahi i ngā wāhanga maha o te pūtaiao rorohiko e piki ai te kaha o te pūnaha mā te Unplugged. Ka kitea te nuinga o ēnei kaupapa i konei i te Unplugged. Ka pēhea te rapu i tētahi o ngā tuemi manomano i tētahi wāhanga paku o te hēkona (Hātepe Rapu)? Me pēhea hoki ngā whakaritenga kia ngāwari ai te whakamahi (Pāhekoheko Tangata-Rorohiko)? Me haumaru hoki kia kaua e whakaatu ki tangata kē ngā mea ka rapua e koe, ki kaua hoki e tukuna ngā hunga arumoni ki te rāwekeweke i te kapatanga o ngā whārangi (Whakamarumaru Rorohiko, Whakamunatanga Rorohiko hoki)? Ka matapae hoki te nuinga o ngā pūkaha rapu i ngā kupu ka rapua (Atamai Tāwhaiwhai). Me horopū - kaua e tukuna mā te hapa paku o tētahi o te tini o ngā kaituhiwaehere e mahi ana i te kamupene pūkaha rapu e whakahoro i te paetukutuku (Mataarotanga Pūmanawa). Kia pai te piki i te taurahi - mēnā ka whakareatia ngā manuhiri mā te 10, ka kore e hiahiatia kia whakareatia ngā rauemi rorohiko mā te 100 (Hātepe). Ka whai te hāngai o ngā otinga rapu i ngā honohono o ngā paetukutuku, nā reira, ka hiahiatia he mahere o ngā hononga paetukutuku (Kauwhata).

source: The areas above cover much of what the subject of Computer Science is about. Programming is just a tool for implementing ideas (well, it's a very powerful tool, and requires considerable skill to use well). But programming on its own isn't enough to create software that people love to use, and Computer Science is the area that gives programmers the inside knowledge to make their software fast, efficient, reliable, secure, usable, intelligent, scalable, and even delightful!
de: Die oben aufgeführten Bereiche decken einen Großteil des Fachgebiets Informatik ab. Programmieren ist lediglich ein Werkzeug (besser gesagt, ein sehr leistungsfähiges Werkzeug, das zur richtigen Anwendung beträchtliches Fachwissen erfordert) zur Umsetzung von Ideen. Doch Programmieren allein reicht nicht aus, um Software zu erstellen, die von Benutzern begeistert verwendet wird, und Informatik ist das Gebiet, das Programmierer mit dem Insiderwissen ausstattet, um ihre Software schnell, effizient, zuverlässig, sicher, betriebsfähig, intelligent, skalierbar und sogar attraktiv zu machen!
es: Las áreas anteriores cubren gran parte de lo que trata el tema de la informática. La programación es solo una herramienta para implementar ideas (bueno, es una herramienta muy potente y requiere una habilidad considerable para usarse bien). Pero la programación por sí sola no es suficiente para crear un programa que le encante a la gente y la informática es el área que le da a los programadores el conocimiento interno para hacer que sus programas sean rápidos, eficientes, fiables, seguros, utilizables, inteligentes, escalables, ¡e incluso encantadores!
fr: Les domaines ci-dessus couvrent une grande partie de ce qu'est a science informatique. La programmation n'est qu'un outil de mise en œuvre des idées (c'est, bien entendu, un outil très puissant, et sa bonne utilisation exige des compétences considérables). Mais programmer seul ne suffit pas à créer des logiciels que les gens aiment utiliser, et la science informatique est le domaine qui donne aux programmeurs les connaissances nécessaires pour rendre leurs logiciels rapides, efficaces, fiables, sûrs, accessibles, intelligents, évolutifs et même agréables !
mi: Kua kōrerotia he wāhanga whānui o ngā kaupapa Pūtaiao Rorohiko kei runga nei. Ko te tuhiwaehere tētahi o ngā taputapu hei whakatinana i ngā whakaaro (āe rā, he tino taonga, ā, me whai pūkenga kia whakamahi i tēnei taputapu). Heoi, ehara i te mea mā te tuhiwaehere anake e hangaia ai ngā papatono pai mā te tangata. Mā te mōhio ki te pūtaiao rorohiko e mōhio ai hoki ngā kaituhiwaehere ki ngā huarahi kia tere, kia tiakina ngā rawa, kia haumaru, kia whai hua, kia mārama, kia taea te tipu, kia rawe hoki ngā pūmanawa rorohiko!

source: That's why we developed CS Unplugged - we want young students to be empowered to understand the great ideas that computer science covers, without having to become expert programmers first. They won't be learning exactly how to build the next search engine, social network or game app, but they will have an idea of what sort of techniques are needed to make it successful. We don't want them to see digital systems as some kind of magic that they can't participate in, but as something that they could understand and, for some, create themselves. Actually, it is kind of magic when you start understanding what can and can't be done.
de: Darum haben wir CS Unplugged entwickelt – wir wollen junge Menschen in die Lage versetzen, die großartigen Konzepte der Informatik nachvollziehen zu können, ohne erst Programmierexperten werden zu müssen. Sie werden nicht gerade lernen, die nächste Suchmaschine, Social-Media- oder Spiele-App zu erstellen, aber sie werden eine Vorstellung davon erlangen, welche verschiedenen technischen Methoden erforderlich sind, um solche Dinge erfolgreich zu konstruieren. Wir wollen nicht, dass sie digitale Systeme als eine Art übersinnliche Kunst ansehen, an der sie nicht teilhaben können, sondern als etwas, dass sie nachvollziehen und vielleicht sogar selbst hervorbringen können. Obwohl es eigentlich schon ziemlich übersinnlich anmutet, wenn man zu verstehen beginnt, was damit möglich ist und was nicht.
es: Por eso hemos desarrollado CS Unplugged - queremos que los estudiantes jóvenes se sientan capaces de entender las grandes ideas que cubre la informática, sin tener que convertirse en programadores expertos primero. No aprenderán exactamente cómo construir el siguiente motor de búsqueda, red social o juego, pero tendrán una idea del tipo de técnicas necesarias para que tenga éxito. No queremos que vean los sistemas digitales como una especie de magia en la que no pueden participar, sino como algo que pueden entender y, en algunos casos, crear por sí mismos. En realidad, es algo mágico cuando comienzas a entender lo que se puede y lo que no se puede hacer.
fr: C'est pourquoi nous avons développé CS Unplugged - nous voulons que les jeunes élèves soient capables de comprendre les grandes idées que couvre l'informatique, sans avoir à devenir d'abord des programmeurs experts. Ils n'apprendront pas exactement comment construire le prochain moteur de recherche, réseau social ou application de jeu, mais ils auront une idée de quel genre de techniques seront nécessaires pour en faire un succès. Nous ne voulons pas qu'ils voient les systèmes numériques comme une sorte de magie à laquelle ils ne peuvent pas participer, mais comme quelque chose qu'ils peuvent comprendre et, pour certains, créer eux-mêmes. En fait, c'est un peu magique lorsque vous commencez à comprendre ce qui peut et ne peut pas être fait.
mi: Koinei te take i hanga mātou i te CS Unplugged - e hiahia ana mātou ki te tautoko i ngā ākonga kia mōhio ki ngā kaupapa nui o te pūtaiao rorohiko me te kore eke ki ngā taumata o te tuhiwaehere i te tuatahi. Ehara i te mea, ka ako rātou ki te hanga i te pūkaha rapu, i te taupānga kēmu, i te whatunga pāpori rongonui rānei - hou rawa atu o te ao rānei. Heoi anō ka kite rātou i ētahi o ngā tikanga hei kōkiri i ēnei momo kaupapa. Kia mōhio ai rātou, ehara ngā pūnaha matihiko i te maunga teitei, he pīnakitanga kē ka taea e rātou te eke. Heoi anō ka taea te eke i ngā maunga teitei ina hopu rātou i tēnei mātauranga.

source: Read 'How do I teach CS Unplugged?'
de: Artikel „Wie unterrichte ich CS Unplugged?“ lesen
es: Leer "¿Cómo enseño CS Unplugged?"
fr: Lire "Comment enseigner l'Informatique Débranchée ?"
it: Leggi "Come insegno CS Unplugged?"
mi: Pānuitia 'Me pēhea ka whakaako ahau i te CS Unplugged?'

source: More activities at the Classic CS Unplugged website
de: Weitere Aktivitäten auf der Website CS Unplugged Original
es: Más actividades en el sitio web de CS Unplugged Clásico
fr: Plus d'activités sur le site CS Unplugged classique
mi: He ngohe anō kei te whārangi CS Unplugged Classic
