Repository: uccser/cs-unplugged
Catalog: csunplugged/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, it, mi

source: The collection was originally intended as a resource for outreach and extension, but with the adoption of computing and computational thinking into many classrooms around the world, it is now widely used for teaching. The material has been used in many contexts outside the classroom as well, including science shows, talks for senior citizens, and special events.
de: Die Sammlung war ursprünglich als Ressource zur Öffentlichkeitsarbeit und Erweiterung vorgesehen, wird jedoch seit der Einführung von Informatik und informatischem Denken in vielen Schulen weltweit mittlerweile vielfach zum Unterrichten verwendet. Das Material wird auch bei etlichen Anlässen außerhalb des Klassenzimmers, wie beispielsweise wissenschaftlichen Darbietungen, Gesprächen für Senioren und Sonderveranstaltungen herangezogen.
es: La colección se concibió originalmente como un recurso para la difusión y la extensión, pero con la adopción de la informática y el pensamiento computacional en muchas aulas de todo el mundo, ahora se usa ampliamente para la enseñanza. El material también se ha utilizado en diversos contextos fuera del aula, como en programas de ciencias, charlas para personas mayores y eventos especiales.
fr: L'ensemble d'activités a d'abord été conçu comme une ressource pour la sensibilisation et la vulgarisation, mais avec l'adoption de l'informatique et de la pensée informatique dans de nombreuses salles de classe partout dans le monde, il est maintenant largement utilisé pour l'enseignement. Les documents ont été utilisés dans de nombreux contextes en dehors de la classe, y compris des spectacles scientifiques, des conférences pour les personnes âgées, et des évènements spéciaux.
it: La raccolta era originariamente intesa come una risorsa per la divulgazione e l'approfondimento, ma con l'introduzione dell'Informatica e del pensiero computazionale in molte aule di tutto il mondo, ora è ampiamente utilizzata per l'insegnamento. Il materiale è stato utilizzato anche in molti contesti extra-scolastici, tra cui spettacoli scientifici, conferenze per anziani ed eventi speciali.
mi: Ko te aronga tūturu mō tēnei kohikohinga kia noho hei rauemi mō te toro atu me te tāpiri atu, engari, nā te kaha o te uru o ngā rorohiko me te whakaaro rorohiko ki roto i ngā akomanga maha o te ao, ka whakamahia whānuitia hei whakaako. Kua whakamahia ēnei rauemi i ngā horopaki maha kei waho i te akomanga hoki, pērā ki ngā whakaaturanga pūtaiao, ngā kauhau mā te hunga pakeke, me ngā tauwhāinga whakahirahira.

source: Thanks to generous sponsorships we have been able to create associated resources such as the videos, which are intended to help teachers see how the activities work (please don’t show them to your classes – let them experience the activities themselves!). All of the activities that we provide are open source – they are released under a <a href="https://creativecommons.org/licenses/by-sa/4.0/">Creative Commons Attribution-ShareAlike licence</a>, so you can copy, share and modify the material.
de: Dank großzügiger Sponsoren konnten wir außerdem zugehörige Ressourcen wie unsere Videos erstellen, um Lehrern zu vermitteln, wie die Aktivitäten funktionieren (zeigen Sie die Videos bitte nicht Ihren Schülern – lassen Sie sie ihre eigenen Erfahrungen mit den Aktivitäten sammeln!). Alle von uns bereitgestellten Aktivitäten sind Open-Source-Material und unter einer <a href="https://creativecommons.org/licenses/by-sa/4.0/">Creative Commons Attribution-ShareAlike Lizenz</a> veröffentlicht, d. h. Sie können das Material kopieren, weitergeben und abändern.
es: Gracias a generosos patrocinios, hemos podido crear recursos asociados como los vídeos, destinados a ayudar a los docentes a ver cómo funcionan las actividades (no los muestres en tus clases, ¡deja que experimenten las actividades por sí mismos!). Todas las actividades que proporcionamos son de acceso libre y se publican bajo una <a href="https://creativecommons.org/licenses/by-sa/4.0/">licencia Attribution-ShareAlike de Creative Commons</a>, así que puedes copiar, compartir y modificar el material.
fr: Grâce à des parrainages généreux, nous avons pu créer des ressources associées telles que les vidéos, qui sont destinées à aider les enseignants à voir comment les activités fonctionnent (ne les montrez pas à vos classes — laissez-les expérimenter eux-mêmes les activités !). Toutes les activités que nous fournissons sont open source – elles sont publiées sous licence <a href="https://creativecommons.org/licenses/by-sa/4.0/deed.fr">Creative Commons Attribution - Partage dans les Mêmes Conditions</a>, pour que vous puissiez copier, partager et modifier ces documents.
it: Grazie a generose sponsorizzazioni siamo stati in grado di creare risorse aggiuntive come i video, che hanno lo scopo di aiutare gli insegnanti a far vedere come funzionano le attività (per favore non mostrateli ai vostri studenti - lasciate che sperimentino le attività in prima persona!). Tutte le attività che forniamo sono open source - sono rilasciate sotto licenza Creative Commons BY-NC-SA, quindi puoi copiare, condividere e modificare il materiale.
mi: Nā te pūtea tautoko nui i taea ai e matou te hanga i ngā rauemi tautoko pērā ki ngā kiriata, hei āwhina i ngā kaiako kia kitea pēhea te whakamahi i ēnei ngohe i te akomanga (tēnā, kaua e whakaatu ki ō akomanga - tukua ngā ngohe hei mea whai wheako mā rātou!). He "tukunga-utu-kore" ngā ngohe katoa - kua tukuna i raro i tētahi raihana <a href="https://creativecommons.org/licenses/by-sa/4.0/">Creative Commons Attribution-ShareAlike licence</a>, nā reira ka āhei koe te tārua, te tuari hoki, te whakahou hoki i ngā rauemi.

source: For an explanation on the connections between CS Unplugged and Computational Thinking skills, see our <a href="%(computational_thinking_url)s">Computational Thinking and CS Unplugged page</a>.
de: Erläuterungen zu den Zusammenhängen zwischen CS Unplugged und informatischen Denkfähigkeiten sind auf unserer Seite <a href="%(computational_thinking_url)s">Informatisches Denken und CS Unplugged</a> zu finden.
es: Para ver una explicación sobre las conexiones entre CS Unplugged y las habilidades del pensamiento computacional, consulta nuestra <a href="%(computational_thinking_url)s">página Pensamiento computacional y CS Unplugged</a>.
fr: Pour une explication sur les relations entre les compétences de CS Unplugged et de Computational Thinking, consultez notre <a href="%(computational_thinking_url)s">Page Thinking Computational et CS Unplugged</a>.
mi: Tirohia tā mātou <a href="%(computational_thinking_url)s">whārangi mō te Whakaaro Rorohiko me te CS Unplugged</a> mō tētahi whakamāramatanga mō ngā hononga o ngā pūkenga o te CS Unplugged me te Whakaaro Rorohiko.

source: To view the team of contributors who work on this project, see our <a href="%(people_url)s">people page</a>.
de: Alle an diesem Projekt mitwirkenden Personen finden Sie unter <a href="%(people_url)s">Leute</a> aufgeführt.
es: Para el ver el equipo de colaboradores que trabaja en este proyecto, consulta nuestra <a href="%(people_url)s">página de personal</a>.
fr: Pour voir l'ensemble des contributeurs qui travaillent sur ce projet, voilà la page de notre <a href="%(people_url)s">équipe</a>.
it: Per visualizzare il team di collaboratori che lavorano a questo progetto, consulta la nostra pagina <a href="%(people_url)s">persone</a>.
mi: Kia kitea ai te tīma mō tēnei kaupapa, tirohia tā mātou <a href="%(people_url)s">whārangi tangata</a>.

source: For details on how to contact us, see our <a href="%(contact_url)s">contact us page</a>.
de: Unsere Kontaktinformationen finden Sie unter <a href="%(contact_url)s">Kontaktaufnahme</a>.
es: Para obtener más información sobre cómo contactar con nosotros, consulta nuestra <a href="%(contact_url)s">página de contacto</a>.
fr: Pour nous contacter, regardez notre page <a href="%(contact_url)s">Contactez-nous</a>.
it: Per i dettagli su come contattarci, consulta la nostra pagina <a href="%(contact_url)s">contatti</a>.
mi: Ki te whakapā mai ki a mātou, haere ki te <a href="%(contact_url)s">whārangi whakapā mai</a>.

source: For more information about the principles behind CS Unplugged, see our <a href="%(principles_url)s">principles page</a>.
de: Weitere Informationen über die Prinzipien von CS Unplugged finden Sie unter <a href="%(principles_url)s">Grundsätze</a>.
es: Para obtener más información acerca de los principios detrás de CS Unplugged, consulta nuestra <a href="%(principles_url)s">página de principios</a>.
fr: Pour plus d'informations sur les principes sur lesquels CS Unplugged repose, voyez notre page <a href="%(principles_url)s">Principes</a>.
it: Per ulteriori informazioni sui principi alla base di CS Unplugged, consulta la nostra pagina <a href="%(principles_url)s">principi</a>.
mi: Kia toro atu mō ngā mātāpono o CS Unplugged, tirohia <a href="%(principles_url)s">whārangi mō ngā mātāpono</a>.

source: About pages
de: Info-Seiten
es: Páginas Acerca de
fr: Les pages À propos
it: Pagine di informazioni
mi: Whārangi mō mātou

source: Computational Thinking and CS Unplugged
de: Informatisches Denken und CS Unplugged
es: Pensamiento computacional y CS Unplugged
fr: La Pensée Informatique et CS Unplugged
it: Pensiero computazionale e CS Unplugged
mi: Te Whakaaro Rorohiko me CS Unplugged

source: Principles
de: Grundsätze
es: Principios
fr: Principes
it: Principi
mi: Ngā Mātāpono

source: People
de: Leute
es: Personal
fr: L'équipe
it: Persone
mi: Tāngata

source: Contact Us
de: Kontaktaufnahme
es: Contacto
fr: Contactez-nous
it: Contattaci
mi: Whakapā mai

source: What is Computational Thinking?
de: Was ist informatisches Denken?
es: ¿Qué es el pensamiento computacional?
fr: Qu'est-ce que la Pensée informatique?
it: Cos'è il pensiero computazionale?
mi: He aha te Whakaaro Rorohiko?

source: The world we live in has become a digital one, filled with technology and driven by Computer Science. Software and technology have transformed every subject and job area, from science and medicine, to art history and psychology. Digital technology is ubiquitous. To be informed and empowered citizens, the next generation of students need to understand this digital world that they live in.
de: Wir leben mittlerweile in einer digitalisierten Welt, die voller Technologie steckt und von Informatik lebt. Software und Technologie haben sämtliche Fach- und Arbeitsgebiete, von Wissenschaft und Medizin bis hin zu Geschichte und Psychologie, transformiert. Digitale Technologie ist allgegenwärtig. Um sachkundig und selbstständig damit umgehen zu können, muss die nächste Schülergeneration die sie umgebende digitale Welt verstehen.
es: El mundo donde vivimos se ha convertido en un mundo digital, lleno de tecnología e impulsado por la informática. El software y la tecnología han transformado todas las materias y áreas de trabajo, desde la ciencia y la medicina, hasta la historia del arte y la psicología. La tecnología digital es omnipresente. Para ser ciudadanos informados y empoderados, la próxima generación de estudiantes debe comprender este mundo digital en el que viven.
fr: Le monde dans lequel nous vivons est devenu numérique, rempli par la technologie et piloté par l'informatique. Les logiciels et la technologie ont transformé tous les sujets et les domaines d'activité, de la science et la médecine, jusqu'à l'histoire de l'art et la psychologie. La technologie numérique est omniprésente. Pour être des citoyens informés et autonomes, la prochaine génération d'élèves a besoin de comprendre ce monde numérique dans lequel ils vivent.
it: Il mondo in cui viviamo è diventato un mondo digitale, pieno di tecnologia e guidato dall'Informatica. Programmi e tecnologie hanno trasformato ogni disciplina e ogni ambito di lavoro, dalla scienza alla medicina, fino alla storia dell'arte e alla psicologia. La tecnologia digitale è ubiqua. Affinché diventino cittadini informati e responsabili, la prossima generazione di studenti ha bisogno di comprendere questo mondo digitale in cui vive.
mi: Kua huri tēnei ao e noho nei tātou hei ao matihiko, kua kī i te hangarau, kua whakakahangia e te pūtaiao rorohiko. Kua whakahuria ngā marau katoa, me ngā momo tūmahi katoa e te hangarau me ngā pūmanawa rorohiko, mai i te pūtaiao me te rongoā ki te mātai hinengaro me te rangahau toi ataata. He hangarau matihiko ka kitea, puta noa i te ao. Kia whakamanatia, kia whai mōhio hoki ngā kirirarau, me mōhio rawa te whakatipuranga hou o ngā ākonga ki tēnei ao hangarau matihiko e noho nei rātou.

source: This is why Computational Thinking has been called the ‘21st Century Skill Set’, and is important for everyone to learn. It is critical to understanding how the digital world works, for harnessing the power of computers to solve tough problems, and making great things happen! It also enables us to think critically about not just the benefits of certain technologies, but also the potential harm, ethical implications, or unintended consequences of these.
de: Daher wird informatisches Denken auch „Schlüsselkompetenz des 21. Jahrhunderts“ genannt und sollte von jedermann erlernt werden. Um sich die Leistungsfähigkeit von Computern zur Lösung schwieriger Aufgabenstellungen zunutze zu machen und großartige Dinge zu vollbringen, muss man verstehen, wie die digitale Welt funktioniert. Darüber hinaus ermöglicht es uns, nicht nur die Vorteile bestimmter Technologien kritischer zu betrachten, sondern auch die möglichen Nachteile, ethischen Auswirkungen oder die unbeabsichtigten Konsequenzen davon.
es: Esta es la razón por la que se ha llamado al pensamiento computacional el "conjunto de habilidades del siglo XXI" y es importante que todos lo aprendan. Es fundamental para comprender cómo funciona el mundo digital, para aprovechar el poder de los ordenadores para resolver problemas difíciles y hacer que sucedan cosas geniales. También nos permite pensar críticamente no solo sobre los beneficios de ciertas tecnologías, sino también sobre el daño potencial, las implicaciones éticas o las consecuencias no deseadas de estas.
fr: C'est pourquoi la Pensée informatique a été appelée l'"ensemble de compétences du 21e siècle", et il est important que tout le monde l'apprenne. Il est essentiel de comprendre comment le monde numérique fonctionne, pour exploiter la puissance des ordinateurs pour résoudre des problèmes difficiles, et de faire de grandes choses ! Cette pensée nous permet aussi de réfléchir de manière critique pas seulement sur les avantages de certaines technologies, mais aussi sur leurs méfaits potentiels, leurs enjeux éthiques, ou leurs conséquences inattendues.
it: Questo è il motivo per cui il pensiero computazionale è stato chiamato come un "insieme di competenze del XXI secolo" ed è importante che tutti lo imparino. È fondamentale capire come funziona il mondo digitale, e sfruttare la potenza dei computer per risolvere problemi difficili e realizzare grandi cose! Il pensiero computazionale ci consente inoltre di pensare in modo critico non solo ai benefici di determinate tecnologie, ma anche ai rischi, alle implicazioni etiche o alle conseguenze non intenzionali di esse.
mi: Ko tēnei te take, e kīia ai te Whakaaro Rorohiko he 'kete pukenga rau tau 21'. Koia hoki te take he tino kaupapa ako tēnei mō te tangata ahakoa ko wai. He mōhiotanga nui tēnei, kia mārama ki ngā nekenekehanga o te ao hangarau matihiko, me te whakamahi i te rorohiko ki te whakaoti rapanga uaua, kia puta ai ngā otinga pai! He pai hoki tēnei kia taea ai te whakaaro hōhonu mō ngā painga o ngā momo hangarau, me ngā raru hoki, ngā pānga matatika, me ngā pānga pokerehū.

source: But what exactly is Computational Thinking? Let’s have a look at a technical definition...
de: Doch was genau ist informatisches Denken? Sehen wir uns einmal eine technische Definition dazu an ...
es: Pero, ¿qué es exactamente el pensamiento computacional? Echemos un vistazo a una definición técnica...
fr: Mais qu'est-ce que la Pensée Informatique exactement ? Jetons un coup d'œil à une définition technique...
it: Ma cos'è esattamente il pensiero computazionale? Diamo un'occhiata a una definizione tecnica...
mi: Heoi anō, he aha tēnei mea te Whakaaro Rorohiko? Anei te whakapapa hangarau...

source: "Computational Thinking is the thought processes involved in formulating problems and their solutions so that the solutions are represented in a form that can be effectively carried out by an information-processing agent."
de: „Informatisches Denken ist der Denkprozess, der beim Formulieren von Problemen und deren Lösungen Anwendung findet, sodass die Lösungen in einer Weise dargestellt werden, die durch einen informationsverarbeitenden Vermittler effektiv ausgeführt werden kann.“
es: "El pensamiento computacional lo conforman los procesos de pensamiento involucrados en la formulación de problemas y sus soluciones para que las soluciones se representen de una forma que pueda ser llevada a cabo de manera eficaz por un agente de procesamiento de información."
fr: "La Pensée Informatique est le processus de la pensée impliqué dans la formulation des problèmes et de leurs solutions de manière à ce que ces solutions soient représentées sous une forme qui puisse être réalisée efficacement par un agent de traitement de l'information."
it: "Il pensiero computazionale è l'insieme dei processi mentali coinvolti nella formulazione dei problemi e delle loro soluzioni, di modo che le soluzioni siano rappresentate in una forma che può essere effettivamente eseguita da un agente di elaborazione delle informazioni."
mi: "Ko te "Whakaaro Rorohiko" tētahi momo tukanga whakaaro e whakamahia ki te wetewete i ngā āhuatanga o tētahi rapanga, me ngā otinga, kia whakatakotoria hei tauira e tika ana kia whakahaerengia e te rorohiko, i tētahi atu pūnaha whakahaere i te mōhiohio rānei."

source: Phew, it’s quite a mouthful isn’t it? But, as we like to say at CS Unplugged, it’s just big words for simple ideas! 'Information-processing agent' means anything that follows a set of instructions to complete a task (we call this 'computing'). Most of the time this 'agent' means a computer or other type of digital device - but it could also be a human! We’ll refer to it as a computer to make things a bit simpler. To represent solutions in a way that a computer can carry them out, we have to represent them as a step by step process - an <strong>algorithm</strong>. To create these algorithmic solutions we apply some special problem solving skills to. These skill are what make up Computational Thinking! And they are skills that are transferrable to any field.
de: Puh! Das ist ein ganz schöner Happen, nicht wahr? Aber wie wir bei CS Unplugged immer sagen: Es sind nur große Worte für einfache Konzepte! „Informationsverarbeitender Vermittler“ bezieht sich auf alles, was einer Reihe von Anweisungen folgt, um eine Aufgabe auszuführen (wir nennen dies „Datenverarbeitung“). In den meisten Fällen bezieht sich „Vermittler“ auf einen Computer oder ein sonstiges digitales Gerät – es könnte allerdings auch ein menschliches Wesen damit gemeint sein! Damit die Sache etwas einfacher wird, beziehen wir uns insoweit künftig auf Computer. Um nun Lösungen so darzustellen, dass sie von einem Computer ausgeführt werden können, müssen sie als schrittweiser Prozess, d. h. als <strong>Algorithmus</strong>, dargestellt werden. Und um diese Algorithmuslösung zu erstellen, wenden wir ein paar besondere Problemlösungsfähigkeiten an. Diese Fähigkeiten sind das, was informatisches Denken ausmachen! Und diese Fähigkeiten sind auf jeden beliebigen Bereich übertragbar.
es: Vaya trabalenguas, ¿verdad? Pero, como nos gusta decir en CS Unplugged, ¡son solo palabras complicadas para ideas sencillas! "Agente de procesamiento de información" significa cualquier cosa que siga un conjunto de instrucciones para completar una tarea (a esto lo llamamos "computación"). La mayoría de las ocasiones, este "agente" es un ordenador u otro tipo de dispositivo digital - ¡pero también podría ser un humano! Nos referiremos a él como un ordenador para hacer las cosas un poco más simples. Para representar soluciones de manera que un ordenador pueda llevarlas a cabo, debemos representarlas como un proceso paso a paso - un <strong>algoritmo</strong>. Para crear estas soluciones algorítmicas, usamos algunas habilidades especiales de resolución de problemas. ¡Estas habilidades son las que forman el pensamiento computacional! Y son habilidades que se pueden transferir a cualquier campo.
fr: Pfiou ! c'est un sacré morceau n'est-ce pas ? Mais, comme nous aimons le dire à CS Unplugged, ce sont juste de grands mots pour des idées simples ! "Agent de traitement de l'information" signifie quelque chose qui suit un ensemble d'instructions pour effectuer une tâche (nous appelons cela "calculer"). La plupart du temps, cet "agent" est un ordinateur ou un autre type de dispositif numérique — mais il pourrait aussi être un homme ! Nous l'appellerons ordinateur pour rester simple. Pour représenter les solutions d'une manière qu'un ordinateur puisse les mettre en oeuvre, nous devons les représenter comme un processus étape par étape — un <strong>algorithme</strong>. Pour créer ces solutions algorithmiques on applique certaines méthodes bien déterminées de résolution de problèmes. Ces compétences sont la Pensée Informatique ! Et ce sont des compétences qui sont transférables à toute autre discipline.
it: Uff, sono paroloni, non è vero? Ma, come piace dire a noi di CS Unplugged, sono solo grandi parole per idee semplici! 'Agente di elaborazione delle informazioni' indica qualsiasi cosa che può seguire un insieme fissato di istruzioni per completare un'attività (si parla di 'elaborazione' o 'computazione'). Il più delle volte questo 'agente' indica un computer o un altro tipo di dispositivo digitale, ma potrebbe anche essere una persona! Ci riferiremo ad esso con la parola 'computer' per semplificare un po'. Per rappresentare le soluzioni in modo che un computer possa eseguirle, dobbiamo rappresentarle come un processo 'passo passo' - un <strong>algoritmo</strong>. Per creare queste soluzioni algoritmiche applichiamo alcune specifiche abilità per la risoluzione di problemi. Queste abilità sono ciò che costituiscono il pensiero computazionale! E sono abilità che sono trasferibili a qualsiasi campo.
mi: Auē! Te pīroiroi hoki! Heoi anō, ki a mātou o te CS Unplugged, he nui ngā kupu, he ngāwari ngā huatau! Ko te tikanga o te 'kaikawe tukatuka mōhiohio', ko tētahi mea kei te whai i ngā tohutohu kia oti ai tētahi mahi (arā, ko te 'mahi rorohiko'). I te nuinga o ngā wā he rorohiko tēnei 'kaikawe', ko tētahi atu momo pūrere matihiko rānei, heoi, he tangata pea rānei! Heoi anō, kia ngāwari te kōrero i konei, ka kīia he rorohiko. Kia taea ai e ngā rorohiko te whai i ngā tohutohu, me āta raupapa aua tohutohu - ka kīia tērā he <strong>hātepe</strong>. Ki te hanga i aua otinga hātepe, me whakamahi i ētahi pūkenga motuhake hei whakaoti rapanga. Koinei ngā pūkenga o te Whakaaro Rorohiko! Waihoki he pūkenga pai ēnei mō ngā tūmomo mahi katoa.
