Repository: uccser/cs-unplugged
Catalog: csunplugged/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, it, mi

source: Return to the topic
de: Zurück zum Thema
es: Regresar al tema
fr: Retour au thème
it: Ritorna all'argomento
mi: Hoki ki te kaupapa

source: Return to list of topics
de: Zurück zur Themenliste
es: Volver a la lista de temas
fr: Retour à la liste des thèmes
it: Ritorna alla lista di argomenti
mi: Hoki ki te rārangi kaupapa

source: Unit Plans
de: Lehrpläne
es: Planes de estudios
fr: Modules
it: Unità didattiche
mi: Mahere Kōwae Ako

source: Looking for more?
de: Sie suchen nach mehr?
es: ¿Buscas más?
fr: Plus d'informations ?
it: Vuoi saperne di più?
mi: Kei te kimi tonu?

source: Click here for other resources
de: Für weitere Ressourcen hier klicken
es: Haz clic aquí para ver otros recursos
fr: Cliquez ici pour d'autres ressources
it: Clicca qui per altre risorse
mi: Pāwhiritia ki konei mō rauemi kē atu

source: Description
de: Beschreibung
es: Descripción
it: Descrizione
mi: Whakaahua

source: Unit plan:
de: Lehrplan:
es: Plan de estudios:
fr: Module :
it: Unità didattica:
mi: Mahere kōwae ako:

source: What's it all about?
de: Um was genau geht es?
es: ¿De qué trata esto?
fr: De quoi s'agit-il ?
it: Di cosa si tratta?
mi: He aha te kaupapa nei?

source: Read the full unit plan description
de: Vollständige Lehrplanbeschreibung lesen
es: Lee la descripción completa del plan de estudios
fr: Lire la description complète du module
it: Leggi la descrizione completa dell'unità didattica
mi: Pānuitia te katoa o te whakaahua mahere kōwae ako

source: Lessons
de: Lektionen
es: Lecciones
fr: Cours
it: Lezioni
mi: Ngā Akoranga

source: Curriculum Area
de: Bildungsbereich
es: Área curricular
fr: Espace du programme scolaire
it: Area disciplinare
mi: Wāhanga Marautanga

source: Learning Outcome
de: Lernerfolg
es: Resultado del aprendizaje
fr: Résultats pédagogiques
it: Obiettivo di apprendimento
mi: Whāinga Ako

source: Classroom Resource
de: Schulraumressource
es: Recurso del aula
fr: Ressources de la classe
it: Risorsa per la classe
mi: Rauemi Akomanga

source: Unit Plan
de: Lehrplan
es: Actividades de la unidad
fr: Module
it: Unità didattica
mi: Mahere Kōwae

source: Return to topic
de: Zurück zum Thema
es: Volver al tema
fr: Retour au thème
it: Ritorna all'argomento
mi: Hoki ki te kaupapa

source: Programming Challenge
de: Progammieraufgabe
es: Desafío de programación
fr: Défi de programmation
it: Sfida di programmazione
mi: Wero Tuhiwaehere

source: Return to unit plan
de: Zurück zum Lehrplan
es: Volver al plan de estudios
fr: Retour au module
it: Ritorna all'unità didattica
mi: Hoki ki te mahere kōwae ako

source: Curriculum Integration
de: Lehrplaninhalt
es: Integración curricular
fr: Intégration dans le programme scolaire
it: Integrazione con altre discipline
mi: Ngā Honohono ki te Marautanga

source: Base 10
de: Basis 10
mi: Pūtake 10

source: Run length encoding
de: Lauflängenkodierung
fr: Le codage par plages
it: codifica di lunghezza delle sequenze (Run Length Encodings, RLE)
mi: Whakawaehere Roanga-Rerenga

source: L,O,N,K,E,D,S,P,G,B,I,Y
it: L,O,N,C,E,D,S,P,G,B,I,Z
mi: H,M,P,T,R,W,A,E,U

source: Circular
de: Kreisförmig
fr: Circulaire
it: Circolare
mi: Porohitahita

source: No
de: Nein
fr: Non
mi: Kāore

source: Twitter
mi: Tīhau
