Repository: uccser/cs-unplugged
Catalog: csunplugged/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, it, mi

source: Translations for some activities available at the Classic CS Unplugged website
de: Übersetzungen für einige der Aktivitäten sind auf der Website CS Unplugged Original verfügbar
es: En el sitio web de CS Unplugged Clásico hay traducciones disponibles para algunas de las actividades
fr: Traductions pour certaines activités disponibles sur le site CS Unplugged classique
mi: He whakamāoritanga mō ētahi o ngā ngohe o te paetukutuku CS Unplugged Classic

source: Not available in %(language)s
de: Nicht in %(language)s verfügbar
es: No disponible en %(language)s
fr: Non disponible en %(language)s
it: Non disponibile in %(language)s
mi: Kāore e taea ki te reo %(language)s

source: This page diplays a complete list of all available printables. If a lesson uses a printable, the lesson will contain a direct link to the printable with a description on how to use it.
de: Diese Seite enthält eine vollständige Liste aller verfügbaren Ausdrucke. Lektionen, in denen Ausdrucke verwendet werden, enthalten direkte Links zu den jeweiligen Ausdrucken und eine Beschreibung zur Verwendung.
es: Esta página muestra una lista completa de todos los materiales disponibles para imprimir. Si una lección usa uno de estos materiales, contendrá un enlace directo al mismo con una descripción de cómo usarlo.
fr: Cette page affiche une liste complète de tous les documents imprimables. Si une leçon utilise un document imprimable, la leçon contiendra un lien direct vers le document avec une description sur la façon de l'utiliser.
it: Questa pagina mostra un elenco completo di tutti i file stampabili disponibili. Se una lezione utilizza un elemento stampabile, la lezione conterrà un link diretto al testo stampabile con una descrizione su come usarlo.
mi: Kei tēnei whārangi te rārangi o ngā rauemi tā katoa. Ina he rauemi tā mō tētahi akoranga, kei roto i taua akoranga anō tētahi hononga tōtika ki taua rauemi tā, me ngā whakamārama pēhea te whakamahi i taua rauemi.

source: No printables are available.
de: Keine Ausdrucke verfügbar.
es: No hay ningún material disponible para imprimir.
fr: Aucune version à imprimer n'est disponible.
it: Non sono disponibili stampabili.
mi: Kāore he rauemi tā mō tēnei.

source: Return to list of printables
de: Zurück zur Liste der Ausdrucke
es: Volver a la lista de materiales para imprimir
fr: Revenir à la liste des documents à imprimer
it: Ritorna alla lista dei file stampabili
mi: Hoki ki te rārangi rauemi tā

source: Create Printable
de: Ausdruck erstellen
es: Crear material para imprimir
fr: Créer un document à imprimer
it: Crea stampabile
mi: Waihanga Rauemi e taea te Tā

source: Generate Printable
de: Ausdruck erstellen
es: Generar material para imprimir
fr: Générer un document à imprimer
it: Genera stampabile
mi: Whakaputa Rauemi ka taea te Tā

source: The download of this Printable includes %(copies_amount)s unique copies.
de: Der Download dieses Ausdrucks umfasst %(copies_amount)s Varianten.
es: La descarga de este material para imprimir incluye %(copies_amount)s copias únicas.
fr: Le téléchargement des documents à imprimer comporte %(copies_amount)s exemplaires.
it: Il download di questo stampabile include %(copies_amount)s copie uniche.
mi: Kei roto i te rauemi tā nei e %(copies_amount)s ngā tārua motuhake.

source: Download Printable
de: Ausdruck herunterladen
es: Descargar material para imprimir
fr: Télécharger le document à imprimer
it: Scarica stampabile
mi: Tikiake i te Rauemi Tā

source: Preview
de: Vorschau
es: Vista previa
fr: Aperçu
it: Anteprima
mi: Tiro-wawe

source: Related Lessons
de: Zugehörige Lektionen
es: Lecciones relacionadas
fr: Leçons associées
it: Lezioni correlate
mi: He Akoranga Whai Pānga

source: Topic
de: Thema
es: Tema
fr: Thème
it: Argomento
mi: Kaupapa

source: Ages
de: Alter
es: Edades
fr: Âges
it: Età
mi: Ngā tau o ngā ākonga

source: Number
de: Nummer
es: Número
fr: Numéro
it: Numero
mi: Nama

source: Lesson
de: Lektion
es: Lección
fr: Cours
it: Lezione
mi: Akoranga

source: Within topic
de: Teil des Themas
es: Dentro del tema
fr: Dans le thème
it: All'interno dell'argomento
mi: Kei roto i te kaupapa

source: <strong>Ages %(lower)s to %(upper)s:</strong> Lesson %(number)s
de: <strong>Alter %(lower)s bis %(upper)s:</strong> Lektion %(number)s
es: <strong>Edades %(lower)s hasta %(upper)s:</strong> Lección %(number)s
fr: <strong>Âges : de %(lower)s à %(upper)s ans :</strong> Cours %(number)s
it: <strong>Da %(lower)s a %(upper)s anni:</strong> Lezione %(number)s
mi: <strong>Ngā tau %(lower)s ki %(upper)s:</strong> Akoranga %(number)s

source: within unit plan
de: innerhalb des Lehrplans
es: dentro del plan de estudios
fr: à l'intérieur du module
it: all'interno dell'unità didattica
mi: kei roto i te mahere kōwae ako

source: Challenge Level:
de: Schwierigkeitsgrad:
es: Nivel del desafío:
fr: Niveau de défi:
it: Livello di difficoltà:
mi: Taumata Wero:

source: The following table lists curriculum integrations for all topics in the CS Unplugged content.
de: Die nachfolgende Tabelle zeigt die Lehrplaninhalte der von CS Unplugged umfassten Themen.
es: La siguiente tabla enumera las integraciones curriculares para todos los temas en el contenido de CS Unplugged.
fr: Le tableau suivant répertorie les programmes scolaires pour chaque sujets d'Informatique Débranchée.
it: La seguente tabella elenca le integrazioni con le altre discipline per tutti gli argomenti di CS Unplugged.
mi: Kei te tēpu e whai ake nei, ngā hononga marautanga mō ngā kaupapa katoa o te CS Unplugged.

source: Activity
de: Aktivität
es: Actividad
fr: Activité
it: Attività
mi: Ngā Mahinga

source: Curriculum Areas
de: Bildungsbereiche
es: Áreas curriculares
fr: Espace du programme scolaire
it: Aree disciplinari
mi: Ngā Wāhanga Ako o te Marautanga

source: Prerequisite Lessons?
de: Vorlektionen?
es: ¿Lecciones previas necesarias?
fr: Cours prérequis ?
it: Lezioni precedenti come prerequisito?
mi: Ngā Akoranga Tōmua?

source: Seeing the Computational Thinking connections
de: Informatische Denkzusammenhänge erkennen
es: Visualización de las conexiones del pensamiento computacional
fr: Voir les liens avec la Pensée Informatique
it: Collegamenti con il pensiero computazionale
mi: Kia kitea ngā hononga ki te Whakaaro Rorohiko

source: Throughout the lessons there are links to computational thinking. Below we've noted some general links that apply to this content.
de: Aus allen Lektionen ergeben sich Verbindungen zu informatischem Denken. Nachstehend sind ein paar allgemeine Verbindungen aufgeführt, die diesen Inhalt betreffen.
es: A lo largo de las lecciones, hay enlaces al pensamiento computacional. A continuación, hemos anotado algunos enlaces generales que se aplican a este contenido.
fr: Tout au long des leçons, il y a des liens vers la pensée informatique. Ci-dessous nous avons noté quelques liens généraux en lien avec ce contenu.
it: Nel corso delle lezioni sono esplicitati collegamenti al pensiero computazionale. Di seguito abbiamo evidenziato alcuni collegamenti generali che si applicano a questo contenuto.
mi: Kei roto i te maha o ngā akoranga, he hononga ki te whakaaro rorohiko. Kei raro nei ētahi o aua hononga whānui e pā ana ki tēnei akoranga.

source: Teaching computational thinking through CSUnplugged activities supports students to learn how to describe a problem, identify what are the important details they need to solve this problem, and break it down into small, logical steps so that they can then create a process which solves the problem, and then evaluate this process. These skills are transferable to any other curriculum area, but are particularly relevant to developing digital systems and solving problems using the capabilities of computers.
de: Beim Unterrichten von informatischem Denken mithilfe von CS Unplugged Aktivitäten lernen Schüler, ein Problem zu beschreiben, die zur Lösung des Problems erforderlichen Details zu identifizieren und das Problem in kleine, logische Schritte zu zerlegen, um anhand dieser Schritte einen Prozess zur Lösung des Problems erstellen zu können und dann diesen Prozess zu beurteilen. Diese Fähigkeiten sind auf beliebige andere Bildungsbereiche übertragbar, sind jedoch insbesondere wichtig, um digitale Systeme zu entwickeln und Probleme mithilfe der Einsatzmöglichkeiten von Computern zu lösen.
es: La enseñanza del pensamiento computacional a través de las actividades de CS Unplugged le enseña a los alumnos cómo describir un problema, identificar los detalles importantes necesarios para resolver este problema, descomponer el problema en pequeños y lógicos pasos para crear un proceso que resuelva el problema y luego evaluar este proceso. Estas habilidades son transferibles a cualquier otra área curricular, pero son particularmente relevantes para desarrollar sistemas digitales y para resolver problemas utilizando la capacidad de los ordenadores.
fr: L'enseignement de la pensée informatique par le biais des activités d'Informatique Débranchée aide les élèves à apprendre à décrire un problème, identifier quels sont les détails importants dont ils ont besoin pour résoudre ce problème, et le décomposer en petites étapes logiques de sorte qu'ils peuvent ensuite créer un processus qui permet de résoudre le problème, puis d'évaluer ce processus. Ces compétences sont transférables à une autre discipline, mais sont particulièrement pertinentes pour le développement de systèmes numériques et la résolution de problèmes en utilisant les capacités des ordinateurs.
it: Insegnare il pensiero computazionale attraverso le attività CSUnplugged aiuta gli studenti a imparare come descrivere un problema, identificare quali sono i dettagli importanti di cui hanno bisogno per risolvere questo problema, scomporlo in piccoli passi logici, di modo da poter creare un processo che risolva il problema, infine valutare questo processo. Queste competenze sono trasferibili a qualsiasi altra area del curriculum, ma sono particolarmente rilevanti per lo sviluppo di sistemi digitali e la risoluzione di problemi utilizzando le potenzialità dei computer.
mi: Mā te whakaako i te whakaaro rorohiko mā ngā ngohe CSUnplugged e āwhina ai ngā ākonga kia āhei rātou te whakaatu he aha te rapanga, te tautuhi hoki, ko ēhea o ngā taipitopito e tika ana hei whakaoti i te rapanga, hei wetewete hoki kia iti noa, kia arorau hoki ngā mahinga. Kātahi ka taea te waihanga i te tukanga hei whakaoti i te rapanga, hei aromātai hoki i tēnei tukanga. He pūkenga pai ēnei mō te whakawhanake i ngā pūnaha matihiko, hei whakaoti rapanga hoki mā ngā pūkenga o te rorohiko, engari ka taea hoki te whakamahi i aua pūkenga mō ngā marautanga katoa.

source: These Computational Thinking concepts are all connected to each other and support each other, but it’s important to note that not all aspects of Computational Thinking happen in every unit or lesson. We’ve highlighted the important connections for you to observe your students in action. For more background information on what our definition of Computational Thinking is <a href="%(ct_url)s">see our notes about computational thinking</a>.
de: Diese informatischen Denkkonzepte sind alle miteinander verbunden und stützen sich gegenseitig. Insoweit möchten wir jedoch anmerken, dass nicht alle Aspekte des informatischen Denkens in jeder Unterrichtseinheit oder Lektion vorkommen. Wir haben jeweils die für Sie wichtigen Verbindungen hervorgehoben, um Ihre Schüler in Aktion zu beobachten. <a href="%(ct_url)s">Unser Artikel zu informatischem Denken</a> enthält weitere Hintergrundinformationen dazu, wie wir informatisches Denken definieren.
es: Estos conceptos del pensamiento computacional están todos conectados entre sí y se apoyan mutuamente, pero es importante tener en cuenta que no todos los aspectos del pensamiento computacional ocurren en cada unidad o lección. Hemos resaltado las conexiones importantes para que puedas observar a tus alumnos en acción. Para obtener más información acerca de nuestra definición del pensamiento computacional, <a href="%(ct_url)s">consulta nuestras notas sobre el pensamiento computacional</a>.
fr: Ces concepts de Pensée Informatique sont tous connectés les uns aux autres et s’appuient les uns sur les autres, mais il est important de noter que tous les aspects de la Pensée Informatique n'apparaissent pas dans chaque module ou chaque leçon. Nous avons mis en évidence les connexions importantes pour vous permettre d’observer vos élèves en action. Pour plus d’informations sur notre définition de la Pensée Informatique : <a href="%(ct_url)s">voir nos notes sur la Pensée Informatique</a>.
it: Questi concetti di Pensiero Computazionale sono tutti collegati tra loro e si supportano l'uno con l'altro, ma è importante notare che non tutti gli aspetti del Pensiero Computazionale sono necessariamente presenti in ogni unità o lezione. Abbiamo messo in evidenza le connessioni importanti, affinché tu le possa osservare nei tuoi studenti in azione. Per ulteriori informazioni di base su quale sia la nostra definizione di Pensiero Computazionale <a href="%(ct_url)s">vedi le nostre note sul pensiero computazionale</a>.
mi: He maha ngā hononga i waenga i ēnei ariā Whakaaro Rorohiko, ka tautoko tētahi ki tētahi, engari me mātua mōhio, kāore e puta te katoa o ngā wāhanga o te Whakaaro Rorohiko i roto i ia kōwae, akoranga rānei. Kua tīpako mātou i ngā hononga nui kia kite ai ā koutou ākonga e mahi ana. Ki te kimi mōhiohio anō mō ā tātou kōrero mō te Whakaaro Rorohiko, <a href="%(ct_url)s">toro atu kī ā mātou tuhinga mō te whakaaro rorohiko</a>.

source: Heads up!
de: Achtung!
es: ¡Aviso!
fr: Avertissement !
it: Attenzione!
mi: Kia mataara!

source: To do this activity it's expected you understand the content covered in the following:
de: Für diese Aktivität werden Kenntnisse des in folgender Lektion behandelten Lehrstoffs vorausgesetzt:
es: Para realizar esta actividad se espera que comprendas el contenido cubierto en los siguientes elementos:
fr: Pour faire cette activité il est attendu que vous compreniez le contenu abordé dans :
it: Per svolgere questa attività è previsto che tu abbia appreso il contenuto trattato in:
mi: Ki te whakamahi i tēnei ngohe, me matua mōhio ki ngā ihirangi kei roto i ēnei:

source: The following glossary terms are not yet available in %(language)s. Sorry about that!
de: Die folgenden Glossarbegriffe sind noch nicht in %(language)s verfügbar. Tut uns leid!
es: Los siguientes términos del glosario todavía no están disponibles en %(language)s. ¡Lo sentimos!
fr: Désolé ! Les termes suivants du glossaire ne sont pas encore disponibles en %(language)s.
it: I seguenti termini del glossario non sono ancora disponibili in %(language)s. Ci dispiace!
mi: Kāore anō kia āhei ngā tuemi kuputaka i roto i ngā reo %(language)s. Aroha mai!

source: Open a topic to see all related unit plans, lessons, curriculum integrations, and programming challenges.
de: Klicken Sie auf ein Thema, um alle zugehörigen Lehrpläne, Lektionen, Lehrplaninhalte und Programmieraufgaben anzuzeigen.
es: Abre un tema para ver todos los planes de estudios, lecciones, integraciones curriculares y desafíos de programación relacionados.
fr: Ouvrez un sujet pour voir tous les modules liés, les leçons du programme, des intégrations et des défis de programmation.
it: Clicca su un argomento per vedere tutte le unità didattiche, le lezioni, le integrazioni con altre discipline e le sfide di programmazione.
mi: Huakina mai tētahi kaupapa kia kitea ai ngā mahere kōwae ako, ngā akoranga, ngā whakaurunga marautanga, ngā wero tuhiwaehere hoki.

source: Ages %(min_age)s to %(max_age)s
de: Alter %(min_age)s bis %(max_age)s
es: Edades %(min_age)s a %(max_age)s
fr: Âges : de %(min_age)s à %(max_age)s ans
it: Per studenti da %(min_age)s a %(max_age)s anni
mi: Ngā tau %(min_age)s ki %(max_age)s

source: lessons
de: lektionen
es: lecciones
fr: leçons
it: lezioni
mi: ngā akoranga

source: curriculum integrations
de: Lehrplaninhalte
es: integraciones curriculares
fr: intégrations dans le programme scolaire
it: integrazioni con altre discipline
mi: te whakaurunga marautanga

source: programming challenges
de: programmieraufgaben
es: desafíos de programación
fr: défis de programmation
it: sfide di programmazione
mi: ngā wero tuhiwaehere

source: No topics are available.
de: Keine Themen verfügbar.
es: No hay temas disponibles.
fr: Aucun thème disponible.
it: Nessun argomento disponibile.
mi: Kāore e kitea he kaupapa.

source: <strong>Duration:</strong> %(duration)s minutes
de: <strong>Dauer:</strong> %(duration)s Minuten
es: <strong>Duración:</strong> %(duration)s minutos
fr: <strong>Durée :</strong> %(duration)s minutes
it: <strong>Durata:</strong> %(duration)s minuti
mi: <strong>Roanga:</strong> %(duration)s miniti

source: Learning outcomes
de: Lernerfolge
es: Resultados del aprendizaje
fr: Résultats pédagogiques
it: Obiettivi di apprendimento
mi: Hua akoranga

source: Students will be able to:
de: Schüler können anschließend:
es: Los alumnos podrán:
fr: Les élèves seront capable de :
it: Gli studenti saranno in grado di:
mi: Ka taea e ngā ākonga te:

source: Classroom resources
de: Schulraumressourcen
es: Recursos del aula
fr: Ressources de la classe
it: Risorse per la classe
mi: He rauemi akomanga

source: Programming challenges
de: Programmieraufgaben
es: Desafíos de programación
fr: Défis de programmation
it: Sfide di programmazione
mi: Ngā wero tuhiwaehere

source: View related programming challenges
de: Zugehörige Progammieraufgaben anzeigen
es: Ver desafíos de programación relacionados
fr: Voir les défis de programmation associés
it: Visualizza le sfide di programmazione collegate
mi: Tirohia ētahi wero tuhiwaehere whai pānga

source: Table of contents
de: Inhaltsverzeichnis
es: Índice
fr: Table des matières
it: Indice dei contenuti
mi: Ripanga ihirangi

source: Computational Thinking
de: Informatisches Denken
es: Pensamiento computacional
fr: Pensée informatique
it: Pensiero computazionale
mi: Whakaaro Rorohiko

source: Ages %(lower)s to %(upper)s
de: Alter %(lower)s bis %(upper)s
es: Edades %(lower)s a %(upper)s
fr: Âges : de %(lower)s à %(upper)s ans
it: Da %(lower)s a %(upper)s anni
mi: Ngā tau %(lower)s ki %(upper)s

source: %(name)s solution
de: %(name)s-Lösung
es: Solución %(name)s
fr: solution %(name)s
it: Soluzione %(name)s
mi: te otinga a %(name)s

source: solution
de: Lösung
es: solución
it: soluzione
mi: otinga

source: <strong>Heads Up!</strong> If you are ready to compare your programming to ours or are wanting to have a look at how we solved it, click 'View solution' below to view at least one way to write this program.
de: <strong>Achtung!</strong> Wenn ihr bereit seid, euer Programm mit unserem zu vergleichen oder auch nur einen kurzen Blick auf unsere Lösung werfen möchtet, einfach unten auf „Lösung anzeigen“ klicken, um eine der Möglichkeiten anzusehen, wie dieses Programm geschrieben werden kann.
es: <strong>¡Aviso!</strong> Si estás listo para comparar tu programación con la nuestra o deseas echar un vistazo para ver cómo lo resolvimos, haz clic en "Ver solución" abajo para ver al menos una forma de escribir este programa.
fr: <strong>Attention !</strong> Si vous voulez comparer votre programmation aux nôtres ou si vous voulez avoir un aperçu de la manière dont nous l'avons résolu, cliquez sur 'Voir la solution' ci-dessous pour voir au moins une façon d'écrire ce programme.
it: <strong>Attenzione!</strong> Se sei pronto per confrontare il tuo programma con il nostro, o vuoi vedere come abbiamo risolto la sfida, fai clic su 'Visualizza soluzione' qui sotto per visualizzare uno dei tanti possibili modi che esistono per scrivere questo programma.
mi: <strong>Kia Mataara!</strong> Mēnā, kua rite koe ki te whakataurite āu mahi tuhiwaehere ki ā mātou, kei te hiahia rānei koe ki te kite i pēhea tā mātou otinga, pāwhiritia 'Tirohia te otinga' kei raro nei, kia kite ai i tētahi, ētahi rānei o ngā tauira tuhiwaehere mō tēnei papatono.

source: View solution
de: Lösung anzeigen
es: Ver solución
fr: Voir la solution
it: Visualizza soluzione
mi: Tirohia te otinga

source: This is just one of many possible solutions:
de: Dies ist nur eine von vielen möglichen Lösungen:
es: Esta es solo una de las muchas posibles soluciones:
fr: Ceci est l'une des nombreuses solutions possibles :
it: Questa è solo una delle tante soluzioni possibili:
mi: Ko tēnei tētahi o ngā otinga mahia e taea ana:

source: Back to programming challenge
de: Zurück zur Progammieraufgabe
es: Volver al desafío de programación
fr: Retour aux défis de programmation
it: Torna alla sfida di programmazione
mi: Hoki ki te wero waihanga papatono

source: Extra Challenge
de: Zusatzaufgabe
es: Desafío extra
fr: Défi supplémentaire
it: Sfida aggiuntiva
mi: He Wero Tāpiri

source: %(name)s programming challenges
de: Progammieraufgaben zu %(name)s
es: Desafíos de programación %(name)s
fr: défis de programmation %(name)s
it: Sfide di programmazione: %(name)s
mi: Ngā wero a %(name)s

source: No programming challenges for %(topic)s.
de: Keine Progammieraufgaben für %(topic)s.
es: No hay desafíos de programación para %(topic)s.
fr: Aucun défi de programmation pour %(topic)s.
it: Nessuna sfida di programmazione per l'argomento: %(topic)s.
mi: Kāore he wero mō %(topic)s.

source: This programming challenge is linked to the following lessons:
de: Diese Progammieraufgabe bezieht sich auf folgende Lektionen:
es: Este desafío de programación está enlazado a las siguientes lecciones:
fr: Ce défi de programmation est lié aux leçons suivantes :
it: Questa sfida di programmazione è collegata alle seguenti lezioni:
mi: Ka honoa tēnei wero tuhiwaehere ki ngā akoranga e whai ake nei:

source: Challenge %(set_num)s.%(chal_num)s for %(name)s
de: Aufgabe %(set_num)s.%(chal_num)s für %(name)s
es: Desafío %(set_num)s.%(chal_num)s para %(name)s
fr: Défi %(set_num)s.%(chal_num)s pour %(name)s
it: Sfida %(set_num)s.%(chal_num)s per %(name)s
mi: Wero %(set_num)s.%(chal_num)s mō %(name)s

source: %(lower)s to %(upper)s
de: %(lower)s bis %(upper)s
es: %(lower)s a %(upper)s
fr: de %(lower)s à %(upper)s ans
it: Da %(lower)s a %(upper)s
mi: %(lower)s ki %(upper)s

source: Languages
de: Sprachen
es: Idiomas
fr: Langues
it: Linguaggi
mi: Ngā Reo

source: What it should look like
de: Wie es aussehen sollte
es: Cómo debería verse
fr: À quoi cela devrait ressembler
it: Come dovrebbe essere
mi: Me pēhea te āhua

source: Hints
de: Tipps
es: Pistas
fr: Astuces
it: Suggerimenti
mi: Tīwhiri

source: Show %(implementation.language.name)s solution
de: %(implementation.language.name)s-Lösung anzeigen
es: Mostrar la solución %(implementation.language.name)s
fr: Afficher la solution en %(implementation.language.name)s
it: Mostra la soluzione in %(implementation.language.name)s
mi: Whakaatu otinga %(implementation.language.name)s

source: Name
es: Nombre
fr: Nom
it: Nome
mi: Ingoa

source: Challenge Level
de: Schwierigkeitsgrad
es: Nivel del desafío
fr: Niveau de défi
it: Livello di difficoltà
mi: Taumata Wero

source: %(topic.name)s other resources
de: Weitere Ressourcen zu %(topic.name)s
es: Otros recursos para %(topic.name)s
fr: autres ressources %(topic.name)s
it: Altre risorse di %(topic.name)s
mi: he rauemi kē mō %(topic.name)s

source: Other resources
de: Weitere Ressourcen
es: Otros recursos
fr: Autres ressources
it: Altre risorse
mi: He rauemi kē atu

source: Sorry! We couldn't find any information on other resources for this topic.
de: Tut uns leid! Wir konnten keine Infos zu weiteren Ressourcen für dieses Thema finden.
es: ¡Lo sentimos! No pudimos encontrar ninguna información acerca de otros recursos para este tema.
fr: Désolé ! Nous n'avons pas pu trouver d'informations sur d'autres ressources sur ce sujet.
it: Scusa! Non siamo riusciti a trovare alcuna informazione su altre risorse per questo argomento.
mi: Aroha mai! Kāore e kitea te mōhiohiotanga mō rauemi kē atu i tēnei kaupapa.
