Repository: uccser/cs-unplugged
Catalog: csunplugged/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, it, mi

source: The activities are fun and engaging, not just busy-work for the sake of it. Usually the explanations are quite brief – the teacher lays out the materials and a few rules, and the students follow the challenge from there. There are puzzles, challenges, competitions, problem solving and humour. Unplugged activities should leave students with a sense of genuine achievement. There is often a strong sense of story in the activities; problems are presented as part of a story rather than as an abstract mathematical challenge. Children are more interested in pirates than privacy, and absurd fictitious stories can be more memorable than compelling business applications.
de: Die Aktivitäten sind unterhaltsam und interessant, nicht einfach Beschäftigungstherapie um der Beschäftigung willen. Die Erläuterungen sind im Allgemeinen relativ kurz – die Lehrperson legt die Materialien aus und gibt ein paar Regeln bekannt und die Schüler machen sich dann daran, die Aufgabe zu lösen. Es gibt Rätsel, Herausforderungen, Wettbewerbe, Problemlösung und Humor. Unplugged-Aktivitäten sollen Schülern echte Erfolgserlebnisse vermitteln. Die Aktivitäten bringen häufig das Gefühl einer Geschichte mit sich; Aufgabenstellungen werden als Teil einer Geschichte und nicht als abstraktes mathematisches Problem dargestellt. Kinder sind mehr an Piraten als an Datenschutz interessiert und erfundene absurde Geschichten sind oft einprägsamer als kopfzerbrechende Fachapplikationen.
es: Las actividades son divertidas y atractivas, no se trata solo de trabajar porque sí. Generalmente las explicaciones son bastante breves - el profesor expone los materiales y algunas reglas y los alumnos siguen el reto desde ahí. Hay puzles, desafíos, competiciones, resolución de problemas y humor. Las actividades de Unplugged deberían dejar a los alumnos con una sensación de logro genuino. A menudo las actividades tienen una fuerte carga narrativa; los problemas se presentan como parte de la historia en vez de como un reto matemático abstracto. Los niños están más interesados en los piratas que en la privacidad y las absurdas historias ficticias pueden ser más memorables que impresionantes aplicaciones de negocios.
fr: Les activités sont amusantes et attrayantes, et pas simplement du travail pour travailler. Généralement, les explications sont très brèves – le professeur pose le matériel et quelques règles, et les étudiants suivent le défi à partir de là. Il y a des énigmes, des défis, des concours, de la résolution de problème et de l'humour. Les activités Unplugged devraient laisser les élèves avec un véritable sentiment d'accomplissement. Il y a souvent un sens fort du récit dans les activités ; les problèmes sont présentés sous forme d'une histoire plutôt que comme un défi mathématique abstrait. Les enfants sont plus intéressés par les pirates que par la vie privée, et les histoires absurdes et inventées peuvent être plus mémorable que de réels problèmes d'entreprises.
it: Le attività sono divertenti e coinvolgenti, non sono solo lavoro impegnativo fine a se stesso. Di solito le spiegazioni sono piuttosto brevi - l'insegnante espone i materiali e alcune regole, e a quel punto inizia la sfida per gli studenti. Ci sono puzzle, sfide, competizioni, risoluzione di problemi e umorismo. Le attività Unplugged dovrebbero lasciare agli studenti un senso di autentica soddisfazione per il risultato raggiunto. C'è spesso una componente di narrazione nelle attività; i problemi vengono presentati come parte di una storia piuttosto che come una sfida matematica astratta. I bambini sono più interessati ai pirati che alla privacy e le assurde storie di fantasia possono essere ricordate maggiormente di "irresistibili" programmi da ufficio.
mi: He āhuareka, he tākarokaro ēnei ngohe, ehara i te mahi mō te mahi noa. Ko te nuinga o ngā whakamāramatanga he poto - mā te kaiako e whakarite ngā rauemi me ētahi ture ruarua noa iho, ā, mā ngā ākonga e hiki te mānuka. He panga, he wero, he whakataetae, he rapanga hei whakaoti, he mahi whakakatakata. Mā te mahi Unplugged e rongo ai ngā ākonga i te reka o te whakatutukitanga. Ka kitea tonuhia he pakiwaitara i ngā ngohe; ehara i te mea he wero pāngarau waitaratanga noa iho. He pai ake ki ngā tamariki te hunga paireti i te matatapu, ā, ka ngāwari ake te maumahara i te korero paki pōhewahewa i te tauira pakihi ōkawa.

source: No specialised equipment
de: Keine besondere Ausrüstung
es: No hay equipo especializado
fr: Pas d'Équipement Spécial
it: Nessuna attrezzatura specializzata
mi: Kāore he taputapu motuhake

source: The activities are low cost, using equipment commonly found in classrooms or stationery stores. Most require only paper and pencil, and perhaps cards, string, chalk, whiteboard markers, balls or similar items.
de: Die Aktivitäten sind kostengünstig und setzen Gegenstände ein, die für gewöhnlich in Klassenzimmern und Schreibwarenläden anzufinden sind. Für die meisten werden nur Papier und Bleistift benötigt, eventuell auch Karten, Bindfaden, Kreide, Whiteboardstifte, Bälle oder ähnliche Dinge.
es: Las actividades son de bajo costo, usan material comúnmente encontrado en aulas o papelerías. La mayoría solo requieren papel y lápiz, y tal vez cartas, cuerda, tiza, rotuladores de pizarra blanca, pelotas o artículos similares.
fr: Les activités sont de faible coût, en utilisant le matériel couramment trouvé dans les salles de classe ou les papeteries. La plupart demandent du papier et un crayon, et peut-être des cartes, des cordes, de la craie, des marqueurs, des boules ou d'autres éléments similaires.
it: Le attività sono a basso costo, utilizzano materiali comunemente presenti nelle aule o nelle cartolerie. La maggior parte richiede solo carta e penna, e forse carte, corde, gessetti, pennarelli, palline o oggetti simili.
mi: He ngāwari te utu mō ēnei ngohe, ka whakamahia ngā taputapu ka kitea whānuitia i ngā akomanga me ngā toa pukapuka. Mō te nuinga, he pepa, he pene rākau noa iho hoki, he kāri pea, he aho, he tioka, he pene papamā, he pōro, ko ētahi atu mea pērā rānei.

source: Variations encouraged
de: Abwandlungen erwünscht
es: Se fomentan las variaciones
fr: Variantes Encouragées
it: Variazioni incoraggiate
mi: Ka tautokona ngā rerekētanga

source: Unplugged is published under a Creative Commons licence, which permits free sharing (with acknowledgement). Variations, adaptations and extensions are encouraged. This also allows local publishing arrangements to take account of the kind of packaging that would make the material more accessible to local educational practitioners.
de: Unplugged wird unter einer Creative Commons Lizenz veröffentlicht, die das Einräumen von Nutzungsrechten (unter Angabe des Urhebers und der Lizenz) gestattet. Abwandlungen, Anpassungen und Erweiterungen werden befürwortet. So kann auch bei lokalen Nutzungsarrangements die Art der Zusammenstellung berücksichtigt werden, bei der das Material auf lokales Lehrpersonal zugeschnitten werden kann.
es: Unplugged se publica bajo una licencia Creative Commons, que permite la libre compartición (con reconocimiento). Se fomentan las variaciones, adaptaciones y extensiones. Esto también permite acuerdos de publicación locales para tener en cuenta el tipo de embalaje que haría el material más accesible para profesionales locales de la educación.
fr: Unplugged est publié sous une licence Creative Commons, qui permet le libre partage (avec remerciement). Les variations, les adaptations et extensions sont encouragées. Cela permet aussi la modification du matériel utilisé pour mieux tenir compte des disponibilités locales du matériel par les enseignants.
it: Unplugged è pubblicato sotto una licenza Creative Commons, che consente la condivisione gratuita (con attribuzione / riconoscimento dei crediti). Variazioni, adattamenti ed estensioni sono incoraggiati. Ciò consente anche agli editori locali di scegliere la modalità di presentazione che renda il materiale più accessibile agli educatori del territorio.
mi: Kua whakaputaina a Unplugged i raro i tētahi raihana Creative Commons, e whakaaetia ana te tuari utu-kore (me te tuku mihi tohutoro). Ka tautokona te whakarerekē, te whakahāngai hoki ki kaupapa kē, te whakatāpiri hoki. Ka taea tonu te whakaputa i ngā tā ā-rohe kia taea ai te whakahāngai i te takai i ngā rauemi ki ngā hiahia o ngā kaiwhakaako o te rohe.

source: <p> Two specific situations that we get asked about are: </p> <ul> <li> <strong>For-profit classes (e.g. clubs with a subscription fee):</strong> It is fine to charge a fee for people to attend classes that you're running that uses this material. </li> <li> <strong>Selling packs of support material (such as pre-printed cards):</strong> It is fine to do this. We hope that you'll do it for a reasonable price, and it's even better if you can get someone to sponsor you so that you can give it away to educators, but the license allows you to set your own price. </li> </ul>
de: <p> Zwei konkrete Situationen, über die bei uns nachgefragt wird: </p> <ul> <li> <strong>Eigennütziger Unterricht (z. B. Vereine mit Abonnementgebühr):</strong> Es ist völlig in Ordnung, Teilnehmern an von Ihnen abgehaltenen Klassen, in denen dieses Material eingesetzt wird, eine Gebühr zu berechnen. </li> <li> <strong>Verkauf von Lehrmaterialsets (wie beispielsweise vorgedruckte Karten):</strong> Auch das ist in Ordnung. Wir hoffen, dass Sie hierfür einen vernünftigen Preis ansetzen, und es wäre sogar noch besser, wenn Sie einen Sponsor finden würden, sodass Sie das Material kostenlos an Lehrpersonen weitergeben können, die Lizenz gestattet es Ihnen jedoch, Ihren eigenen Preis festzulegen. </li> </ul>
es: <p> Las dos situaciones específicas sobre las que nos suelen preguntar son: </p> <ul> <li> <strong>Clases con fines lucrativos (por ejemplo: clubes con cuota de suscripción):</strong> No pasa nada por cobrar una cuota a las personas que asistan a tus clases en las que usas este material. </li> <li> <strong>Venta de paquetes de material de apoyo (como cartas preimpresas): </strong> No pasa nada por hacer esto. Esperamos que lo hagas a un precio razonable y sería todavía mejor si pudieras conseguir que alguien te patrocine para poder regalar el material a los docentes, pero la licencia te permite marcar tu propio precio. </li> </ul>
fr: <p> Il y a deux situations spécifiques pour lesquelles on nous pose des questions : </p> <ul> <li> <strong>Les cours à but lucratif (par exemple les clubs avec des frais d'inscription) :</strong> Vous pouvez exiger des frais pour les personnes qui assistent aux cours que vous organisez en utilisant nos documents. </li> <li> <strong>Vendre des ensembles de documents de support (comme des cartes pré-imprimées) :</strong> Vous pouvez le faire. Nous espérons que vous le ferez à un prix raisonnable, et c'est encore mieux si vous pouvez trouver quelqu'un pour vous parrainer afin que vous puissiez le donner aux enseignants, mais la licence vous permet de fixer votre propre prix.</li> </ul>
it: <p> Due situazioni specifiche su cui ci vengono fatte domande sono: </p> <ul> <li> <strong>Corsi a pagamento (es. club con una quota di iscrizione):</strong> Va bene far pagare una quota alle persone che frequentano le lezioni in cui usi questo materiale. </li> <li> <strong>Vendita di pacchetti di materiale di supporto (come ad esempio carte prestampate):</strong> Va bene. Speriamo tu lo faccia ad un prezzo ragionevole, e sarebbe ancora meglio se tu riuscissi a convincere qualcuno a sponsorizzarti, in modo che tu possa distribuirlo gratuitamente agli educatori; ad ogni modo la licenza ti permette di fissare liberamente il prezzo. </li> </ul>
mi: <p> E rua ngā pātai auau e uia ai mātou: </p> <ul> <li> <strong>Ngā akomanga moni hua (hei tauira: he karapū e kohi i te utu whakauru):</strong> Kei te pai te kohi utu mō ngā akomanga e whakamahia ana ēnei rauemi. </li> <li>Kei te pai hoki te <strong>hoko atu i ngā rauemi (pērā ki ngā kāri kua tāngia):</strong> Ko tō mātou tūmanako kia ngāwari te utu, ā, he pai ake hoki te kimi kaitautoko māna e utu, kia taea ai te hoatu ngā rauemi mō te utu-kore, engari, e ai ki te raihana māu anō e whakatau te utu mō ngā rauemi ka hokona atu.</li> </ul>

source: For everyone
de: Für alle
es: Para todos
fr: Ouvert à tous
it: Per tutti
mi: Mā te katoa

source: The programme is strongly international – we encourage variations that are relevant to local cultures (for example, some activities that require a large playground can be changed to a board game for schools that have very little open space; others use contexts that might not be familiar to students in a different culture). Translators should try the activities locally and involve teachers. It is better to adapt activities rather than translate them faithfully to something that would be less meaningful in the local culture. The activities are intended to be inclusive.
de: Das Programm ist ausdrücklich international – wir regen dazu an, für lokale Gegebenheiten relevante Abwandlungen vorzunehmen (beispielsweise können Aktivitäten, die einen großen Spielplatz erfordern, für Schulen mit eingeschränkter Außenfläche in ein Brettspiel umgewandelt werden; andere Aktivitäten wiederum setzen möglicherweise Zusammenhänge ein, mit denen Schüler in einer anderen Kultur nicht vertraut sein mögen). Übersetzer sollten die Aktivitäten unter Heranziehung von Lehrpersonen im jeweiligen Land ausprobieren. Es ist besser, Aktivitäten anzupassen, als sie wortgetreu als etwas wiederzugeben, das in der lokalen Kultur wenig Sinn ergibt. Die Aktivitäten sollen integrativ sein.
es: El programa es fuertemente internacional - fomentamos las variaciones que sean relevantes para las culturas locales (por ejemplo, algunas actividades que requieran un patio grande se pueden cambiar a un juego de mesa para las escuelas que tengan poco espacio abierto; otras utilizan contextos que pueden no resultar familiares para los alumnos en una cultura diferente). Los traductores deberían probar las actividades de forma local e involucrar a los maestros. Es mejor adaptar las actividades que traducirlas fielmente a algo que puede ser menos significativo en la cultura local. Las actividades están destinadas a ser inclusivas.
fr: Le programme est fortement international – nous encourageons les variantes qui sont pertinentes pour les cultures locales (par exemple, certaines activités qui nécessitent un grand terrain de jeu peut être changé par un jeu de plateau pour les écoles qui ont très peu d'espace ; d'autres activités utilisent des contextes qui pourraient ne pas être familier aux élèves d'une culture différente). Les traducteurs devraient essayer les activités localement et impliquer les enseignants. Il est préférable d'adapter les activités plutôt que de les traduire fidèlement pour obtenir quelque chose qui aurait moins de sens dans la culture locale. Les activités sont destinées à être inclusives.
it: Il materiale è fortemente internazionale - incoraggiamo le variazioni rilevanti per le culture locali (ad esempio, alcune attività che richiedono un grande cortile possono essere trasformate in un gioco da tavolo per scuole che hanno pochissimo spazio aperto; altre usano contesti che potrebbero non essere familiari agli studenti di una cultura diversa). I traduttori dovrebbero testare le attività a livello locale e coinvolgere gli insegnanti. È meglio adattare le attività piuttosto che tradurle alla lettera ma in un modo che sarebbe meno significativo nella cultura locale. Le attività sono pensate per essere il più possibile inclusive.
mi: He kaupapa mō ngā whenua katoa o te ao tēnei - ka tautoko mātou i te hanga i ngā whakarerekētanga kia hāngai ki ngā tikanga o tēnā, o tēnā o ngā iwi (hei tauira, mō ētahi o ngā mahi e whakamahi ana i te papa tākaro nui, ka taea hoki te mahi hei kēmū poari mēnā kāore i te nui te papa tākaro o te kura; mō ētahi atu o ngā ngohe, ka kitea he horopaki kāore i te tino mōhiotia e ngā ākonga o ngā iwi kē). Mā ngā tāngata e whakawhiti ana i ngā reo o ngā ngohe hei rapu i ngā horopaki, me ngā kaupapa e tika ana mō ō rātou ake iwi. Ko te tino tūmanako kia taea te uru ngā tāngata ki ēnei akoranga ahakoa ko wai .

source: Co-operative
de: Gegenseitig förderlich
es: Cooperativo
fr: Coopératif
it: Cooperazione
mi: Mahi tahi

source: We encourage co-operation, communication and problem solving. Competition can also be effective if it is used appropriately, especially between teams rather than individuals, but having students working cooperatively is a great way to learn about problem solving.
de: Wir regen Kooperation, Kommunikation und Problemlösung an. Auch Wetteifer kann wirkungsvoll sein, wenn er auf geeignete Weise eingesetzt wird, insbesondere zwischen Teams und nicht zwischen Einzelpersonen. Wenn Schüler partnerschaftlich zusammenarbeiten, erhalten sie eine ausgezeichnete Möglichkeit zu lernen, wie Probleme gelöst werden können.
es: Fomentamos la cooperación, la comunicación y la resolución de problemas. La competencia también puede ser efectiva si se usa de forma apropiada, especialmente entre equipos más que entre individuos, pero que los alumnos trabajen conjuntamente es una buena manera de aprender acerca de la resolución de problemas.
fr: Nous encourageons la coopération, la communication et la résolution de problème. La compétition peut également être efficace si elle est utilisée de manière appropriée, en particulier entre des équipes plutôt que des individus, mais avoir des élèves qui travaillent en collaboration est un excellent moyen d'apprendre à résoudre des problèmes.
it: Incoraggiamo la cooperazione, la comunicazione e la risoluzione dei problemi. Anche la competizione può essere efficace se viene utilizzata in modo appropriato, in particolare tra squadre e non tra individui, ma lavorare in modo cooperativo è un ottimo modo per imparare a risolvere i problemi.
mi: He kaupapa nui ki a mātou, te mahi tahi, te whakawhitiwhiti whakaaro hoki, te whakaoti rapanga hoki. He pai hoki te whakataetae, ina e tika ana, he pai ake ngā tīma i te tangata takitahi. Heoi anō ko te mahi tahi, ko te tautoko tētahi o ngā ara tino pai hei ako i te whakaoti rapanga.

source: Stand-alone Activities
de: Eigenständige Aktivitäten
es: Actividades independientes
fr: Activités Indépendantes
it: Attività autocontenute
mi: He Ngohe Motuhake

source: As much as possible, the activities are stand-alone modules that can be used independently of each other, so that they can be used for enrichment in curricula or for outreach on their own rather than having to be used as a series. The ones that have been presented as lesson plans will sometimes require a series of lessons to be followed, but we will indicate if particular preparation is required.
de: Die Aktivitäten wurden soweit möglich als eigenständige Module ausgelegt, die unabhängig voneinander eingesetzt werden können, sodass sie jeweils für sich zur Bereicherung von Unterrichts- oder Entwicklungsprogrammen herangezogen werden können und nicht als Serie herangezogen werden müssen. Manche der im Rahmen eines Unterrichtsplans dargelegten Aktivitäten erfordern ggf. eine Serie an Lektionen, wir weisen jedoch jeweils darauf hin, wenn besondere Vorbereitungen erforderlich sind.
es: En la medida de lo posible, las actividades son módulos independientes que se pueden usar por separado unos de otros, para que se puedan utilizar para el enriquecimiento de los planes de estudio o para la divulgación por sí mismos en lugar de tener que ser utilizados como parte de una serie. Los que se han presentado como planes de clases algunas veces requerirán una serie de lecciones después, pero te indicaremos si se requiere una preparación particular.
fr: Dans la mesure du possible, les activités sont des modules distincts qui peuvent être utilisées indépendamment les unes des autres. afin qu'elles puissent être utilisées comme enrichissement dans les programmes scolaires ou pour des activités de sensibilisation par elles-mêmes, plutôt que d'être utilisées au sein d'une série. Ceux qui ont été présentés comme plans de cours nécessiteront parfois une série de leçons à suivre, mais nous indiquerons si une préparation particulière est nécessaire.
it: Per quanto possibile, le attività sono moduli autocontenuti che possono essere utilizzati indipendentemente l'uno dall'altro, in modo che possano essere utilizzati per approfondimenti nei curricoli o singolarmente per la divulgazione, piuttosto che dover essere utilizzate in sequenza. Quelle che sono state presentati come piani di lezioni, a volte richiedono una specifica sequenza di lezioni da seguire, ma indicheremo se è necessaria una particolare preparazione.
mi: Ki ōna e taea ana, ka āhei te tū tahanga ia ngohe kia whakamahia hei ngohe motuhake, kia taea ai te whakauru hei ngohe tautoko mō ngā kōwae ako, me ngā marau, me te whakamahi ahakoa kāore i te mahia te katoa o ngā ngohe. Ko ētahi o ngā rauemi he mahere akoranga, heoi anō, ka whakamōhio atu mātou mehemea he whakaritenga hei mahi kia pai ai te raupapa o ngā mahi.

source: Resilient
de: Anpassungsfähig
es: Flexible
fr: Robuste
it: Resilienza delle attività
mi: Aumangea
