Repository: uccser/cs-unplugged
Catalog: csunplugged/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, it, mi

source: The primary goal of the Unplugged project is to promote Computer Science (and computing in general) to young people as an interesting, engaging, and intellectually stimulating discipline. We want to capture people’s imagination and address common misconceptions about what it means to be a computer scientist. We want to convey fundamentals that do not depend on particular software or systems, ideas that will still be fresh in 10 years. We want to reach kids in elementary schools and provide supplementary material for university courses. We want to tread where high-tech educational solutions are infeasible; to cross the divide between the information-rich and information-poor, between industrialized countries and the developing world.
de: Das Hauptziel des Unplugged-Projekts besteht darin, jungen Menschen Informatik (und Computing im Allgemeinen) als interessantes, faszinierendes und intellektuell anregendes Wissensgebiet näherzubringen. Wir wollen die Fantasie der Menschen anregen und auf verbreitete falsche Vorstellungen eingehen, was es bedeutet, Informatiker zu sein. Wir wollen Grundlagen vermitteln, die nicht von einer bestimmten Software oder bestimmten Systemen abhängen; Ideen, die auch in zehn Jahren noch frisch im Gedächtnis sind. Wir wollen Kinder in Grundschulen erreichen und Zusatzmaterial für Hochschulkurse bieten. Wir wollen uns auf Pfade begeben, auf denen hochtechnologische Bildungskonzepte nicht praktikabel sind, um die Kluft zwischen informationsreichen und informationsarmen Menschen und zwischen Industrieländern und Entwicklungsländern zu überbrücken.
es: El objetivo principal del proyecto Unplugged es promocionar la Informática (y la computación en general) entre los jóvenes como una disciplina interesante, fascinante e intelectualmente estimulante. Queremos captar la imaginación de las personas y abordar conceptos erróneos comunes acerca de lo que significa ser informático. Queremos transmitir los principios básicos que no dependen de sistemas o programas en particular, ideas que seguirán estando vigentes en 10 años. Queremos llegar a los niños en escuelas primarias y proporcionar material de apoyo para cursos universitarios. Queremos dejar huella donde las soluciones educativas de alta tecnología no son factibles; cruzar la brecha entre los que son ricos en información y los que no, entre los países industrializados y el mundo en desarrollo.
fr: L'objectif principal du projet Unplugged est de promouvoir la science informatique (et l'informatique en général) auprès des jeunes en tant que discipline intéressante, attirante et stimulante sur le plan intellectuel. Nous voulons captiver l'imagination des gens et nous attaquer aux fausses idées courantes sur ce que signifie être un informaticien. Nous voulons transmettre des idées fondamentales qui ne dépendent pas d'un logiciel ou d'un système particulier, des idées qui seront encore d'actualité dans 10 ans. Nous voulons atteindre les enfants des écoles primaires et fournir des documents supplémentaires pour les cours universitaires. Nous voulons aller là où les solutions éducatives de haute technologie sont infaisables ; combler le fossé entre les riches et les pauvres en information, entre les pays industrialisés et le monde en développement.
it: L'obiettivo principale del progetto CS Unplugged è promuovere l'Informatica ai giovani come una disciplina interessante, coinvolgente e intellettualmente stimolante. Vogliamo catturare la fantasia delle persone e occuparci delle idee sbagliate comunemente associate a cosa significhi essere un informatico. Vogliamo trasmettere concetti fondamentali che non dipendono da un particolare programma o sistema, idee che saranno ancora valide in 10 anni. Vogliamo raggiungere i bambini delle scuole primarie e fornire materiale supplementare per corsi universitari. Vogliamo arrivare dove soluzioni educative high-tech sono infattibili; vogliamo tagliare il divario tra coloro che sono ricchi di informazioni e coloro che ne sono poveri, tra paesi industrializzati e paesi in via di sviluppo.
mi: Ko te whāinga tuatahi mō Unplugged ko te toko ake i te Pūtaiao Rorohiko (me ngā mahi rorohiko whānui) ki te hunga taiohi hei mahi pārekareka, whakaihiihi hoki, whakahihiko hoki i te mahara o te tangata. Ka hiahia mātou ki te hāpai ake i te auahatanga o te tangata me te whakatika i ngā pōhēhētanga mō te mahi a te kaipūtaiao rorohiko. Ka hiahia hoki mātou ki te tuku mōhiotanga kāore i te herea ki ngā momo taupānga me ngā momo pūnaha matihiko o ēnei rā. Ko te tūmanako ka pai tonu ngā ariā me ngā mahi ā ngā tau 10 e heke mai nei. Ka hiahia mātou ki te toro atu ki ngā tamariki o ngā kura tuatahi me te tuku rauemi tāpiri ki ngā akomanga whare wānanga hoki. E kimi hoki ana mātou i ngā ara pai mō ngā wāhi kāore e taea te whakamahi i ngā hangarau nui o te ao; ki te whakawhiti i te āpiti i waenga i te hunga whai rawa me te hunga pōhara o te ao mōhiohio, i ngā whenua ahumahi me ngā whenua kei te whanake tonu.

source: There are many worthy projects for promoting Computer Science. The main principles that distinguish the Unplugged activities are:
de: Es gibt viele wertvolle Projekte zur Förderung von Informatik. Die wichtigsten Grundsätze, durch die sich die Unplugged-Aktivitäten von anderen abheben, sind:
es: Hay muchos proyectos valiosos que promueven la informática. Los principios fundamentales que distinguen a las actividades de Unplugged son:
fr: Il y a beaucoup de projets dignes d'intérêt pour la promotion de l'Informatique. Les principes fondamentaux qui permettent de distinguer les activités Unplugged sont :
it: Ci sono molti progetti di valore per la promozione dell'Informatica. I principi fondamentali che distinguono le attività Unplugged sono:
mi: He maha ngā kaupapa whaitake mō te whakanui i te Pūtaiao Rorohiko. Heoi anō, ko ngā mātāpono matua e noho motuhake ai ngā ngohe Unplugged:

source: No Computers Required
de: Keine Computer erforderlich
es: No se requieren ordenadores
fr: Aucun Ordinateur Requis
it: Nessun computer richiesto
mi: Kāore he Herenga Rorohiko

source: The activities do not depend on computers. This avoids confusing Computer Science with programming or learning application software, makes the activities available to those who aren’t able to or don’t want to work with computers, and skips the barrier of learning to program before being able to explore ideas. It also provides physical, kinaesthetic experiences as part of learning computing, which can be a welcome break from sitting in front of a screen. For example, the parity magic trick is a card game that happens to use the same principle as error correction in computer memory. Unplugged isn’t a completely Luddite approach – we do exploit the internet and other computing facilities to share and develop the activities, and we hope that students will have to opportunity to learn to program so that they can put wheels on the ideas they have been exploring.
de: Die Aktivitäten sind nicht von Computern abhängig. Dies verhindert, dass Informatik mit dem Programmieren oder Erlernen von Anwendungssoftware verwechselt wird, macht die Aktivitäten all denjenigen zugänglich, die nicht mit Computern arbeiten können oder wollen, und umgeht die Hürde, Programmieren zu lernen, ohne zuvor eigene Ideen erkunden zu können. Zudem wird im Zuge des Lernens von Computing für körperliche und kinästhetisch Erlebnisse gesorgt, die eine willkommene Abwechslung vom Sitzen vor einem Bildschirm bieten können. Zum Beispiel ist der Paritäts-Zaubertrick ein Kartenspiel, das zufällig dieselben Grundsätze anwendet wie die Fehlerkorrektur im Arbeitsspeicher von Computern. Unplugged stellt keine völlige Verteufelung von Technologie dar – wir machen uns durchaus das Internet und andere Informatikeinrichtungen zunutze, um die Aktivitäten zu entwickeln und bereitzustellen. Und wir hoffen, dass Schüler Gelegenheit haben werden, Programmieren zu lernen, sodass sie die von ihnen erkundeten Ideen umsetzen können.
es: Las actividades no dependen del uso de ordenadores. De esta forma se evita la confusión entre la informática y la programación o el aprendizaje de programas de aplicaciones, hace que las actividades estén disponibles para aquellos que no puedan o no quieran trabajar con ordenadores y se salta la barrera de aprender a programar antes de ser capaz de explorar ideas. También proporciona experiencias físicas y cenestésicas como parte del aprendizaje informático, lo que supone un bienvenido descanso a estar sentado delante de una pantalla. Por ejemplo, el truco de magia de paridad es un juego de cartas que usa el mismo principio que la corrección de errores en la memoria de un ordenador. Unplugged no se basa en un enfoque completamente ludita - nosotros aprovechamos internet y otras instalaciones informáticas para compartir y desarrollar las actividades y esperamos que los alumnos tengan la oportunidad de aprender a programar y así puedan ponerle ruedas a las ideas que han estado explorando.
fr: Les activités ne dépendent pas des ordinateurs. Cela évite la confusion entre l'Informatique et les logiciels de programmation ou d'apprentissage, met les activités à disposition de ceux qui ne peuvent pas ou ne veulent pas travailler avec les ordinateurs, et saute la barrière de l'apprentissage de la programmation avant de pouvoir explorer des idées. Les activités fournissent également des expériences physiques, kinesthésiques dans le cadre de l'apprentissage de l'informatique, ce qui peut être une pause bienvenue à l'écart des écrans. Par exemple, le tour de magie sur la parité est un jeu de cartes qui utilise le même principe que la correction d'erreur dans la mémoire d'un ordinateur. Unplugged n’est pas une approche totalement Luddite – nous exploitons l’internet et d’autres outils informatiques pour partager et développer les activités, et nous espérons que les élèves auront la possibilité d'apprendre à programmer afin qu'ils puissent tirer le meilleur des idées qu'ils ont explorées.
it: Le attività non necessitano di computer. Questo evita di confondere l'Informatica con la programmazione o l'apprendimento dell'uso di applicativi, rende le attività disponibili a coloro che non sono in grado o non vogliono lavorare con i computer, e abbatte la barriera del dover imparare a programmare prima di essere in grado di esplorare le idee della disciplina. Fornisce anche esperienze fisiche, cinestetiche come parte dell'apprendimento dell'Informatica, che può essere una piacevole pausa dallo stare seduti di fronte a uno schermo. Ad esempio, la "magia delle carte girate" è un gioco di carte che usa lo stesso principio della correzione degli errori nella memoria dei computer. Unplugged non è un approccio completamente luddista - sfruttiamo Internet e altre strumentazioni informatiche per condividere e sviluppare le attività, e speriamo che gli studenti abbiano l'opportunità di imparare a programmare in modo da poter far decollare le idee che hanno esplorato.
mi: Kāore he herenga o ēnei ngohe ki te rorohiko. Nā reira, ka kore e pōhēhētia he ōrite te Pūtaiao Rorohiko ki te tuhiwaehere, ki te ako i ngā taupānga rānei. Ka taea hoki ēnei mahi e te tangata rorohiko kore, kāore e hiahia rānei ki te mahi rorohiko, ā, ka karo hoki ēnei i te mahi nui ki te ako i te tuhiwaehere i mua i te toro atu ki ngā ariā. Ka āhei te ako rorohiko mā ngā mahi ā-tinana. Ko te tūmanako, he whakangā pai ēnei i te noho noa ki mua tonu i te mata o te rorohiko. Ko te mahi Kāri Ōritetanga tētahi tauira o te kēmu kāri e whakamahi ana i ngā mātāpono ōrite ki te tukanga whakatika i ngā hapa o te mahara rorohiko. Ehara i te mea he mahi ēnei nō te ao kōhatu (Luddite), kei te whakamahi mātou i te ipurangi me ngā pūnaha rorohiko ki te hanga me te tuari i ngā rauemi. Ko te tūmanako hoki ka ako ngā ākonga ki te tuhiwaehere kia taea ai e rātou te tāpiri i ngā wīra ki ō rātou waka akoranga.

source: Real Computer Science
de: Echte Informatik
es: Informática real
fr: Informatique Réelle
it: Vera Informatica
mi: Te Tino Pūtaiao Rorohiko

source: Unplugged presents fundamental concepts in Computer Science such as algorithms, artificial intelligence, graphics, information theory, human computer interfaces, programming languages, and so on. We want to emphasize that programming is a means, not an end. Wikipedia provides a definition of Computer Science, and Peter Denning’s Great Principles project provides a more detailed analysis of the topics it covers.
de: Unplugged veranschaulicht grundlegende Konzepte der Informatik wie Algorithmen, künstliche Intelligenz, Informationstheorie, menschliche Computerschnittstellen, Programmiersprachen usw. Wir möchten zur Geltung bringen, dass Programmieren nur ein Mittel zum Erreichen des Endzwecks ist. Auf Wikipedia ist eine Definition von Informatik zu finden und Peter Dennings Buch „Great Principles of Computing“ bietet eine noch detaillierte Analyse der darin behandelten Themen.
es: Unplugged presenta conceptos fundamentales en informática como algoritmos, inteligencia artificial, gráficos, teoría de la información, interfaces persona-ordenador, lenguajes de programación, etc. Queremos enfatizar que la programación es un medio, no un fin. Wikipedia ofrece una definición de la informática y el proyecto "Grandes principios de la computación" de Peter Denning proporciona un análisis más detallado de los temas que abarca.
fr: Unplugged présente les concepts fondamentaux de l'Informatique tels que les algorithmes, l'intelligence artificielle, les graphiques, la théorie de l'information, les interfaces homme-machine, les langages de programmation, etc. Nous voulons mettre l'accent sur le fait que la programmation est un moyen, pas une fin. Wikipedia fournit une définition de l'Informatique, et le projet de Peter Denning "Great Principles" fournit une analyse plus détaillée des sujets qu'elle couvre.
it: CS Unplugged presenta concetti fondamentali di Informatica come algoritmi, intelligenza artificiale, grafica, teoria dell'informazione, interazione persona-computer, linguaggi di programmazione e così via. Vogliamo sottolineare che la programmazione è un mezzo, non un fine. Su Wikipedia puoi trovare una definizione di Informatica, e il progetto Great Principles di Peter Denning fornisce un'analisi più dettagliata degli argomenti che l'Informatica copre.
mi: Kei Unplugged, ka whakaaturia ngā ariā nūnui mō te Pūtaiao Rorohiko, pērā ki ngā hātepe, te ihumanea ā-hangarau, te whakaairoiro, te ariā mōhiohio, te atanga tangata me te rorohiko, ngā reo tuhiwaehere, te aha noa hoki. Ko te mea nui ki a mātou, he ara te tuhiwaehere, ehara i te otinga. Kei a Wikipedia he whakamārama mō te Computer Science (pūtaiao rorohiko), ā, kei te kaupapa o Peter Dennings Great Principles tētahi whakamārama hōhonu mō ngā kaupapa ka kōrerotia.

source: Learning by doing
de: Übung macht den Meister
es: Aprender haciendo
fr: L'Apprentissage par la Pratique
it: Imparare facendo
mi: Te ako mā te mahi

source: The activities tend to be kinaesthetic, often on a large scale and involving team work. For example, the Sorting Network activity has teams of six running through a network drawn on the ground. The activities tend to allow students to discover answers for themselves, rather than just being given solutions or algorithms to follow; that is, a constructivist approach is encouraged (where the teacher uses the scaffolding provided by Unplugged to ask questions that lead them to discover the knowledge themselves), as we want students to realize that they are capable of finding solutions to problems on their own, rather than being given a solution to apply to the problem. For example, students don’t really need to be able to convert numbers to binary, but it is valuable for them to discover the patterns such as the doubling value of bits, patterns when you count in binary, and how the range increases exponentially as you add bits.
de: Die Aktivitäten sind kinästhetisch angelegt, oftmals auf einen großen Maßstab ausgerichtet und erfordern Teamarbeit. Beispielsweise führt die Aktivität zum Thema Sortiernetzwerke dazu, dass Sechser-Teams durch ein auf den Boden gezeichnetes Netzwerk rennen. Diese Aktivitäten geben Schülern eher die Möglichkeit, Antworten selbst herauszufinden, als wenn sie einfach nur Lösungen oder zu befolgende Algorithmen vorgesetzt erhalten. Das heißt, es wird zu einer konstruktivistischen Vorgehensweise angeregt (bei der Lehrer anhand der von Unplugged bereitgestellte Arbeitsmaterialien Fragen stellen, die Schülern den Weg weisen, diese Kenntnisse selbst zu gewinnen), da wir Schülern die Erkenntnis an die Hand geben möchten, dass sie dazu fähig sind, Lösungen zu Aufgabenstellungen selbst herauszufinden, anstatt eine Lösung zur Anwendung auf das Problem zu erhalten. Zum Beispiel müssen Schüler nicht unbedingt in der Lage sein, normale Zahlen in Binärzahlen umzuwandeln, es ist jedoch wertvoll für sie, die zugrundeliegenden Muster zu erkennen, wie etwa den verdoppelnden Wert von Bits, beim binären Zählen gegebene Muster und wie sich der Bereich beim Hinzufügen von Bits exponentiell erhöht.
es: Las actividades tienden a ser cenestésicas, a menudo a gran escala e implican trabajo en equipo. Por ejemplo, la actividad de la red de ordenamiento consiste en que varios equipos de seis corran a través de una red dibujada en el suelo. Las actividades tienden a permitir que los alumnos descubran las respuestas por sí mismos, en lugar de darles soluciones o algoritmos que seguir; es decir, se fomenta un enfoque constructivista (donde el profesor usa el andamiaje que ofrece Unplugged para hacer preguntas que llevan a los alumnos a descubrir el conocimiento por sí mismos), ya que queremos que los alumnos se den cuenta de que son capaces de encontrar soluciones a los problemas por su cuenta, en vez de darles una solución para aplicar al problema. Por ejemplo, los alumnos en realidad no necesitan ser capaces de convertir números a binario, pero a ellos les resulta valioso descubrir patrones como la duplicación del valor de los bits, los patrones de conteo en binario y cómo aumenta el rango exponencialmente a medida que se añaden bits.
fr: Les activités tendent à être kinesthésiques, souvent à grande échelle et impliquant un travail d'équipe. Par exemple, l'activité du Réseau de Tri a des équipes de six personnes qui passent par un réseau dessiné sur le sol. Les activités ont tendance à permettre aux élèves de découvrir des réponses par eux-mêmes, plutôt que de se contenter de leur donner des solutions ou des algorithmes à suivre; c'est-à-dire qu'une approche constructiviste est encouragée (où l'enseignant utilise les échafaudages fournis par Unplugged pour poser des questions qui les conduisent à découvrir eux-mêmes les connaissances), car nous voulons que les élèves réalisent qu'ils sont capables de trouver des solutions aux problèmes tout seuls, plutôt que de leur donner une solution à appliquer au problème. Par exemple, les élèves n’ont pas vraiment besoin de savoir convertir des nombres en binaire, mais il est utile pour eux de découvrir les motifs tels que le doublement de la valeur des bits, les modèles quand vous comptez en binaire, et la façon dont la fourchette de nombres possibles augmente exponentiellement au fur et à mesure que vous ajoutez des bits.
it: Le attività tendono ad essere cinestesiche, spesso su larga scala, e necessitano del lavoro di squadra. Ad esempio, l'attività delle reti di ordinamento prevede squadre di sei studenti che attraversano una rete disegnata sul pavimento. Le attività tendono a lasciare che siano gli studenti a scoprire le risposte essi stessi, piuttosto che ricevere soluzioni o algoritmi già pronti da seguire; ovvero, viene incoraggiato un approccio costruttivista (in cui l'insegnante utilizza lo "scaffolding" fornito da CS Unplugged per porre domande che portano gli studenti a scoprire da soli le conoscenze), poiché vogliamo che gli studenti si rendano conto di essere in grado di trovare per conto proprio soluzioni ai problemi, piuttosto che ricevere una soluzione da applicare al problema. Ad esempio, gli studenti non hanno realmente bisogno di essere in grado di sapere come convertire i numeri in binario, ma è importante per loro scoprire schemi ricorrenti, come ad esempio rendersi conto che il valore di un numero binario raddoppia se aggiungo un bit 0, trovare schemi ricorrenti quando si conta in binario e scoprire che l'intervallo rappresentabile aumenta esponenzialmente con l'aggiunta di bit.
mi: Ko te nuinga o ngā ngohe, he mahi ā-tinana, he whārahi ētahi, he mahi ā-rōpū hoki. Hei tauira, mō te ngohe Whatunga Kōmaka, ka nekeneke ngā tīma - tokoono ngā tāngata kei ia tīma - i runga i te whatunga ka tuhia i runga i te papa. Ko te tikanga, ka tūhurahia ngā otinga e ngā ākonga anō, kāore e tukuna noatia ngā otinga, ngā hātepe rānei kia whāia; arā, kia ako ngā ākonga mā te waihanga i te whakaaro (ka whakamahi te kaiako i ngā rauemi o Unplugged, hei tautoko i a ia ki te hanga pātai, hei ārahi i ngā ākonga ki te tūhura i ngā mōhiotanga mō rātou anō) kia mōhio ai rātou, ka taea e rātou anō te rapu otinga, rapanga rānei, kia kaua rātou e tatari mā tētahi atu e hoatu te otinga. Hei tauira, ehara i te mea, me mātua mōhio ngā ākonga ki te panoni i ngā nama ki te tāhūrua, engari he pai kia mārama rātou ki ngā āhuatanga pērā ki te pūrua o ngā uara o ngā moka, ngā tauira ka puta ina kaute ā-tāhūrua, ā, ka tipu taupūtanga te whānui ina tāpiritia he moka anō.

source: Fun
de: Freude am Lernen
es: Diversión
fr: Amusement
it: Divertimento
mi: Whakakoakoa
