Repository: uccser/cs-unplugged
Catalog: csunplugged/locale/*/LC_MESSAGES/django.po
Languages: de, es, fr, it, mi

source: Include teacher guide sheet
de: Lehrerleitfaden beinhalten
es: Incluir la hoja guía del profesor
fr: Inclure la fiche de guide pour l'enseignant
it: Includi guida per insegnanti
mi: Whakauru i te pepa ārahi mā te kaiako

source: Add list of numbers below:
de: Zahlenliste hier eintragen:
es: Añade la lista de números a continuación:
fr: Ajoutez la liste des numéros ci-dessous :
it: Aggiungi una sequenza di numeri qui sotto:
mi: Whakaurua he rārangi nama ki raro nei:

source: Teacher guide sheet for binary search activity
de: Lehrerleitfaden für binäre Suchaktivität
es: Hoja guía del profesor para la actividad de búsqueda binaria
fr: Guide de l'enseignant pour l'activité de recherche dichotomique
it: Guida per l'insegnante per l'attività: ricerca binaria
mi: Pepa ārahi mā te kaiako mō te ngohe rapu ā-tāhūrua

source: Use this sheet to circle the number you are asking your class to look for when you are demonstrating how the binary search works. This allows you to demonstrate the maximum number of searches it would take. When students are playing the number hunt game, they can choose any number. Avoid those numbers that are underlined as they are key binary search positions (avoiding them is a good thing to do for demonstrations, but in practice students, or computers, won’t intentionally avoid these).
de: Kreisen Sie auf diesem Blatt die Zahl ein, die Sie Ihrer Klasse zur Aufgabe stellen, wenn Sie demonstrieren, wie die binäre Suche funktioniert. So lässt sich aufzeigen, wie viele Suchen höchstens benötigt würden. Beim Zahlensuchspiel können Schüler eine beliebige Zahl wählen. Vermeiden Sie unterstrichene Zahlen, da diese wichtige binäre Suchpositionen darstellen (für Demonstrationszwecke ist es besser, sie zu vermeiden, in der Praxis werden Schüler oder Computer diese Zahlen jedoch nicht absichtlich vermeiden).
es: Usa esta hoja para dibujar un círculo alrededor del número que deberá buscar la clase durante la demostración del funcionamiento de la búsqueda binaria. Esto te permite demostrar el número máximo de búsquedas que harían falta. Cuando los alumnos jueguen a la caza de números, pueden elegir cualquier número. Evita los números subrayados ya que ocupan posiciones clave en la búsqueda binaria (en las demostraciones resulta útil evitarlos, pero en la práctica ni los alumnos ni los ordenadores los evitarán de forma intencionada).
fr: Utilisez cette feuille pour entourer le nombre que vous demandez à votre classe de chercher quand vous montrez comment fonctionne la recherche dichotomique. Cela vous permet de montrer le nombre maximum de recherches qu'elle prendra. Lorsque les étudiants jouent au jeu de la chasse aux numéros, ils peuvent choisir n'importe quel nombre. Évitez les numéros qui sont soulignés parce qu'ils sont sur des positions de recherche dichotomique clés (il est préférable de les éviter pour les démonstrations, mais en pratique les étudiants ou les ordinateurs ne les éviteront pas intentionnellement).
it: Usa questo foglio per cerchiare il numero che stai chiedendo alla classe di trovare mentre stai mostrando come funziona la ricerca binaria. Questo ti permette di mostrare il massimo numero di tentativi che servirebbero. Quando gli studenti stanno giocando alla "caccia al numero", possono scegliere qualsiasi numero. Evita i numeri che sono sottolineati, perché sono posizioni chiave nella ricerca binaria (evitarli è una buona idea durante le dimostrazioni, ma nella pratica gli studenti - o i computer - non li eviteranno di proposito).
mi: Whakamahia tēnei pepa kia porowhitangia te nama ka rapua e tō akomanga, i tō mahi whakamārama atu ki a rātou i ngā tikanga o te rapu tāhūrua. Mā tēnei e mōhio ai rātou ko tēnei te mōrahi o ngā rapunga kia mahia. Ka taea e ngā ākonga te kōwhiri i ō rātou ake nama i a rātou e tākaro ana i te kēmu rapurapu. Engari, i a koe e mahi ana, kaua e whakamahi i ngā nama kua tārarotia, nā te mea he kī ērā mō te rapu tāhūrua (ko te whakamahi kore i aua nama tētahi tikanga pai mō te whakaaturanga, engari tūturu e kore te ākonga, te rorohiko rānei, e āta kōwhiri kia kaua e whakamahi i ērā nama).

source: Sorted numbers
de: Sortierte Zahlen
es: Números ordenados
fr: Numéros triés
it: Numeri ordinati
mi: Nama kua māhititia

source: with helper sheet
de: mit Hinweisblatt
es: con hoja de ayuda
fr: avec la feuille d'aide
it: con foglio di supporto
mi: me tētahi whārangi āwhina

source: without helper sheet
de: ohne Hinweisblatt
es: sin hoja de ayuda
fr: sans la feuille d'aide
it: senza foglio di supporto
mi: kāore he whārangi āwhina

source: {} cards
de: {} Karten
es: {} cartas
fr: {} cartes
it: {} carte
mi: kāri {}

source: Small numbers (1 to 10)
de: Kleine Zahlen (1 bis 10)
es: Números pequeños (del 1 al 10)
fr: Petits nombres (1 à 10)
it: Numeri piccoli (da 1 a 10)
mi: He nama iti (1 ki te 10)

source: Large numbers (7 digit numbers)
de: Große Zahlen (7-stellige Zahlen)
es: Números grandes (números de 7 dígitos)
fr: Grands nombres (nombres à 7 chiffres)
it: Numeri grandi (numeri a 7 cifre)
mi: Nama nui (e 7 ngā mati)

source: Letters
de: Buchstaben
es: Letras
fr: Lettres
it: Lettere
mi: Reta

source: Words
de: Wörter
es: Palabras
fr: Mots
it: Parole
mi: Kupu

source: crocodile,crochet,kiwi,weka,kiwi,kiwano
de: Krokodil,Kiwi,Kolibri,Wikinger,Kastanie,Kiel
es: kilo,abrigo,castaña,castañuela,cama,camión
fr: crocodile, crochet, vers, verre, vert, vair
it: Apelle,Apollo,palla,pelle,palla,pollo
mi: mātou,matau,matua,pukamata,inati,nāhau,mōhou

source: Fractions
de: Bruchzahlen
es: Fracciones
it: Frazioni
mi: Hautau

source: Butterfly life cycle
de: Schmetterlingslebenszyklus
es: Ciclo vital de la mariposa
fr: Cycle de vie du papillon
it: Ciclo vitale della farfalla
mi: Te hurihanga ora o te pūrerehua

source: Little Red Riding Hood
de: Rotkäppchen
es: Caperucita Roja
fr: Petit chaperon rouge
it: Cappuccetto Rosso
mi: Huriwhero

source: Card Type
de: Kartentyp
es: Tipo de carta
fr: Type de carte
it: Tipo di Carta
mi: Momo Kāri

source: Easy Numbers (1 digits)
de: Einfache Zahlen (1-stellig)
es: Números fáciles (1 dígito)
fr: Nombres faciles (1 chiffres)
it: Numeri facili (1 cifra)
mi: He nama ngāwari (1 te mati)

source: Medium Numbers (2 digits)
de: Mittelschwere Zahlen (2-stellig)
es: Números de dificultad media (2 dígitos)
fr: Nombres moyennement faciles (2 chiffres)
it: Numeri medi (2 cifre)
mi: He nama waenganui (e 2 ngā mati)

source: Hard Numbers (3 digits)
de: Schwierige Zahlen (3-stellig)
es: Números difíciles (3 dígitos)
fr: Nombres difficiles (3 chiffres)
it: Numeri difficili (3 cifre)
mi: Ngā Nama Uaua (e 3 ngā mati)

source: None (Blank - Useful as template)
de: Ohne (Leer – als Vorlage geeignet)
es: Ninguno (En blanco - Útil como plantilla)
fr: Aucun (vide — Utile comme modèle)
it: Nessuno (Vuoto - Utile come modello)
mi: Kore (Wātea - He pai hei tauira)

source: Twisted
de: Gewunden
es: Retorcido
fr: Tortueuse
it: Contorto
mi: Takawirihia

source: Train track shape
de: Schienenform
es: Forma de vía de tren
fr: Forme de la voie ferrée
it: Forma del binario del treno
mi: Āhua o te ara tereina

source: Student map
de: Karte für Schüler
es: Mapa para alumnos
fr: Carte pour les élèves
it: Mappa dello studente
mi: Mahere ākonga

source: Island posters
de: Inselposter
es: Carteles de la isla
fr: Cartes des iles
it: Poster delle isole
mi: Pānui whakaahua moutere

source: Dead Man's Island
de: Totenkopfinsel
es: Isla del Hombre Muerto
fr: L'ile de l'Homme mort
it: Isola dell'Uomo Morto
mi: Te Moutere Tūpāpaku

source: Musket Hill
de: Musketenhügel
es: Colina del Mosquetón
fr: La colline des Mousquets
it: Collina del Moschetto
mi: Te Puke Pū Hoata

source: Mutineers' Island
de: Meutererinsel
es: Isla de los Amotinados
fr: L'ile des Mutins
it: Isola degli Ammutinati
mi: Motu Whakakeke

source: Pirates' Island
de: Pirateninsel
es: Isla de los Piratas
fr: L'ile des Pirates
it: Isola dei Pirati
mi: Motu Pairete

source: Shipwreck Bay
de: Schiffswrackbucht
es: Bahía del Naufragio
fr: La baie de l'Épave
it: Baia del Naufragio
mi: Whanga Paeārau

source: Smugglers' Cove
de: Schmugglerbucht
es: Cala de los Contrabandistas
fr: La crique des Contrebandiers
it: Covo dei Contrabbandieri
mi: Kokoru Tāhae Parakete

source: Treasure Island
de: Schatzinsel
es: Isla del Tesoro
fr: L'ile au Trésor
it: Isola del Tesoro
mi: Motu Taonga

source: Printable type
de: Ausdrucksart
es: Tipo de material para imprimir
fr: Type d'impression
it: Tipo di stampabile
mi: Te momo rite mō te tā

source: Boat A
de: Boot A
es: Barco A
fr: Bateau A
it: Barca A
mi: Waka A

source: Boat B
de: Boot B
es: Barco B
fr: Bateau B
it: Barca B
mi: Waka E

source: Printable
de: Ausdruck
es: Material para imprimir
fr: Imprimable
it: Stampabile
mi: Ka taea te tā

source: US Letter
es: Carta (EE. UU.)

source: Paper Size
de: Papierformat
es: Tamaño del papel
fr: Taille du papier
it: Dimensione del foglio
mi: Nui o te Pepa

source: Header Text
de: Kopfzeilentext
es: Texto del encabezado
fr: Texte d'en-tête
it: Intestazione
mi: Tuhinga Pane

source: Example School: Room Four
de: Beispielschule: Raum Vier
es: Ejemplo de escuela: Aula Cuatro
fr: Exemple d'école : Salle 4
it: Scuola Esempio: Aula quattro
mi: Tauira Kura: Rūma Whā

source: Number of Copies
de: Anzahl der Kopien
es: Número de copias
fr: Nombre de copies
it: Numero di copie
mi: E hia ngā Kape

source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
mi: Āe

source: Page not found
de: Seite nicht gefunden
es: Página no encontrada
fr: Page non trouvée
it: Pagina non trovata
mi: Kāore i kitea te whārangi

source: We are sorry but we could not find a page for the link you provided.
de: Wir konnten leider keine Seite für den angegebenen Link finden.
es: Lo sentimos, pero no hemos podido encontrar una página para el enlace proporcionado.
fr: Nous sommes désolés mais nous n'avons pas trouvé de page pour le lien demandé.
it: Siamo spiacenti ma non siamo riusciti a trovare una pagina per il link che hai fornito.
mi: Aroha mai. Kāore i kitea tētahi whārangi mō taua hononga i tukuna mai e koe.

source: You may find one of the links below useful:
de: Eventuell ist einer der nachstehenden Links nützlich:
es: Puede que alguno de los siguientes enlaces te resulte útil:
fr: Vous pouvez trouver utile l'un des liens ci-dessous :
it: Puoi trovare utile uno dei seguenti link:
mi: Tērā pea, ka whai take māu tētahi o ēnei hononga kei raro:

source: Homepage
de: Startseite
es: Página de inicio
fr: Page d'accueil
it: Pagina iniziale
mi: Whārangi Kāinga

source: Search
de: Suchen
es: Buscar
fr: Recherche
it: Cerca
mi: Rapua

source: Classic CS Unplugged
de: CS Unplugged Original
es: CS Unplugged Clásico
fr: CS Unplugged classique
it: CS Unplugged classico
mi: CS Unplugged Ōkawa

source: CS Unplugged at home
es: CS Unplugged en casa
fr: CS Unplugged à la maison

source: Try something different away from the screen
es: Prueba algo diferente lejos de la pantalla
fr: Essayez quelque chose de différent, loin de l'écran

source: <h4>Sorry! This item is not yet available in %(language)s.</h4> <p>This item is available in the following languages:</p>
de: <h4>Tut uns leid! Dieses Unplugged-Element ist noch nicht in %(language)s verfügbar.</h4> <p>Es ist in den folgenden Sprachen verfügbar:</p>
es: <h4>¡Lo sentimos! Este elemento todavía no está disponible en %(language)s.</h4> <p>Este elemento está disponible en los siguientes idiomas:</p>
fr: <h4>Désolé ! Cet élément n'est pas encore disponible en %(language)s.</h4> <p>Cet élément est disponible dans les langues suivantes :</p>
it: <h4>Scusa! Questo oggetto non è ancora disponibile in %(language)s.</h4> <p>Questo oggetto è disponibile nelle seguenti lingue:</p>
mi: <h4>Aroha mai! Kāore anō kia tukua tēnei tuemi i te reo %(language)s.</h4> <p>Engari ka taea ēnei reo:</p>

source: Return to homepage
de: Zurück zur Startseite
es: Volver a la página de inicio
fr: Retour à la page d'accueil
it: Torna alla pagina iniziale
mi: Hoki ki te whārangi kāinga

source: <strong>Welcome to Computer Science Unplugged!</strong> This is a collection of fun and engaging activities that enable children to explore fundamental ideas in Computer Science, <em>without</em> having to use a computer. Traditionally these activities have been designed to be used with school classes and larger groups, but we’ve got many ideas for you to try out if you’re at home.
es: <strong>¡Bienvenido a Computer Science Unplugged!</strong> Se trata de una colección de actividades divertidas y estimulantes que permiten a los niños explorar las ideas fundamentales de la informática, <em>sin</em> tener que usar un ordenador. Tradicionalmente, estas actividades han sido diseñadas para ser utilizadas con clases escolares y grupos grandes, pero tenemos muchas ideas que podrás probar si estás en casa.
fr: <strong>Bienvenue sur Computer Science Unplugged !</strong> Il s'agit d'une sélection d'activités amusantes et attrayantes qui permettent aux enfants d'explorer des idées fondamentales de Science Informatique, <em>sans</em> avoir à utiliser un ordinateur. Historiquement, ces activités ont été conçues pour être utilisées avec des classes d'école et des groupes plus importants, mais nous avons de nombreuses idées à vous proposer si vous êtes à la maison.

source: Language
de: Sprache
es: Idioma
fr: Langue
it: Lingua
mi: Reo

source: Back to CS Unplugged
es: Volver a CS Unplugged
fr: Retour à CS Unplugged

source: Topics
de: Themen
es: Temas
fr: Thèmes
it: Argomenti
mi: Kaupapa

source: Printables
de: Ausdrucke
es: Para imprimir
fr: Imprimables
it: Stampabili
mi: He Rauemi Tānga

source: About
de: Über uns
es: Acerca de
fr: À propos
it: Informazioni
mi: Mō Tēnei

source: Home
de: Startseite
es: Inicio
fr: Accueil
it: Pagina iniziale
mi: Kāinga

source: Looking for something for high schools? Check out the <a href="http://csfieldguide.org.nz/">Computer Science Field Guide</a>.
de: Suchen Sie etwas für weiterführende Schulen? Sehen Sie sich im <a href="http://csfieldguide.org.nz/">Computer Science Field Guide</a> um.
es: ¿Buscas cosas para institutos? Consulta la <a href="http://csfieldguide.org.nz/">Computer Science Field Guide</a>.
fr: Vous cherchez des éléments pour les collèges et lycées ? Consultez le <a href="http://csfieldguide.org.nz/">Guide Pratique de Science Informatique</a>.
it: Cerchi qualcosa per le scuole superiori? Consulta la <a href="http://csfieldguide.org.nz/">Computer Science Field Guide</a>.
mi: Kei te kimi i ngā rauemi mō ngā wharekura? Tirohia te <a href="http://csfieldguide.org.nz/">Computer Science Field Guide</a>.

source: The primary goal of the Unplugged project is to promote Computer Science (and computing in general) to young people as an interesting, engaging, and intellectually stimulating discipline.
de: Das Hauptziel des Unplugged-Projekts besteht darin, jungen Menschen Informatik (und Computing im Allgemeinen) als interessantes, faszinierendes und intellektuell anregendes Wissensgebiet näherzubringen.
es: El objetivo principal del proyecto Unplugged es promocionar la Informática (y la computación en general) entre los jóvenes como una disciplina interesante, fascinante e intelectualmente estimulante.
fr: L'objectif principal du projet Unplugged est de promouvoir la science informatique (et l'informatique en général) auprès des jeunes en tant que discipline intéressante, engageante et stimulante intellectuellement.
it: L'obiettivo principale del progetto CS Unplugged è quello di promuovere l'Informatica ai giovani come una disciplina interessante, coinvolgente e intellettualmente stimolante.
mi: Ko te aronga tuatahi mō tēnei kaupapa Unplugged, ko te whakanui i te Pūtaiaio Rorohiko (me ngā mahinga rorohiko whānui) mō ngā taiohi, hei kaupapa whakakoakoa, whakarekareka hoki, whakahiki hoki i te hinengaro mō rātou.

source: Read more about <a href="%(principles_url)s">our principles here</a>.
de: Mehr über <a href="%(principles_url)s">unsere Grundsätze finden Sie hier</a>.
es: Lee más información acerca de <a href="%(principles_url)s">nuestros principios aquí</a>.
fr: Pour en savoir plus sur <a href="%(principles_url)s">nos principes, cliquez ici</a>.
it: Maggiori informazioni riguardo ai <a href="%(principles_url)s">nostri principi: qui</a>.
mi: Pānui anō mō <a href="%(principles_url)s">ō mātou mātāpono ki konei</a>.

source: Useful Links
de: Nützliche Links
es: Enlaces útiles
fr: Liens utiles
it: Link utili
mi: He Hononga Hei Whakamahi

source: At home
es: En casa
fr: À la maison

source: Community
es: Comunidad
fr: Communauté
mi: Hapori

source: Help
de: Hilfe
es: Ayuda
fr: Aide
it: Aiuto
mi: Āwhina

source: Glossary
de: Glossar
es: Glosario
fr: Glossaire
it: Glossario
mi: Kuputaka

source: Feedback
es: Comentarios
mi: Whakahoki Kōrero

source: Contact
de: Kontakt
es: Contacto
it: Contatti
mi: Whakapā mai

source: The CS Unplugged material is open source on <a href="https://github.com/uccser/cs-unplugged">GitHub</a>, and this website's content is shared under a <a href="https://creativecommons.org/licenses/by-sa/4.0/">Creative Commons Attribution-ShareAlike 4.0 International license</a>. The CS Unplugged is a project by the <a href="https://www.canterbury.ac.nz/engineering/schools/csse/research/cse/">Computer Science Education Research Group</a> at the <a href="http://www.canterbury.ac.nz/">University of Canterbury</a>, New Zealand.
de: Das Material von CS Unplugged steht als Open-Source-Material auf <a href="https://github.com/uccser/cs-unplugged">GitHub</a> zur Verfügung und die Inhalte dieser Website sind unter einer <a href="https://creativecommons.org/licenses/by-sa/4.0/">internationalen Creative Commons Attribution-ShareAlike 4.0 Lizenz</a> verfügbar. CS Unplugged ist ein Projekt der <a href="https://www.canterbury.ac.nz/engineering/schools/csse/research/cse/">Computer Science Education Research Group</a> der <a href="http://www.canterbury.ac.nz/">University of Canterbury</a>, Neuseeland.
es: El material de CS Unplugged es de acceso libre y se encuentra en <a href="https://github.com/uccser/cs-unplugged">GitHub</a>y el contenido de este sitio web se comparte bajo una <a href="https://creativecommons.org/licenses/by-sa/4.0/">licencia Attribution-ShareAlike 4.0 International de Creative Commons</a>. CS Unplugged es un proyecto llevado a cabo por el <a href="https://www.canterbury.ac.nz/engineering/schools/csse/research/cse/">Computer Science Education Research Group</a> de la <a href="http://www.canterbury.ac.nz/">Universidad de Canterbury</a>, Nueva Zelanda.
fr: Le contenu de CS Unplugged est en open source sur <a href="https://github.com/uccser/cs-unplugged">GitHub</a>, et le contenu de ce site web est partagé sous une licence <a href="https://creativecommons.org/licenses/by-sa/4.0/deed.fr">Creative Commons Attribution - Partage dans les Mêmes Conditions</a>. CS Unplugged est un projet du <a href="https://www.canterbury.ac.nz/engineering/schools/csse/research/cse/">Computer Science Education Research Group</a> de l'<a href="http://www.canterbury.ac.nz/">Université de Canterbury</a>, Nouvelle-Zélande.
it: Il materiale CS Unplugged è open source su <a href="https://github.com/uccser/cs-unplugged">GitHub</a> e il contenuto di questo sito web è condiviso sotto una <a href = "https: / /creativecommons.org/licenses/by-sa/4.0/">Licenza internazionale Creative Commons Attribuzione -Condividi allo stesso modo 4.0</a>. CS Unplugged è un progetto del <a href="http://www.cosc.canterbury.ac.nz/research/RG/CSE/">Gruppo di Ricerca in Didattica dell'Informatica</a> presso la <a href = "http://www.canterbury.ac.nz/">University of Canterbury</a>, Nuova Zelanda.
mi: Kua tukuna ngā rauemi CS Unplugged hei rauemi whakatuwhera pūtake ki <a href="https://github.com/uccser/cs-unplugged">GitHub</a>, ā, kua tuaritia ngā ihirangi o te pae tukutuku kei raro i te <a href="https://creativecommons.org/licenses/by-sa/4.0/">Creative Commons Attribution-ShareAlike 4.0 International license</a>. He kaupapa te CS Unplugged nā te <a href="https://www.canterbury.ac.nz/engineering/schools/csse/research/cse/">Computer Science Education Research Group</a> kei <a href="http://www.canterbury.ac.nz/">Te Whare Wānanga o Waitaha</a>, Aotearoa.

source: Icons provided generously by <a target="_blank" rel="noopener noreferrer" href="https://icons8.com/">icons8</a>.
es: Iconos proporcionados generosamente por <a target="_blank" rel="noopener noreferrer" href="https://icons8.com/">icons8</a>.
fr: Icônes généreusement fournies par <a target="_blank" rel="noopener noreferrer" href="https://icons8.com/">icons8</a>.

source: This definition is not available in %(language)s, sorry!
de: Diese Definition ist leider nicht in %(language)s verfügbar!
es: ¡Lamentablemente esta definición no está disponible en %(language)s!
fr: Désolé ! Cette définition n'est pas disponible en %(language)s.
it: Questa definizione non è disponibile in %(language)s, mi dispiace!
mi: Kāore e taea te tautuhi mō te reo %(language)s, aroha mai!

source: Close
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
mi: Katia

source: Unit Plan:
de: Lehrplan:
es: Plan de estudios:
fr: Module :
it: Unità didattica:
mi: Mahere Kōwae:

source: CS Unplugged is a collection of free learning activities that teach Computer Science through engaging games and puzzles that use cards, string, crayons and lots of running around. We originally developed this so that young students could dive head-first into Computer Science, experiencing the kinds of questions and challenges that computer scientists experience, but without having to learn programming first.
de: CS Unplugged ist eine Sammlung kostenloser Lernaktivitäten, durch die Informatik anhand von anregenden Spielen und Aufgaben mit Karten, Bindfaden, Wachsstiften und viel Herumrennen gelehrt wird. Es wurde von uns ursprünglich entwickelt, damit sich junge Schüler kopfüber in das Thema Informatik stürzen können und dabei mit ähnlichen Fragen und Problemstellungen konfrontiert werden, denen sich Informatiker ausgesetzt sehen, jedoch ohne zuerst Programmieren lernen zu müssen.
es: CS Unplugged es una colección de actividades de aprendizaje gratuitas que enseñan Informática a través de interesantes juegos y puzles con la ayuda de cartas, cuerdas, lápices de colores y mucha actividad física. Originalmente lo desarrollamos para que los jóvenes estudiantes pudieran sumergirse de lleno en la Informática, experimentando el tipo de preguntas y desafíos que experimentan los científicos informáticos, pero sin tener que aprender programación primero.
fr: CS Unplugged est un ensemble gratuit d'activités d'apprentissage qui enseigne la science de l'informatique à travers des jeux et des casse-têtes captivants qui utilisent des cartes, des cordes, des crayons de couleur et beaucoup de remue-ménages. Nous l'avons d'abord développé pour que les jeunes élèves puissent plonger la tête la première dans l'informatique, et aborder les mêmes types de questions et de défis que les chercheurs en informatique, mais sans avoir à apprendre la programmation en premier.
it: CS Unplugged è una raccolta di materiali didattici gratuiti che insegna l'Informatica attraverso giochi coinvolgenti e puzzle che usano carte, fili, pastelli e un sacco di movimento fisico. Inizialmente lo abbiamo sviluppato di modo che i giovani studenti potessero tuffarsi a capofitto nell'Informatica, sperimentando le tipologie di domande e sfide che gli informatici vivono, ma senza dover prima imparare a programmare.
mi: Ko CS Unplugged tētahi kohinga ngohe utu kore e whakaako ana i te Pūtaiao Rorohiko, mā ngā kēmu whakakoakoa me ngā panga e whakamahi nei i ngā kāri, aho hoki, pene hinu hoki, omaoma haere hoki. Ko te kaupapa i tīmata ai ēnei mahi, kia tukua ngā ākonga nohinohi ki te ruku ki te Pūtaiao Rorohiko, kia waia rātou ki ngā momo pātai, ngā momo wero hoki e pā ana ki te mahi pūtaiao rorohiko, engari me te kore ako i te tuhiwaehere i te tuatahi.
